emacs-250913/configuration.org
+title: My Emacs Configuration

#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+auto_tangle: t
#+options: toc:2

* README

** Installation

*** 1. MacOS

You should install =Emacs Plus= to support all missing features in =Mac version=!!!

https://github.com/d12frosted/homebrew-emacs-plus

By default (without any addition options) this formula install Cocoa version of Emacs with support of =gnutls=, =imagemagick= (not included by default with =emacs-plus@29= and =emacs-plus@30=), =librsvg=, =libxml2=, dynamic modules and multicolor fonts. Please see the list of available options to disable any bit of default behaviour or add even more stuff.

Any I prefer install with the following options/features:

| Option                    | Description                                                                             |
|---------------------------+-----------------------------------------------------------------------------------------|
| --with-native-comp        | Native compilation, super important for solving the performance issue.                  |
| --with-imagemagick        | build with imagemagick support.                                                         |
| --with-modern-yellow-icon | More icons you can choose form  https://github.com/d12frosted/homebrew-emacs-plus#icons |

#+BEGIN_SRC bash
  brew tap d12frosted/emacs-plus

  brew install emacs-plus \
      --with-native-comp \
      --with-imagemagick \
      --with-modern-yellow-icon
#+END_SRC


Also, you can choose to install different versions:

#+BEGIN_SRC bash
  # brew tap d12frosted/emacs-plus
  # brew install emacs-plus    [options] # install the latest release (Emacs 29)
  # brew install emacs-plus@30 [options] # install Emacs 30 (master)
  # brew install emacs-plus@29 [options] # install Emacs 29
  # brew install emacs-plus@28 [options] # install Emacs 28
  # brew install emacs-plus@27 [options] # install Emacs 27
  # brew install emacs-plus@26 [options] # install Emacs 26
#+END_SRC


After installation, you got 2 ways to confirm that it's the =Native compilation= verison:

A. Open emacs and run the following =LISP= command:

    #+BEGIN_SRC emacs-lisp :tangle no
      (native-comp-available-p)
    #+END_SRC

    If it returns =t=, that mean YES, that's the =Native compilation= version:)


B. Open emacs and run the following =LISP= command:

    #+BEGIN_SRC emacs-lisp :tangle no
      (describe-variable 'system-configuration-features (current-buffer) nil)
    #+END_SRC

    If the output contains =NATIVE_COMP=, that mean YES, that's the =Native compilation= version:)


*** 2. Arch Linux

#+BEGIN_SRC bash
  # doas pacman --refresh --sync emacs

  # You should install the native compilation built-in version!!!
  doas pacman --refresh --sync emacs-nativecomp
#+END_SRC

If you see the following error when you run =emacs=:

#+BEGIN_SRC bash
  /usr/lib/libc.so.6: Version "GBLIC_X.Y.Z" not found
#+END_SRC

then you should re-install (upgrade) =glibc= to the corect version:

#+BEGIN_SRC bash
  doas pacman --refresh --sync glibc
#+END_SRC


Here is how to check the version you installed whether =native compilation= or not:

Open =emacs= and run ~(native-comp-available-p)~, if it returns =t= that means YES, =nil= is not.


** About the default configuration file and its location

1. In =MacOS=, the default configuration file locates in =~/.emacs.d=

   If you want to use =~/.config/emacs= instead of =~/.emacs.d=, then you HAVE TO remove =~/.emacs.d=.
   Otherwise, it won't load the =~/.config/emacs/init.el=!

2. I use =org-auto-tangle= package, so it generates the updated =./init.el= and =./early-init.el= automatically when this file has been saved.

   You can see the following messages print out to =*Messages*= buffer every time when saving this file.

   #+BEGIN_SRC emacs-lisp :tangle no
     ;; Tangling /home/wison/.config/emacs/configuration.org...
     ;; Tangling "/home/wison/.config/emacs/configuration.org" completed after 0.35 seconds
   #+END_SRC


** The Early Init File: =~/.config/emacs/early-init.el=

Most customizations for =Emacs= should be put in the normal =init= file. However, it is sometimes necessary to have customizations take effect during Emacs startup earlier than the normal =init= file is processed.

Such customizations can be put in the early init file, =~/.config/emacs/early-init.el= or =~/.emacs.d/early-init.el=.

This file is loaded before the package system and GUI is initialized, so in it you can customize variables that affect the package initialization process, such as ~package-enable-at-startup~, ~package-load-list~, and ~package-user-dir~. Note that variables like ~package-archives~ which only affect the installation of new packages, and not the process of making already-installed packages available, may be customized in the regular init file. See Package Installation.


** First time to run =Emacs=

You better to run the =Emacs= in daemon mode, as the it takes time to download all packages for the first time.

Actually, you should add the debug flag like this:

#+BEGIN_SRC bash
  emacs --daemon --debug-init
#+END_SRC

Then you can see the detail debug log. Also, sometimes it will fail to connect to =melpa.org/443=, if you
see the following error:

#+BEGIN_SRC bash
  Contacting host: stable.melpa.org:443

  # Ignore output
  ...... 

  # Finally, fail to install some pacakges
  Error (use-package): Failed to install org-bullets: melpa.org/443 Temporary failure in name resolution
#+END_SRC

So, you need to kill the existing =emacs= process and re-run =emacs --daemon --debug-init= command again
until you see it runs successfully like this:

#+BEGIN_SRC bash
  emacs --daemon --debug-init

  # Warning: due to a long standing Gtk+ bug
  # https://gitlab.gnome.org/GNOME/gtk/issues/221
  # Emacs might crash when run in daemon mode and the X11 connection is unexpectedly lost.
  # Using an Emacs configured with --with-x-toolkit=lucid does not have this problem.
  # Loading /home/wison/.config/emacs/settings.el (source)...
  # Loading /home/wison/.config/emacs/settings.el (source)...done
  # Loaded /home/wison/.config/emacs/settings.el
  # Loading /home/wison/.config/emacs/package.el (source)...
  # Loading /home/wison/.config/emacs/package.el (source)...done
  # Loaded /home/wison/.config/emacs/package.el
  # Loading /home/wison/.config/emacs/evil.el (source)...
  # Loading /home/wison/.config/emacs/evil.el (source)...done
  # Loaded /home/wison/.config/emacs/evil.el
  # Starting Emacs daemon.

#+END_SRC


** How to run =Emacs=

You can run emacs in different ways:

**** Run =Eamcs= as a server

For runing as a server:

#+BEGIN_SRC bash
  #
  # Run emacs as a server in background, same with 'emacs --bg-daemon'
  #
  emacs --daemon

  #
  # Run emacs as a server in foreground, good for debugging to see all console output
  #
  emacs --fg-daemon

  #
  # Run emacs as a named server in background, then you can have multiple server instances
  #
  emacs --daemon=XXX
  emacs --daemon=YYY
  emacs --daemon=ZZZ
#+END_SRC

When you run multiple named server instances, you can describe-variable on ~server-socket-dir~ to confirm the server socket folder, that folder contains all named server socket files.


After that, you can use ~emacsclient~ to communicate with the server:

#+BEGIN_SRC bash
  #
  # Open emacs in GUI mode
  #
  # As that's GUI program, you better to run it in background to avoid holding the current console
  #
  # -c, --create-frame: Create a new frame instead of trying to use the current Emacs frame
  # -a: if Emacs server doesn't run yet, then fallback to the given EDITOR)
  #
  emacsclient -c -a "nvim" &

  # Open emacs in terminal mode
  emacsclient -t
#+END_SRC


And you can kill the emacs server like this

#+BEGIN_SRC bash
  emacsclient -e \("kill-emacs"\)

  # If you only want to kill the given server instance
  emacsclient -e \("kill-emacs"\) --socket-name=XXX
#+END_SRC


**** Run =Emacs= as stand-alone instance


#+BEGIN_SRC bash
  # Open emacs in GUI mode
  emacs &

  # Open emacs in terminal mode
  # emacs -nw
  emacs --no-window-system
#+END_SRC



** How to export code block content into a given file (=*.el=)

All configuration contents in this file will be exported to ~init.el~ and ~early-init.el~ by running ~org-babel-tangle~ command, it exports all code blocks to the given file. You have a few ways to control how to export:

*** Specific each code block to export to the given file

~#+begin_src emacs-lisp :tangle ./A.el~
~#+end_src~

~#+begin_src emacs-lisp :tangle ./B.el~
~#+end_src~


*** Add property to define default export file

Or you can add the following property before the first headline of this line

~#+PROPERTY: header-args:emacs-lisp :tangle ./init-example.el~

It acts as a default tangle target, then you only need to specific in the code block.

But if you want to export to a different file, you can specific like this:

~#+begin_src emacs-lisp :tangle ./another.el~
~#+end_src~


Or you want to temporary disable/ignore tangle for the particular code block, then you can specific like this:

~#+begin_src emacs-lisp :tangle no
~#+end_src~

But keep that in mind, =you have to re-open this file to take affect if you changed the default tangle file!!!=


** How to export ORG file content to HTML

You can run ~org-export-dispatch~ command to export your ORG file to any supported output formats.

After running the ~org-export-dispatch~ command, you will see the popup buffer like this:

#+BEGIN_SRC text
 Use SPC, DEL, C-n, or C-p to navigate.
 [C-b] Body only:    Off           [C-v] Visible only:     Off
 [C-s] Export scope: Buffer        [C-f] Force publishing: Off
 [C-a] Async export: Off


 [c] Export to iCalendar
     [f] Current file              [a] All agenda files
     [c] Combine all agenda files

 [h] Export to HTML
     [H] As HTML buffer            [h] As HTML file
     [o] As HTML file and open

 [l] Export to LaTeX
     [L] As LaTeX buffer           [l] As LaTeX file
     [p] As PDF file               [o] As PDF file and open

 [o] Export to ODT
     [o] As ODT file               [O] As ODT file and open

 [t] Export to Plain Text
     [A] As ASCII buffer           [a] As ASCII file
     [L] As Latin1 buffer          [l] As Latin1 file
     [U] As UTF-8 buffer           [u] As UTF-8 file

 [P] Publish
     [f] Current file              [p] Current project
     [x] Choose project            [a] All projects


 [&] Export stack                  [#] Insert template
 [q] Exit 
#+END_SRC

Then press ~h~ to focus on the HTML exporting.

*** Export customization

**** Export =TOC= (Table Of Content)

You can set the global variable ~org-export-with-toc~ to ~t~ if you want of export the =TOC=, or set it to ~nil~ if you don't. That setting affects all ORG files.

But you can set it to ~nil~ by default and add the following options to the particular ORG file to affect only for the given file:

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Disable  exporting =TOC= for this ORG file
  ;;
  #+options: toc:nil

  ;;
  ;; Enable exporting =TOC= for this ORG file
  ;;
  #+options: toc:t

  ;;
  ;; Enable exporting =TOC= for this ORG file and ONLY export the all heading level 1
  ;;
  #+options: toc:1

  ;;
  ;; Enable exporting =TOC= for this ORG file and ONLY export the all heading level 2
  ;;
  #+options: toc:2
#+END_SRC



** Install =Treesitter langauge grammar=

You need to evaluate the following command to install all treesitter language grammars.

#+begin_src emacs-lisp :tangle no
  (mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist))
#+end_src


** Learn how to use ~use-package~

https://github.com/jwiegley/use-package#getting-started


** Edit =emacs-lisp= source code in =org-mode=

When editing =emacs-lisp= source code your =org= file inside the =emacs-lisp= code block like this:

#+BEGIN_SRC emacs-lisp :tangle no
  (message "Hey:)")
#+END_SRC

You can press ~C-c '~ inside the code block to open a source code editing window in the =emacs-lisp= major mode (or any major mode you specified following by the =#+BEGIN_SRC=), then your =company-mode= and =eglot-mode= wll work well!!!

Then you don't need to switch to the =*scratch*= to edit your code for having the better coding experience and switch back:)


** How to run shell command in =Emacs=

You can run any emacs-lisp expressions in =evil commmand mode= which means you type ~:~ and follow by your emacs-lisp expression.

Also, you can run a shell commmand by ~:!~ and then follow by your shell command.

In the =dired-mode=, you can run a shell command by ~!~ or ~&~:

+ ~!~ runs the command ~dired-do-shell-command~ to execute your shell command.
+ ~&~ runs the command ~dired-do-async-shell-command~ to execute your shell command asynchronously.

And 2 things you need to know:

1. The shell command result will print out in the echo area or open a new buffer (depending on the output length).

2. You =SHOULD NOT= run any shell command that asks for interactive with =vim-keybindings=, as the command will halt and your keystrokes only go into the evil mode and operate inside the buffer (not passing to the shell command)!!!


** How to handle =org table=

Here, I only list the most convenient parts that I'm interested in, for more details, please have a look [[https://orgmode.org/manual/Built_002din-Table-Editor.html][here]].

Here are the default org table commands and behaviors:

*** Auto create table heading line and the first row

When finishing typing the following header line (=C= is your cursor position):

=|Name|Description|C=

Then you can press ~C-c RET~, it calls the ~org-ctrl-c-ret~ command to add the =hline= and first row like this:

| Name | Description |
|------+-------------|
| C    |             |

And =C= is your new cursor position, then you can keep typing.


*** Use =TAB= and =RET= to jump

When you got a table like the following (=C= is your cursor position):

| Name | Description |
|------+-------------|
| C    |             |

Then you can press ~TAB~ or ~RET~ to switch between columns and rows. Bascially, it calls ~org-cycle~ command. The main purpose of ~org-cycle~ is outline visibility cycling, but it also invokes other actions:

When inside a table, re-align the table and move to the next field.

But it works in different ways in =evil-mode=:


**** Move to the next column (create new row when hitting the most-right column)

| Name | Description |
|------+-------------|
|    C |           1 |
|    2 |           3 |
|    4 |             |

Suppose you have the above table, then in =Normal= mode, you press =RET= to call ~org-cycle~ command. Your cursor should jump like this:

C -> 1 -> 2 -> 3 -> 4


**** Move to the next column but next row (create new row when hitting the most-right column)

| Name | Description |
|------+-------------|
|    C |             |
|    1 |             |
|    2 |             |
|    3 |             |
|    4 |             |

Suppose you have the above table, then in =Insert= mode, you press =RET= to call ~org-return~ command. Your cursor should jump like this:

C -> 1 -> 2 -> 3 -> 4

Jump to next row and same column!!!

But if you want to jump to next column (in the same row) in =Insert= mode, you can press =TAB= to call =org-cycl=.


** How to handle =org= mode link manually

**** how to create link

Under the hook, org link format just like this =[[LINK_URL][DESCRIPTION_TO_DISPLAY]]=.

You can type from left to right, it won't show as a =Link= until you type the final =]= character.


