emacs-250913/configuration.org
***** 2. Bind key to local buffer

The example above binds the ~C-c a~ to =org-mode-map=, But you can't stop other installed packages from binding the same keybindings to the same hook sometimes. If that happens, then duplicated binding to =org-mode-map= might happen. So, if there is no special needs, you should use =xxx-mode-hook= to do defer binding to the local buffer, as this promises no duplicated bindings.

Let's fix the above duplicated bindings:

#+begin_src emacs-lisp :tangle no
  ;;
  ;; Command to run when pressing 'C-c a'
  ;;
  (defun print_a_message()
      (interactive)
      (message "Print something by pressing 'C-c a'.")
  )

  ;;
  ;; The bind function to be called when 'org-mode' is aviable
  ;;
  (defun bind-test-key-to-org-mode-via-hook()
    (message ">>> [ bind-test-key-to-org-mode-via-hook ] Set temp keybinding 'C-c a' local buffer")

    ;;
    ;; Bind the local buffer scope rather than the 'org-mode-map'
    ;;
    (define-key evil-normal-state-local-map (kbd "C-c a") 'print_a_message)

    ;;
    ;; '(evil-local-set-key 'normal KEY COMMAND)' is the same with 
    ;; '(define-key evil-normal-state-local-map KEY COMMAND)',
    ;;
    ;; Just pick the one you like to use
    ;;
    ;; (evil-local-set-key 'normal (kbd "C-c a") 'print_a_message)
  )

  ;;
  ;; Add the bind function to 'org-mode-hook'
  ;;
  (add-hook 'org-mode-hook #'bind-test-key-to-org-mode-via-hook)
#+end_src

Then when you open an =org= file or run ~org-mode~ (to reload), then run ~describe-variable~ on =org-mode-map=, you won't see any key binding to call the ~print_a_message~ command.

But if you run ~describle-bindings~ (in the org file buffer),  you should see the following setting is on the top part:

~=evil-normal-state-local-minor-mode' Minor Mode Bindings:~
    ~Key             Binding~
    ~C-c a		print_a_message~

That means the ~C-c a~ only bind to the current opened buffer, try to press ~C-c a~, you should see the ~Print something by pressing ’C-c a’.~ debug message has been printed to the =*Messages*= buffer, that said your mode-hook settings is working:)


*** How to unbind all keybindings for the given mode

If you really want to unbind all keybindings for the particular mode, do like this:

#+BEGIN_SRC emacs-lisp :tangle no
  (setf (cdr YOUR_MODE_NAME_HERE) nil)
#+END_SRC


** How to pipe stdout into Emacs =scratch= buffer

You can't do something like this:

#+BEGIN_SRC fish
  cat ~/temp/data.txt | emacs --no-window-system

  #
  # Error:
  #
  # emacs: standard input is not a tty 
#+END_SRC

Instead, you should redirect the pipe content into a temp file and then open =Emacs= by call the ~insert-file~ function like this:

#+BEGIN_SRC fish
  #
  # '/tmp/emacs_temp' is the temp file
  #
  cat ~/temp/data.txt > /tmp/emacs_temp && emacs --no-window-system --eval "(insert-file \"/tmp/emacs_temp\")" 
#+END_SRC


** How to customize abbreviation

When you need help, run ~info~ and goto the section: =Elisp -> Abbrevs=

*** Quick introduction

=Abbreviation= in Emacs means that you type something, it expands to something else for you: =abbr --> expansion=

=Abbreviation= lives in different tables:

- =global-abbrev-table=: The abbrev table whose abbrevs affect all buffers.

- =xxx-mode-abbrev-table=: Abbrev table for xxx mode, it only affects the related buffer with the same mode.

For example, if you add some abbrevs into ~emacs-lisp-mode-abbrev-table~ and ~global-abbrev-table~, and if you run:

~describe-variable global-abbrev-table
~describe-variable emacs-lisp-mode-abbrev-table~


Then you got something like this:

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; 'emacs-lisp-mode-abbrev-table'
  ;;
  (define-abbrev-table 'emacs-lisp-mode-abbrev-table
  	'(
  	  ("bg" "background" nil :count 0)
  	  ("btw" "By the way" nil :count 0)
  	)
  )

  ;;
  ;; 'global-abbrev-table'
  ;;
  (define-abbrev-table 'global-abbrev-table
    '(
      ("afaik" "as far as I know" nil :count 0)
      ("atm" "at this moment" nil :count 0)
      ("bg" "background" nil :count 0)
      ("fg" "foreground" nil :count 0)
  	)
  )
#+END_SRC

That's how abbreviation works in Emacs, really simple:)

But one thing you need to keep that in mind:

If you have the same abbr in =global-abbrev-table= and =xxx-mode-abbrev-table=, then the abbr in =xxx-mode-abbrev-table= will be used if you're in =xxx-mode=!!!


Here are the steps customize your own abbrs:


*** How to list abbrs?

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Display a list of the defined abbrevs.
  ;;
  ;; (list-abbrevs &optional LOCAL)
  ;;

  ;; Only list the abbr table that in current buffer's mode 
  (list-abbrevs t)

  ;; List all abbr tables
  (list-abbrevs)
#+END_SRC


*** How to add/remove your own abbrs

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Define ABBREV in TABLE, to expand into EXPANSION and optionally call HOOK.
  ;;
  ;; (define-abbrev TABLE ABBREV EXPANSION &optional HOOK &rest PROPS)

  ;;
  ;; For example:
  ;;

  ;;
  ;; For all buffers (no matter what mode is)
  ;;
  (define-abbrev global-abbrev-table "bg" "background")
  (define-abbrev global-abbrev-table "fg" "foreground")
  (define-abbrev global-abbrev-table "afaik" "as far as I know")
  (define-abbrev global-abbrev-table "atm" "at this moment")
  (define-abbrev global-abbrev-table "mygithub" "https://github.com/wisonye")
  (define-abbrev global-abbrev-table "mylinkedin" "https://www.linkedin.com/in/wison-y-51888887/")

  ;;
  ;; Only for 'emacs-lisp-mode' buffers
  ;;
  (define-abbrev emacs-lisp-mode-abbrev-table "setql" "(setq-local")
  (define-abbrev emacs-lisp-mode-abbrev-table "func" "(defun XXX ()\n\t(interactive)\n\n)")
  (define-abbrev emacs-lisp-mode-abbrev-table "km" "(keymap-set MODE-MAP \"KEY\" ')")
  (define-abbrev emacs-lisp-mode-abbrev-table "when" "(when CONDITION BODY)")

  (define-abbrev emacs-lisp-mode-abbrev-table "stringempty" "(string-empty-p VAR)")
  (define-abbrev emacs-lisp-mode-abbrev-table "stringnotempty" "(not (string-empty-p VAR))")
  (define-abbrev emacs-lisp-mode-abbrev-table "stringmatch" "(string-match-p STRING-TO-CHECK VAR)")
  (define-abbrev emacs-lisp-mode-abbrev-table "stringnotmatch" "(not (string-match-p STRING-TO-CHECK VAR))")

  ;;
  ;; Remove the abbr by setting the 'EXPANSION' to 'nil'!!!
  ;;
  (define-abbrev global-abbrev-table "bg" nil)
  (define-abbrev emacs-lisp-mode-abbrev-table "setql" nil)
#+END_SRC



*** Enable the ~abbrev-mode~ for your buffer

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Only enable 'abbrev-mode' for the current buffer, not very useful.
  ;;
  (abbrev-mode)

  ;;
  ;; Use 'hook' to enable 'abbrev-mode', for example:
  ;;
  (add-hook 'prog-mode-hook #'abbrev-mode)
#+END_SRC


*** How to trigger abbrev compleiton

After enabling the ~abbrev-mode~, press ~SPC~ to trigger abbr expansion.



*** How to add an interactive and flexible abbrev like a snippet

Read the doc again:

#+BEGIN_SRC emacs-lisp :tangle no
  (define-abbrev TABLE ABBREV EXPANSION &optional HOOK &rest PROPS)

  If HOOK is non-nil, it should be a function of no arguments, it is called after EXPANSION
  is inserted.

  If EXPANSION is not a string (and not nil), the abbrev is a special one, which does not
  expand in the usual way but only runs HOOK.
#+END_SRC


That said you can do something like this to make that happen:

**** The basic hook tricks

#+BEGIN_SRC emacs-lisp :tangle no
  (defun my-abbr-now ()
      "Abbr expension to now datetime"
  	(insert (current-time-string))
  )

  (defun my-abbr-now-only-date ()
      "Abbr expension to now datetime"
  	(insert (format-time-string "%Y-%m-%d %H:%M:%S"))
  )

  (defun my-abbr-now-only-time ()
      "Abbr expension to now datetime"
  	(insert (format-time-string "%H:%M:%S"))
  )

  ;;
  ;; When typing 'now' and press 'SPC', it runs the hook function
  ;; to 'insert' your custom string into the current pos!!!
  ;;
  (define-abbrev global-abbrev-table "now" "" 'my-abbr-now)
  ;; (define-abbrev global-abbrev-table "now" "" 'my-abbr-now-only-date)
  ;; (define-abbrev global-abbrev-table "now" "" 'my-abbr-now-only-time)
#+END_SRC


**** Interactive abbr

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Ask you to provide the 'mode-map', 'key' and the 'function/command' to insert
  ;; this text:
  ;;
  ;; (keymap-set MODE_MAP "KEY" 'FUNCTION) 
  ;;
  (defun my-keymap-set ()
      "Abbr for insert the interactive 'keymap-set'"
  	(interactive)
  	(insert (format
  				"(keymap-set %s \"%s\" '%s)"
  				(read-string "Your mode map: ")
  				(read-string "Your key: ")
  				(read-string "Your function: ")
  			)
  	)
  )

  ;;
  ;; when typing 'mkm' and press 'SPC', expand to nothing (empty "") and run the
  ;; hook function, then you're able insert any complicated text as the final
  ;; expansion:)
  ;;
  (define-abbrev emacs-lisp-mode-abbrev-table "mkm" "" 'my-keymap-set)
#+END_SRC


** How to customize the =minibuffer=

*** The default prompt format

By default, you will see the following minibuffer pops up if you press ~C-x b~:

#+BEGIN_SRC conf
  1/7    Switch to buffer (default *scratch*):
  ,*scratch*                                                     **-  265      Lisp Interaction
  ,*Messages*                                                    %*-  5.5k     Messages
  lisp-quick-tutorial.org                                       ---  45k      Org                    ~/.config/emacs/lisp-quick-tutorial.org
  ,*info*                                                        %%-  2.8k     Info                                  (emacs) Basic Minibuffer
#+END_SRC

That ~(default *scratch*)~ part is set by the ~minibuffer-default-prompt-format~ variable, and its default value is ~" (default %s)"~.

So, you can change it like this:

#+BEGIN_SRC emacs-lisp :tangle no
  (setq minibuffer-default-prompt-format " [ default - %s ]")
#+END_SRC

It becomes:

#+BEGIN_SRC conf
  1/7    Switch to buffer [ default - *scratch* ]:
#+END_SRC


*** The height of the minibuffer

**** Minimal height

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; The default value,which means let mini-windows grow only; they return to their
  ;; normal size when the minibuffer is closed, or the echo area becomes empty.
  ;;
  (setq resize-mini-windows 'grow-only)

  ;;
  ;; The minibuffer window never changes size automatically.
  ;;
  (setq resize-mini-windows nil)

  ;;
  ;; The minibuffer window will also shrink automatically if you remove some lines
  ;; of text from the minibuffer, down to a minimum of one screen line.
  ;;
  (setq resize-mini-windows t)
#+END_SRC


**** Maximal height

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; If a float, it means a percentage of current frame window's height.
  ;;
  ;; If an integer, it means the number of lines.
  ;;
  ;; Default is '0.25'
  ;;
  (setq max-mini-window-height 0.25)

#+END_SRC


*** The ~minibuffer-mode~ hook

When active, the minibuffer is usually in ~minibuffer-mode~.  This is an internal Emacs mode without any special features.

If you want to run some commands when the this mode is active, you SHOULD use ~minibuffer-setup-hook~ and ~minibuffer-exit-hook~ rather than the mode hook of this mode!!!


*** Enable fuzzy searching in minibuffer

By default, the ~completion-styles~ default value is: ~(basic partial-completion emacs22)~

With this default value, you have to type =*scra= to search in =Buffers list= and type =lo-them= to search for =load-theme=.

But if you add the ~'flex~ symbol to the list, it will support fuzzy searching. That said, you can type =scra= (without the =*=) and =lothe= with the =-=!!!

#+BEGIN_SRC emacs-lisp :tangle no
  (push 'flex completion-styles)
#+END_SRC

For more detail info, run ~info~ and goto the section:

=Emacs -> Minibuffer -> Completion -> Completion Styles=



** How ~consult-ripgrep~ works

This is source code, super simple:
 
#+BEGIN_SRC emacs-lisp :tangle no
  (defun consult-ripgrep (&optional dir initial)
  	"Search with `rg' for files in DIR with INITIAL input.
  	See `consult-grep' for details."
  	(interactive "P")
  	(consult--grep "Ripgrep" #'consult--ripgrep-make-builder dir initial)
  )
#+END_SRC


*** Here is how it works:

- It calls ~consult--grep~ with the prompt ~"Ripgrep"~ and a =grep= command line build function.

- ~consult--ripgrep-make-builder~ (the command line build function) generates the =Riggrep= commmand line to run. It read from the default ~rg~ command line string from the global var ~consult-ripgrep-args~, which has the following default string value:

  #+BEGIN_SRC fish
    rg --null --line-buffered --color=never --max-columns=1000 --path-separator /   --smart-case --no-heading --with-filename --line-number --search-zip
  #+END_SRC

That causes ~consult--grep~ to use ~rg~ external command instead of the default ~grep~!!!
  

*** Here are something you need to know

**** ~dir~ parameter

It can be any forms of the following:

- ~nil~, which means pick the current ~default-diretory~ I believe

- A directory string, e.g.: ~/home/wison/temp~

- A list of file/directory path, e.g.: 

  #+BEGIN_SRC emacs-lisp :tangle no
    (let (
    		(odin_root (string-trim (getenv "ODIN_ROOT")))
    		(odin_utils_path (expand-file-name "./odin/odin-utils" (getenv "HOME")))
    	)
    	(list odin_root odin_utils_path)
    )
  #+END_SRC


**** The ~input~ string rules

For example, if you type the following input text in the prompt:

#+BEGIN_SRC fish
  Ripgrep (~/.config/emacs): #defun odin-rg-search#v2
#+END_SRC

That means:

- The =defun odin-rg-search= (the string after the first ~#~ and before the second ~#~) will be passed into the ~rg~ external command as regex pattern
- The =v2= (the string starts after the second ~#~) will be used to filter inside the result minibuffer



If you want to pass specific ~rg~ CLI options, you can do that in the format:

#+BEGIN_SRC fish
  Ripgrep (~/.config/emacs): #defun odin-rg-search -- -A2#v2
#+END_SRC

That means:

- The =defun odin-rg-search= (the string after the first ~#~ and before the second ~#~) will be passed into the ~rg~ external command as regex pattern
- The =-A2= (the string starts after the ~--~ ) will be passed as the ~rg~ command options!!!
- The =v2= (the string starts after the second ~#~) will be used to filter inside the result minibuffer




**** Escape the ~space~

By default, ~consult-ripgrep~ use =space= to separate multiple regular expression.

For example:

#+BEGIN_SRC fish
  1/7    Ripgrep (…/../odin-utils, …/../Odin): #^make_dynamic_array ::
#+END_SRC

This means you run ~rg~ with ~-e "^make_dynamic_array" -e ~" :: "~!!!!


If you want your input become a single regular expression, you need to escape the =space= character like this:

#+BEGIN_SRC fish
  1/2    Ripgrep (…/../odin-utils, …/../Odin): #^make_dynamic_array\ ::
#+END_SRC


* My configuration

** Basic settings

*** Use =Super= key as =Meta= (But it works in =GUI= mode only)

#+begin_src emacs-lisp
  ;;
  ;; For MacOS
  ;;
  (if (string-equal "darwin" system-type)
      (progn
  		(setq mac-command-modifier 'meta)
  		(message ">>> MacOS, set 'super' key as 'meta' key." system-type)
  	)
  )

  ;;
  ;; For Linux
  ;;
  (if (string-equal "gnu/linux" system-type)
  	(progn
  		(setq x-super-keysym 'meta)
  		(message ">>> Linux, set 'super' key as 'meta' key." system-type)
  	)
  )
#+end_src


