emacs-250913/init.el
;;
;; For MacOS
;;
(if (string-equal "darwin" system-type)
    (progn
		(setq mac-command-modifier 'meta)
		(message ">>> MacOS, set 'super' key as 'meta' key." system-type)
	)
)

;;
;; For Linux
;;
(if (string-equal "gnu/linux" system-type)
	(progn
		(setq x-super-keysym 'meta)
		(message ">>> Linux, set 'super' key as 'meta' key." system-type)
	)
)
