emacs-250913/configuration.org
*** Hide all UIs that I don't need

#+BEGIN_SRC emacs-lisp
  (if (fboundp 'menu-bar-mode)
    (menu-bar-mode -1)
  )
  (if (fboundp 'tool-bar-mode)
    (tool-bar-mode -1)
  )
  (if (fboundp 'scroll-bar-mode)
    (scroll-bar-mode -1)
  )

  (setq inhibit-startup-message t
        use-dialog-box nil)
#+END_SRC


*** Use =y-or-n-p= for prompts:

By default, =Emacs= prompts for user confirmation using =yes= or =no=. The following setting changes to use =y= or =n= for shorter and faster responses.

#+begin_src emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src


*** Auto refresh buffer when file has been updated outside Emacs

#+BEGIN_SRC emacs-lisp
  (global-auto-revert-mode 1)
  (setq global-auto-revert-non-file-buffers t)
#+END_SRC


*** No auto backup and auto save

#+BEGIN_SRC emacs-lisp
(setq make-backup-files nil
      auto-save-default nil)
#+END_SRC


*** Disable remember opened file positions

#+BEGIN_SRC emacs-lisp
  ;; Enable it
  ;;(save-place-mode 1)

  ;; Disable it
  (setq save-place-mode nil)
#+END_SRC


*** Line number related

#+BEGIN_SRC emacs-lisp
  (global-display-line-numbers-mode 1)
  (setq display-line-numbers-type 'relative)
  (setq column-number-mode t)
#+END_SRC


*** Enable current line background highlight both in terminal and GUI

#+BEGIN_SRC emacs-lisp
;; (when window-system (global-hl-line-mode t))
(global-hl-line-mode t)
#+END_SRC


*** Customized variable file

By default, =Emacs= writes some custom settings back to =init.el= when you call ~customize~ related functions and then mess up your =init.el= file. For avoiding this, you need to tell =Emacs= where to save those customized settings and re-load that file.

Also, I don't want to see error message when loading that custom file even it has.

#+BEGIN_SRC emacs-lisp
(setq custom-file (locate-user-emacs-file "custom-vars.el"))
(load custom-file 'noerror 'nomessage)
#+END_SRC


*** Dired settings

Show hidden files by default.

#+BEGIN_SRC emacs-lisp
;; (when window-system (global-hl-line-mode t))
(setq dired-listing-switches "-lhta")
#+END_SRC


*** Auto select =help= window

=describe-xxxx= function opens a new help buffer and window, but the help window doesn't be selected by default, it's quite annoying as you need to move to that window before you can close it.

But you can make it auto be selected by the following settings:

#+begin_src emacs-lisp
  (setq help-window-select t)
#+end_src


*** Always display on the right-side window for these buffers: ~Shell, Help, helpful, Emabrk~

#+BEGIN_SRC emacs-lisp
  (setq display-buffer-alist
        '(
           ("\\*helpful"
               (display-buffer-reuse-window display-buffer-in-side-window)
               (side . right)
               (window-width . 0.5)
           )
           ("\\*Help"
               (display-buffer-reuse-window display-buffer-in-side-window)
               (side . right)
               (window-width . 0.5)
           )
           ("\\*Embark"
               (display-buffer-reuse-window display-buffer-in-side-window)
               (side . right)
               (window-width . 0.5)
           )
           ("\\*Shell"
               (display-buffer-reuse-window display-buffer-in-side-window)
               (side . right)
               (window-width . 0.5)
           )
         )
  )
#+END_SRC


*** Fixed =TAB= width

#+BEGIN_SRC emacs-lisp
  (setq tab-width 4)
#+END_SRC


*** Enable auto pair mode

Auto pair =()= and =[]=

#+BEGIN_SRC emacs-lisp
  (electric-pair-mode)
#+END_SRC


*** Disable native compilation warnings and errors

Disable report warnings and errors from asynchronous native compilation.

#+BEGIN_SRC emacs-lisp
  (setq native-comp-async-report-warnings-errors nil)
#+END_SRC



*** Don't use actual image size for inline images and show inline image by default

#+BEGIN_SRC emacs-lisp
  (setq org-image-actual-width nil)
  (setq org-startup-with-inline-images t)
#+END_SRC

After you set ~org-image-actual-width~ to ~nil~, then you're able to use the following attributes to specific the size of any inline images:

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Display image with half of the current window size
  ;;
  #+ATTR_HTML: :width 50%
  [[file:~/...your_image_file]]

  ;;
  ;; Display image with exactly pixels width
  ;;
  #+ATTR_HTML: :width 100px
  [[file:~/...your_image_file]]
#+END_SRC

Because you set ~org-startup-with-inline-images~, that's why sometimes the size doesn't work well when opening an org file in a separated window (it still use the full Emacs window width to display the inline image)!!!

The way to fix that is by running ~org-toggle-inline-images~ twice to refresh it.


*** Add extra module load path

Load your custom dynamically loaded module from the given path.

#+BEGIN_SRC emacs-lisp
  ;; Just for debugging purpose:
  ;;
  ;; When developing your dynamically Loaded Module for emacs, you can
  ;; add your library output folder to the 'load-path' for testing.
  ;;
  ;; After adding your testing library folder to 'load-path', then you
  ;; can load it by running:
  ;; 
  ;; (load-library "YOUR_LIB_FILENAME_HERE")
  ;; (CALL_YOUR_MODULE_FUNCTION)
  ;;
  ;; For example:
  ;; (load-library "libemacs-module-demo")
  ;; (get-module-version)
  ;; (get-module-version-string)
  ;;
  (push (expand-file-name "~/zig/emacs-module-template/zig-out/lib") load-path)

  (push "~/.config/emacs/lib" load-path)
#+END_SRC


*** Auto kill previous unfinished async shell command process

When I run =project-async-shell-command=, it actually execute =async-shell-command= and direct its output to the buffer whose name is =*Async Shell Command*=, but somehow somtimes command doesn't exit correct. So, when I try to run another =project-async-shell-command=, it always ask me to choose what action I want to do, as the buffer =*Async Shell Command*= still being using by the previous (unfinished) command, that's quite annoying.

Here is the solution, always kil the previous running process:

#+BEGIN_SRC emacs-lisp
  (setq async-shell-command-buffer 'confirm-kill-process)
#+END_SRC


*** Enable fuzzy searching in minibuffer

Without this, you have to type =*scra= to search in =Buffers= and type =lo-them= to search for =load-theme=. But with this settings, it does fuzzy searching then you can type =scra= (without the =*=) and =lothe= with the =-=!!!

#+BEGIN_SRC emacs-lisp
  (push 'flex completion-styles)
#+END_SRC


** Speed up booting speed by increasing the 'gc-cons-threshold', it should be in ~early-init.el~

The default ~gc-cons-threshold~ setting is ~800000~ (bytes), that causes around ~33~ garbage collections during the booting process.

The following setting improves a lot, reduces only ~1~ garbage collection!!!

You will see the message output from ~after-make-frame-functions~ hook handler and ~emacs-startup-hook~ hook handler in the following section.

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  ;;
  ;; Speed up booting speed by increasing the 'gc-cons-threshold'
  ;;
  (message ">>> [ early-init ] default 'gc-cons-threshold': %d" gc-cons-threshold)
  (setq gc-cons-threshold (* 100 1000 1000))
  (message ">>> [ early-init ] increased 'gc-cons-threshold': %d" gc-cons-threshold)
#+END_SRC


