emacs-250913/early-init.el
;;
;; Speed up booting speed by increasing the 'gc-cons-threshold'
;;
(message ">>> [ early-init ] default 'gc-cons-threshold': %d" gc-cons-threshold)
(setq gc-cons-threshold (* 100 1000 1000))
(message ">>> [ early-init ] increased 'gc-cons-threshold': %d" gc-cons-threshold)

;; --------------------------------------------------------------------------------------------
