emacs-250913/init.el

(if (fboundp 'menu-bar-mode)
  (menu-bar-mode -1)
)
(if (fboundp 'tool-bar-mode)
  (tool-bar-mode -1)
)
(if (fboundp 'scroll-bar-mode)
  (scroll-bar-mode -1)
)

(setq inhibit-startup-message t
      use-dialog-box nil)

(defalias 'yes-or-no-p 'y-or-n-p)

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)

(setq make-backup-files nil
      auto-save-default nil)

;; Enable it
;;(save-place-mode 1)

;; Disable it
(setq save-place-mode nil)

(global-display-line-numbers-mode 1)
(setq display-line-numbers-type 'relative)
(setq column-number-mode t)

;; (when window-system (global-hl-line-mode t))
(global-hl-line-mode t)

(setq custom-file (locate-user-emacs-file "custom-vars.el"))
(load custom-file 'noerror 'nomessage)

;; (when window-system (global-hl-line-mode t))
(setq dired-listing-switches "-lhta")

(setq help-window-select t)

(setq display-buffer-alist
      '(
         ("\\*helpful"
             (display-buffer-reuse-window display-buffer-in-side-window)
             (side . right)
             (window-width . 0.5)
         )
         ("\\*Help"
             (display-buffer-reuse-window display-buffer-in-side-window)
             (side . right)
             (window-width . 0.5)
         )
         ("\\*Embark"
             (display-buffer-reuse-window display-buffer-in-side-window)
             (side . right)
             (window-width . 0.5)
         )
         ("\\*Shell"
             (display-buffer-reuse-window display-buffer-in-side-window)
             (side . right)
             (window-width . 0.5)
         )
       )
)

(setq tab-width 4)

(electric-pair-mode)

(setq native-comp-async-report-warnings-errors nil)

(setq org-image-actual-width nil)
(setq org-startup-with-inline-images t)

;; Just for debugging purpose:
;;
;; When developing your dynamically Loaded Module for emacs, you can
;; add your library output folder to the 'load-path' for testing.
;;
;; After adding your testing library folder to 'load-path', then you
;; can load it by running:
;; 
;; (load-library "YOUR_LIB_FILENAME_HERE")
;; (CALL_YOUR_MODULE_FUNCTION)
;;
;; For example:
;; (load-library "libemacs-module-demo")
;; (get-module-version)
;; (get-module-version-string)
;;
(push (expand-file-name "~/zig/emacs-module-template/zig-out/lib") load-path)

(push "~/.config/emacs/lib" load-path)

(setq async-shell-command-buffer 'confirm-kill-process)

(push 'flex completion-styles)
