emacs-250913/configuration.org
** Set fonts and transparent background, it has to be in ~early-init.el~

For some setttings, you have to place them into the =early-init.el=

For example, I need to run some functions to set transparent background via the ~after-make-frame-functions~ hook. If you run ~describe-variable~ on that hook, you should see it says:

=="Note that these functions are usually not run for the initial frame, unless you add them to the hook in your early-init file."=

That's why the following code has to be placed into =early-init.el= instead of =init.el=!!!

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  ;; --------------------------------------------------------------------------------------------
  ;; GUI version only, as no effects on the TUI version:
  ;;
  ;; - Remove title bar
  ;; - Increase the internal window gaps
  ;;
  ;; You can find all supported frame attributes from the emacs source code 'frame.el':
  ;;
  ;; For example:
  ;;
  ;; '/usr/local/Cellar/emacs-plus@30/30.1/share/emacs/30.1/lisp/frame.el'
  ;;
  ;; After opening the 'frame.el', search for the 'frame-geometry' function, then see all of them
  ;;
  ;; --------------------------------------------------------------------------------------------
  (progn
  	(add-to-list 'default-frame-alist '(undecorated . t))
  	(add-to-list 'default-frame-alist '(internal-border-width . 20))
  	(message ">>> Applied custom settings to the GUI version: Removed title bar, increase the window gaps.")
  )

  ;; --------------------------------------------------------------------------------------------
  ;; Set font and transparent after creating the frame (window)
  ;; --------------------------------------------------------------------------------------------

  ;;
  ;; Set my font
  ;;
  (defun my-set-font ()
  	(set-face-attribute 'default nil
  		:family "JetBrainsMono Nerd Font"
  		:weight 'semi-bold
  		:height 140
  		;; :italic t
  	)

  	(if (display-graphic-p nil)
  		(progn
  			(let ((font-size-in-pixel 170))
  				(if (and (eql (display-pixel-width) 2560) (eql (display-pixel-height) 1440))
  					(setq font-size-in-pixel 190))
  				(set-face-attribute 'default nil
  					:family "JetBrainsMono Nerd Font"
  					:weight 'semi-bold
  					:height font-size-in-pixel
  					;; :italic t
  					)

  				(message
  					">>> [ my-set-font ] GUI mdoe, font-size-in-pixel: %d"
  					font-size-in-pixel)
  			))
  	)
  )

  ;;
  ;; Set transparent background for GUI
  ;;
  (defun my-set-transparent-gui ()
  	(message ">>> [ early-init > my-set-transparent-gui ] - called")

  	(if (string-equal "darwin" system-type)
  		(progn
  			(set-frame-parameter nil 'alpha 95)
  			(add-to-list 'initial-frame-alist '(alpha . 95))
  			(add-to-list 'default-frame-alist '(alpha . 95))
  		)
  		(progn
  			(set-frame-parameter nil 'alpha-background 95)
  			(add-to-list 'initial-frame-alist '(alpha-background . 95))
  			(add-to-list 'default-frame-alist '(alpha-background . 95))
  		)
  	)
  )

  ;;
  ;; Set transparent background for terminal
  ;;
  (defun my-set-transparent-terminal()
  	(message ">>> [ early-init > my-set-transparent-terminal() ] - called")
  	(set-face-background 'default "unspecified-bg" nil)
  )

  ;;
  ;; Setting the transparent background is very different between GUI mode and Terminal mode, so you
  ;; better do that in the a hook handler (especially after the init window frame has been created
  ;; and the color theme has been loaded)
  ;;
  ;; For detailed steps about =Emacs= startup sequence, read this:
  ;;
  ;; https://www.gnu.org/software/emacs/manual/html_node/elisp/Startup-Summary.html
  ;;
  (defun my-set-transparent-background ()
  	(message
  		">>> [ early-init > my-set-transparent-background ] - display-graphic-p result: %s"
  		(display-graphic-p (selected-frame)))

  	(if (display-graphic-p (selected-frame))
  			(my-set-transparent-gui)
  			(my-set-transparent-terminal)
  	)
  )

  ;;
  ;; Call set font function in both standalone mode or daemon mode
  ;;
  (if (daemonp)
      (add-hook 'after-make-frame-functions
          (lambda (frame)
              (with-selected-frame frame
                (message ">>> [ early-init ] Run lambda funtion in 'after-make-frame-functions' hook.")
                (my-set-font)
                (message ">>> [ early-init ] lambda funtion set font in 'after-make-frame-functions' hook.")
                (message ">>> [ early-init ] Startup took %s seconds with %d garbage collections" (emacs-init-time "%.2f") gcs-done)
              )
          )
      )
      (add-hook 'emacs-startup-hook
          (lambda ()
              (message ">>> [ early-init ] Run lambda funtion in 'emacs-startup-hook' hook.")
              (my-set-font)
              (message ">>> [ early-init ] lambda funtion set font in 'emacs-startup-hook' hook.")
              (message ">>> [ early-init ] Startup took %s seconds with %d garbage collections" (emacs-init-time "%.2f") gcs-done)
          )
      )
  )
#+END_SRC



** Package init and settings

*** Init package and install =use-package=

#+BEGIN_SRC emacs-lisp
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

  ;; Only use to install 'chatgpt'
  ;; (add-to-list 'package-archives '( "jcs-elpa" . "https://jcs-emacs.github.io/jcs-elpa/packages/") t)

  (unless package-archives
          (package-refresh-contents))
  ;;(package-refresh-contents)
  (package-initialize)

  ;;
  ;; (unless condition nil
  ;;         statement-to-execute)
  ;;
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)

  ;; Auto install all missing packages when using =(use-packge)`
  ;; It's equal to use `:ensure t` in `(use-package)`
  (setq use-package-always-ensure t)
#+END_SRC



*** ~(use-package)~ quick manual

#+begin_src emacs-lisp :tangle no
  ;;
  ;; Load the package, but only if 'PACKAGE_NAME' is available on your system. If not, a
  ;; warning is logged to the '*Messages*' buffer.
  ;;
  ;;
  (use-package 'PACKAGE_NAME
    ;;
    ;; Install if it doesn't exists, and because of '(setq use-package-always-ensure t)'
    ;; has been set already, that said ':ensure t' will be applied to all '(use-package)',
    ;; that's why you don't need to set ':ensure t' anymore.
    ;;
    :ensure t

    ;; 
    ;; Lazy load this package
    ;; Using 'bind' and 'command' will cause the package to lazy load as well!!!
    ;;
    ;; The keywords ':commands,' et al, provide "triggers" that cause a package to
    ;; be loaded when certain events occur. However, if 'use-package' cannot determine
    ;; that any trigger has been declared, it will load the package immediately (when
    ;; Emacs is starting up) unless :defer t is given. The presence of triggers can be
    ;; overridden using ':demand t' to force immediately loading anyway.
    ;; For example, :hook represents a trigger that fires when the specified hook is run.
    ;; 
    ;; In almost all cases you don't need to manually specify ':defer t', because this is
    ;; implied whenever ':bind' or ':mode' or ':interpreter' are used. Typically, you only
    ;; need to specify ':defer' if you know for a fact that some other package will do
    ;; something to cause your package to load at the appropriate time, and thus you would
    ;;  like to defer loading even though 'use-package' has not created any autoloads for you.
    ;;
    :defer t

    ;; 
    ;; Use the ':init' keyword to execute code before a package is loaded. It accepts one
    ;; or more forms, up to the next keyword:
    ;;
    :init
        ;;
        ;; All settings belong to ':init' part
        ;;
        (setq YOUR_VARS t)

    ;; 
    ;; Use the ':config' keyword to execute code after a package is loaded. In cases where
    ;; loading is done lazily (see more about autoloading below), this execution is deferred
    ;; until after the autoload occurs
    :config
        ;;
        ;; All settings belong to ':config part
        ;;
        (your-mode t)

    ;; 
    ;; Load this package after another package
    ;;
    :after ANOTHER_PACKAGE_NAME

    ;; 
    ;; Run the commands when the package is actually loaded.
    ;; The ':commands' keyword takes either a symbol or a list of symbols.
    ;;
    :commands SINGLE_COMMAND
    :commands (COMMAND_1 COMMAND_2 COMMAND_3 etc)

    ;; 
    ;; Keybindings
    ;;
    :bind (("M-o l" . COMMAND_TO_BIND)
           ("M-o r" . COMMAND_TO_BIND)
           ("M-o w" . COMMAND_TO_BIND)))

    ;; 
    ;; The ':hook' keyword allows adding functions onto package hooks. The same
    ;; effect with using '(add-hook)'. The following ':hook' setting is the same:
    ;;
    ;; :init
    ;; (add-hook 'prog-mode-hook #'company-mode))
    ;;
    :hook (prog-mode . company-mode))

    ;; 
    ;; The ':custom' keyword allows customization of package custom variables.
    ;; Same thing with using '(setq NAME VALUE)' in ':init' but with comments.
    ;; The documentation string is not mandatory.
    ;;
    ;; NOTE: these are only for people who wish to keep customizations with their
    ;;       accompanying use-package declarations. Functionally, the only benefit
    ;;       over using setq in a :config block is that customizations might execute
    ;;       code when values are assigned.
    ;; 
    ;; NOTE: The customized values are not saved in the Emacs custom-file. Thus you
    ;;       should either use the :custom option or you should use M-x customize-option
    ;;       which will save customized values in the Emacs custom-file. Do not use both.
    ;;
    :custom
        (comint-buffer-maximum-size 20000 "Increase comint buffer size.")
        (comint-prompt-read-only t "Make the prompt read only."))
    ;;
    ;; The ':disabled' keyword can turn off a module you're having difficulties with, or
    ;; stop loading something you're not using at the present time:
    ;;
    :disabled

    ;;
    ;; Print out the error if you want
    ;;
    :catch (lambda (keyword err)
            (message ">>> Package load failed with error: %s" (error-message-string err)))

  )
#+end_src


** Enable system clipboard

 #+begin_src emacs-lisp
   (use-package xclip
      :config
          (xclip-mode 1)
   )
 #+end_src


** Command log  

#+BEGIN_SRC emacs-lisp
  (use-package command-log-mode
      :defer t
      :config
          (global-command-log-mode 1)
  )
#+END_SRC


