emacs-250913/init.el

(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

;; Only use to install 'chatgpt'
;; (add-to-list 'package-archives '( "jcs-elpa" . "https://jcs-emacs.github.io/jcs-elpa/packages/") t)

(unless package-archives
        (package-refresh-contents))
;;(package-refresh-contents)
(package-initialize)

;;
;; (unless condition nil
;;         statement-to-execute)
;;
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)

;; Auto install all missing packages when using =(use-packge)`
;; It's equal to use `:ensure t` in `(use-package)`
(setq use-package-always-ensure t)

(use-package xclip
   :config
       (xclip-mode 1)
)

(use-package command-log-mode
    :defer t
    :config
        (global-command-log-mode 1)
)
