emacs-250913/configuration.org
***** Embark

=Embark= allows you to do something (aka, run an action) on the following targets:

- A single item or all items inside the completion list/Minibuffer/imenu result/rg result/etc
- Selection of text

For example:

If you run ~describe-function~, then a mini buffer pops up to allow you to filter the function you want to see the help for. Because that's mini buffer, you can't copy it if you want:)

But if you have =Embark=, then you can bind a hotkey to run ~embark-act~ to popup a embark action list like this:

#+BEGIN_SRC emacs-lisp :tangle no
  Act on symbol ‘execute-extended-command--shorter-1’

  RET   helpful-callable      Show help for function, macro or special form named SYMBOL.
  ;; ignore...
  A     embark-act-all        Prompt the user for an action and perform it on each candidate.
  S     embark-collect        Create an Embark Collect buffer.
  w     embark-copy-as-kill   Join STRINGS and save on the ‘kill-ring’.
  i     embark-insert         Join STRINGS and insert the result at point.
  ;; ignore...
#+END_SRC

So, you can press the following key to do something very useful:

- ~A,w~: Copy all the function names.
- ~w~: Only copy the selected funciton name.
- ~i~: Only copy the selected funciton name and paste it to the current buffer at cursor position.
- ~S~: Take all function names to create a =Embark collect buffer=, so you can move up and down and press =RET= to view the function help info in a super convenient way. (as you don't need to re-run the ~describe-function~ to filter and select the function again).


****** Work with =which-key= 

Be able to show keybindings via =which-key=

#+BEGIN_SRC emacs-lisp
  (defun embark-which-key-indicator ()
    "An embark indicator that displays keymaps using which-key.
  The which-key help message will show the type and value of the
  current target followed by an ellipsis if there are further
  targets."
    (lambda (&optional keymap targets prefix)
      (if (null keymap)
          (which-key--hide-popup-ignore-command)
        (which-key--show-keymap
         (if (eq (plist-get (car targets) :type) 'embark-become)
             "Become"
           (format "Act on %s '%s'%s"
                   (plist-get (car targets) :type)
                   (embark--truncate-target (plist-get (car targets) :target))
                   (if (cdr targets) "…" "")))
         (if prefix
             (pcase (lookup-key keymap prefix 'accept-default)
               ((and (pred keymapp) km) km)
               (_ (key-binding prefix 'accept-default)))
           keymap)
         nil nil t (lambda (binding)
                     (not (string-suffix-p "-argument" (cdr binding))))))))
#+END_SRC


****** Install and configure

#+BEGIN_SRC emacs-lisp
  (use-package embark
    :init
      ;; Optionally replace the key help with a completing-read interface
      (setq prefix-help-command #'embark-prefix-help-command)

      ;;
      ;; Work with 'which-key', 'embark-which-key-indicator' must defined!!!
      ;;
      ;; (setq embark-indicators '(embark-which-key-indicator
      ;;                           embark-highlight-indicator
      ;;                           embark-isearch-highlight-indicator)
      ;; )

    :config
      ;;
      ;; Hide the mode line of the Embark live/completions buffers
      ;;
      ;; (add-to-list 'display-buffer-alist
      ;; 						'("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
      ;; 						nil
      ;; 						(window-parameters (mode-line-format . none))))
  )

  ;;
  ;; Consult users will also want the embark-consult package.
  ;;
  (use-package embark-consult
    :hook
        (embark-collect-mode . consult-preview-at-point-mode))
#+END_SRC




****** Disable line number mode

#+BEGIN_SRC emacs-lisp
  (defun embark-disable-line-number ()
  	(display-line-numbers-mode -1)
  )

  (add-hook 'embark-collect-mode-hook #'embark-disable-line-number)
#+END_SRC


*** =evil-mode= and =evil-surround=

**** What is =Evil=

=Evil= is an extensible =vi= layer for =Emacs=. It emulates the main features of =Vim=, turning =Emacs= into a modal editor. Like =Emacs= in general, =Evil= is extensible in =Emacs Lisp=.


**** Evil =modes= and =state=

=Evil= uses the term =state= for what is called a =mode= in regular =vi= usage, because modes are understood in =Emacs= terms to mean something else.

=Evil= defines a number of states by default:

| state                        | description                                                                        |
|------------------------------+------------------------------------------------------------------------------------|
| normal state (<N>)           |                                                                                    |
| insert state (<I>)           |                                                                                    |
| visual state (<V>)           |                                                                                    |
| replace state (<R>)          |                                                                                    |
| operator-pending state (<O>) | A special state entered after launching an operator, but before specifying the     |
|                              | corresponding motion or text object.                                               |
|                              |                                                                                    |
| motion state (<M>)           | A special state useful for buffers that are read-only, where motions are available |
|                              | but editing operations are not.                                                    |
|                              |                                                                                    |
| Emacs state (<E>)            | All =Evil= keybindings are disabled, switch back to original =Emacs= keybindings.      |
|                              |                                                                                    |


By default, toggle between =Evil state= and =Emacs sate= by pressing ~C-z~, but I disabled it (as I need the ~C-z~ to go back to terminal). So I if you need that, you can run ~evil-emacs-state~ and ~evil-normal-state~ manually.

Why you need the =Emacs state=??? For example, if =Evil= keybinding overwrites the original =Emacs= hotkey, then you need to disable it temporary by going back to =Emacs state=.


