emacs-250913/init.el

(defun embark-which-key-indicator ()
  "An embark indicator that displays keymaps using which-key.
The which-key help message will show the type and value of the
current target followed by an ellipsis if there are further
targets."
  (lambda (&optional keymap targets prefix)
    (if (null keymap)
        (which-key--hide-popup-ignore-command)
      (which-key--show-keymap
       (if (eq (plist-get (car targets) :type) 'embark-become)
           "Become"
         (format "Act on %s '%s'%s"
                 (plist-get (car targets) :type)
                 (embark--truncate-target (plist-get (car targets) :target))
                 (if (cdr targets) "…" "")))
       (if prefix
           (pcase (lookup-key keymap prefix 'accept-default)
             ((and (pred keymapp) km) km)
             (_ (key-binding prefix 'accept-default)))
         keymap)
       nil nil t (lambda (binding)
                   (not (string-suffix-p "-argument" (cdr binding))))))))

(use-package embark
  :init
    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)

    ;;
    ;; Work with 'which-key', 'embark-which-key-indicator' must defined!!!
    ;;
    ;; (setq embark-indicators '(embark-which-key-indicator
    ;;                           embark-highlight-indicator
    ;;                           embark-isearch-highlight-indicator)
    ;; )

  :config
    ;;
    ;; Hide the mode line of the Embark live/completions buffers
    ;;
    ;; (add-to-list 'display-buffer-alist
    ;; 						'("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
    ;; 						nil
    ;; 						(window-parameters (mode-line-format . none))))
)

;;
;; Consult users will also want the embark-consult package.
;;
(use-package embark-consult
  :hook
      (embark-collect-mode . consult-preview-at-point-mode))

(defun embark-disable-line-number ()
	(display-line-numbers-mode -1)
)

(add-hook 'embark-collect-mode-hook #'embark-disable-line-number)

;;
