emacs-250913/init.el
;; Evil custom settings, you can found all settings here:
;; https://evil.readthedocs.io/en/latest/settings.html
;;

;;
;; Set the following modes to 'normal state after 'evil-mode' loaded
;;
;; Why do this?
;; 
;; If the buffer switches to 'Evil-Normal-State' by default, then the upcomming
;; keybindins "(evil-global-set-key 'normal)" which targets to 'normal' state will
;; work automatically.
;; 
;; That will save a lot of keybinding settings.
;;
;; More info, run 'info' and goto the section: evil -> evil -> settings -> The initial state
;;
(defun my-evil-default-to-normal-state-for-these-modes ()
	(dolist (mode '(
				helpful-mode
				help-mode
				messages-buffer-mode
				emacs-lisp-compilation-mode
				debugger-mode
				package-menu-mode
				term-mode
				custom-mode
				org-mode
				org-agenda-mode
				fundamental-mode
				shell-command-mode
				snippet-mode
			))

		;;
		;; I have no idea why this doesn't for the 'messages-buffer-mode' (only this mode)!!!
		;;
	    (evil-set-initial-state mode 'normal)

		(message ">>> Evil set inital state to 'normal' for '%s'" mode)

	)
)

;;
;; By default, `evil-repeat` repeats the last command when pressing `.` key. If you DO NOT
;; want some commands to be repeatable, then you should use `evil-declare-abort-repeat`
;; to disable them.
;;
;; Here is the default disabled settings:
;;
;; File: ~/.config/emacs/elpa/evil-20230828.1342/evil-integration.el
;; (mapc #'evil-declare-abort-repeat
;;       '(balance-windows
;;         eval-expression
;;         execute-extended-command
;;         exit-minibuffer
;;         compile
;;         delete-window
;;         delete-other-windows
;;         find-file-at-point
;;         ffap-other-window
;;         recompile
;;         redo
;;         save-buffer
;;         split-window
;;         split-window-horizontally
;;         split-window-vertically
;;         undo
;;         undo-tree-redo
;;         undo-tree-undo))
(defun my-evil-disable-repeatable-for-these-functions ()
	;;
	;; I don't want the following commands to be repeatable!!!
	;;
	(mapc #'evil-declare-abort-repeat
	      '(my-search-next            ; 'n' for next search
	        my-search-previous        ; 'N' for prev search
	        flymake-goto-next-error   ; '<C-n>' for next LSP error
	        flymake-goto-prev-error   ; '<C-p>' for prev LSP error
	       )
	)
)

;;
;;
;;
(use-package evil
	:init
	(setq
		evil-auto-indent t          ; Enable auto indent
		evil-echo-state t           ; State/mode in status bar
		evil-want-C-u-scroll t      ; Enable <C-u> scroll up
		evil-want-C-i-jump t        ; <C-i> inserts a tab character
		evil-want-Y-yank-to-eol t   ; Enable `Y`: Yank to end of line
		evil-vsplit-window-right t  ; Always vsplit window on the rigth
		evil-want-integration t     ; This is optional since it's already set to t by default.
		evil-want-keybinding nil
	)

	:custom
	(evil-undo-system 'undo-redo)

	:config
	(evil-mode 1)

	;; Leader key
	(evil-set-leader '(normal visual) (kbd "SPC"))
	(my-evil-disable-repeatable-for-these-functions)
)

;;
;; 'my-evil-default-to-normal-state-for-these-modes' has to be called when all 'xxx-mode'
;; are avaiable. Otherwise, it won't be called for some modes!!!
;;
;; That's why you should call this function for the 'after-init-hook', as all 'xxx-mode'
;; should be ready after the frame has been inited.
;;
(add-hook
	'after-init-hook
	(lambda ()
		(my-evil-default-to-normal-state-for-these-modes)
		(message ">>> 'my-evil-default-to-normal-state-for-these-modes' has been called by 'after-init-hook'")
	)
)

;;
;; 
;;
(use-package evil-collection
	:after evil
	:config
		(evil-collection-init)
)

(use-package evil-surround
    :init
    (global-evil-surround-mode 1)
    :config
        (add-hook 'org-mode-hook (lambda ()
                                    (push '(?= . ("=" . "=")) evil-surround-pairs-alist)))
)

(use-package evil-goggles
  :ensure t
  :init
     ;;
     ;; Only enalbe yank effect, 't' by default
     ;;
     ;; (setq evil-goggles-enable-yank t)

     ;;
     ;; Disable the following effects
     ;;
     (setq evil-goggles-enable-delete nil
           evil-goggles-enable-change nil
           evil-goggles-enable-indent nil
           evil-goggles-enable-join nil
           evil-goggles-enable-fill-and-move nil
           evil-goggles-enable-paste nil
           evil-goggles-enable-shift nil
           evil-goggles-enable-surround nil
           evil-goggles-enable-commentary nil
           evil-goggles-enable-nerd-commenter nil
           evil-goggles-enable-replace-with-register nil
           evil-goggles-enable-set-marker nil
           evil-goggles-enable-undo nil
           evil-goggles-enable-redo nil
           evil-goggles-enable-record-macro nil)
  :config
  (evil-goggles-mode)

  ;; optionally use diff-mode's faces; as a result, deleted text
  ;; will be highlighed with `diff-removed` face which is typically
  ;; some red color (as defined by the color theme)
  ;; other faces such as `diff-added` will be used for other actions
  (evil-goggles-use-diff-faces))

(setq org-src-window-setup 'current-window)
;; (setq org-src-window-setup 'split-window-rIght)

(defun my/org-mode-setup ()
	(interactive)
	(org-indent-mode)           ;; Enable org indent mode
	(variable-pitch-mode -1)
	(visual-line-mode 1)

	;;
	;; Heading font size (only works in GUI mode)
	;; 
	;; But the following settings only work in 'GUI' mode, nothing will happen in 'Terminal' mode!!!
	;;
	(dolist (face '((org-level-1 . 1.5)
					(org-level-2 . 1.3)
					(org-level-3 . 1.2)
					(org-level-4 . 1.1)
					(org-level-5 . 1.0)
					(org-level-6 . 1.0)
					(org-level-7 . 1.0)))
		(set-face-attribute (car face) nil
							:height (cdr face))
	)
	(message ">>> [ my/org-mode-setup ] - called")
)

(use-package org
	:hook (org-mode . my/org-mode-setup)
	:config
	(setq org-ellipsis " ..."			; Ellipsis string when `S-TAB`
		org-hide-emphasis-markers t		; Hide the marker (bold, link etc)
		))

(use-package org-bullets
	:after org
	:init
		;; (setq org-bullets-bullet-list '("" "" ">" "●" "◆" "*"))
		;; (setq org-bullets-bullet-list '("①" "②" "③" "④" "⑤" "⑥"))
		(setq org-bullets-bullet-list '("➊" "➋" "➌" "➍" "➎" "➏"))
	:hook (org-mode . org-bullets-mode)
)

(defun disable-line-number ()
	(display-line-numbers-mode -1)
)

(add-hook 'org-mode-hook #'disable-line-number)

(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode))

(setq org-agenda-files
	'(
		 "~/.config/emacs/todo.org"
	)
)

(use-package rg
  :config
       (setq rg-command-line-flags (list "--trim"))
       (setq rg-group-result nil) ;; "--no-heading"
)
