emacs-250913/configuration.org
**** 1. Set the ~treesit-language-source-alist~ with all langauges you needed:

If you don't set this, you can't run the batch command to install all of them in one-shot (as it will ask you the confirm git URL).

If you can't find the language gammar in =https://github.com/tree-sitter/tree-sitter-xxx=, then take a look at the Neovim treesitter README, it includes some third-party implementations:

=~/.local/share/nvim/site/pack/packer/start/nvim-treesitter/README.md=

#+begin_src emacs-lisp
  (setq treesit-language-source-alist
    '((c "https://github.com/tree-sitter/tree-sitter-c")
      (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
      (zig "https://github.com/maxxnino/tree-sitter-zig")
      (rust "https://github.com/tree-sitter/tree-sitter-rust")
      (bash "https://github.com/tree-sitter/tree-sitter-bash")
      (cmake "https://github.com/uyha/tree-sitter-cmake")
      (css "https://github.com/tree-sitter/tree-sitter-css")
      (elisp "https://github.com/Wilfred/tree-sitter-elisp")
      (go "https://github.com/tree-sitter/tree-sitter-go")
      (html "https://github.com/tree-sitter/tree-sitter-html")
      (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
      (json "https://github.com/tree-sitter/tree-sitter-json")
      (make "https://github.com/alemuller/tree-sitter-make")
      (markdown "https://github.com/ikatyang/tree-sitter-markdown")
      (python "https://github.com/tree-sitter/tree-sitter-python")
      (toml "https://github.com/tree-sitter/tree-sitter-toml")
      (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
      (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
      (yaml "https://github.com/ikatyang/tree-sitter-yaml")
      (fish "https://github.com/ram02z/tree-sitter-fish")
      (java "https://github.com/tree-sitter/tree-sitter-java")
      (hare "https://git.sr.ht/~ecs/tree-sitter-hare")
      (odin "https://github.com/amaanq/tree-sitter-odin")
      (lua "https://github.com/MunifTanjim/tree-sitter-lua")
      ;(hare "https://git.sr.ht/~rockorager/tree-sitter-hare")
      ;(hare "https://git.sr.ht/~ghishadow/tree-sitter-hare")
      ;(hare "https://github.com/amaanq/tree-sitter-hare")
     )
    )

  ;;
  ;; Change the default major mode
  ;;
  (add-to-list 'auto-mode-alist '("\\.toml\\'" . toml-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.c\\'" . c-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.h\\'" . c-or-c++-ts-mode))
  (add-to-list 'auto-mode-alist '("CMakeLists.txt" . cmake-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
  (add-to-list 'auto-mode-alist '("\\.fish\\'" . fish-mode))
  (add-to-list 'auto-mode-alist '("lfrc" . bash-mode))
  (add-to-list 'auto-mode-alist '("bspwmrc" . bash-mode))
  (add-to-list 'auto-mode-alist '("\\.clang-format\\'" . bash-mode))
  (add-to-list 'auto-mode-alist '("\\.json\\'" . json-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.java\\'" . java-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.ha\\'" . hare-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.odin\\'" . odin-ts-mode))
  (add-to-list 'auto-mode-alist '("\\.lua\\'" . lua-ts-mode))

  ;;
  ;; remap the non-treesitter mode to treesitter mode
  ;;
  (setq major-mode-remap-alist
   '((c-mode . c-ts-mode)
     (c++-mode . c++-ts-mode)
     (bash-mode . bash-ts-mode)
     (sh-mode . bash-ts-mode)
     (cmake-mode . cmake-ts-mode)
     (css-mode . css-ts-mode)
     (elisp-mode . elisp-ts-mode)
     (go-mode . go-ts-mode)
     (html-mode . html-ts-mode)
     (make-mode . make-ts-mode)
     (json-mode . json-ts-mode)
     (js-json-mode . json-ts-mode)
     (python-mode . python-ts-mode)
     (tsx-mode . tsx-ts-mode)
     (typescript-mode . typescript-ts-mode)
     (js-mode . js-ts-mode)
     (yaml-mode . yaml-ts-mode)
     (java-mode . java-ts-mode)
     (hare-mode . hare-ts-mode)
     (odin-mode . odin-ts-mode)
    )
  )
#+end_src


**** 2. Install all of them

You can either ~M-x~ then ~treesit-install-language-grammar~ to install one-by-one, or you can run the following batch command to install all of them in one-shot:

#+begin_src emacs-lisp :tangle no
  ;; (mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist))
#+end_src


They should be installed to your =~/.config/emacs/tree-sitter= folder like this:

#+begin_src bash
  ls -lht tree-sitter/

  # total 9.5M
  # 230K  libtree-sitter-yaml.so*
  # 1.2M  libtree-sitter-typescript.so*
  # 1.2M  libtree-sitter-tsx.so*
  #  40K  libtree-sitter-toml.so*
  # 529K  libtree-sitter-python.so*
  # 825K  libtree-sitter-markdown.so*
  # 168K  libtree-sitter-make.so*
  #  16K  libtree-sitter-json.so*
  # 353K  libtree-sitter-javascript.so*
  #  38K  libtree-sitter-html.so*
  # 300K  libtree-sitter-go.so*
  #  60K  libtree-sitter-elisp.so*
  #  76K  libtree-sitter-css.so*
  # 100K  libtree-sitter-cmake.so*
  # 638K  libtree-sitter-bash.so*
  # 3.2M  libtree-sitter-cpp.so*
  # 668K  libtree-sitter-c.so*
  # 812K  libtree-sitter-zig.so*
  # 829K  libtree-sitter-rust.so*
#+end_src


You can check each of them to see whether has been install successfully or not:

#+begin_src emacs-lisp :tangle no
  ;;
  ;; Return 't' means install successfully
  ;;
  (treesit-language-available-p 'c)
  (treesit-language-available-p 'cpp)
  (treesit-language-available-p 'zig)
  (treesit-language-available-p 'rust)
  (treesit-language-available-p 'bash)
  (treesit-language-available-p 'cmake)
  (treesit-language-available-p 'css)
  (treesit-language-available-p 'elisp)
  (treesit-language-available-p 'go)
  (treesit-language-available-p 'html)
  (treesit-language-available-p 'javascript)
  (treesit-language-available-p 'json)
  (treesit-language-available-p 'make)
  (treesit-language-available-p 'markdown)
  (treesit-language-available-p 'python)
  (treesit-language-available-p 'toml)
  (treesit-language-available-p 'tsx)
  (treesit-language-available-p 'typescript)
  (treesit-language-available-p 'yaml)
  (treesit-language-available-p 'fish)
  (treesit-language-available-p 'hare)
#+end_src



** Note taking

*** =denote=

#+BEGIN_SRC emacs-lisp
  (use-package denote
    :init
        ;;
        ;; Where your denotes save to
        ;;
        (setq denote-directory(expand-file-name "~/my-notes"))

        ;;
        ;; Your denote default file type, 'nil' means use 'org' file
        ;;
        ;; Value is one of these options: nil/markdown-yaml/markdown-toml/text
        ;;
        (setq denote-file-type nil)

        ;;
        ;; Default keyword list, this is the fixed value list.
        ;;
        ;; By default, the 'denote-infer-keywords' is set to 't', that said denote
        ;; tries to walk through the 'denote-directory' to extract all keywords from
        ;; the filename and add to the list. If you don't want this behavior then
        ;; set it to 'nil'.
        ;;
        (setq denote-known-keywords '("Zig" "C"  "Todo" "ProblemAndSolution" "Misc"))

        ;;
        ;; What steps do I want to in the prompt?
        ;;
        ;; 1. Ask me the 'title' of the note
        ;;
        ;; 2. Ask me the 'keywords' of the note, multiple keywords separated by ','
        ;;
        ;; 3. Ask me the 'sub directory' of the note (related to 'denote-directory')
        ;;
        ;;
        ;; 'denote-prompts's value is a list with the following options:
        ;;
        ;; title/keywords/file-type/subdirectory/date
        ;;
        (setq denote-prompts '(title keywords subdirectory))
  )
#+END_SRC


**** How to create or open a note

| Function              | Description                                                     |
|-----------------------+-----------------------------------------------------------------|
| ~denote~                | It prompts you step-by-step which you set to the ~denote-prompts~ |
| ~denote-date~           | It prompts you for a date.                                      |
| ~denote-type~           | It prompts you for a file type.                                 |
| ~denote-template~       | It prompts you for a template.                                  |
| ~denote-org-capture~    | Create note directly via ~org-capture-templates~.                 |
| ~denote-subdirectory~   | It prompts for a subdirectory.                                  |
| ~denote-open-or-create~ | If file does not exist, invoke ~denote~ to create a file.         |
|                       |                                                                 |


**** How to change the current file =meta= data (=title/date/filetags/identifier=)

Just by running ~denote-rename-file~ and then select the file and finish the new note prompt and save it.


**** How to handle links in your note

| Function              | Description                                             |
|-----------------------+---------------------------------------------------------|
| ~denote-link~           | Create a link to the existing node                      |
| ~denote-link-or-create~ | Create a link to a node (create it if not exists)       |
| ~denote-find-link~      | List all note links in current buffer                   |
| ~denote-backlinks~      | List all backlinks to the current note.                 |
| ~denote-add-links~      | Create a list of links that based on your regexp search |
|                       |                                                         |


** Programming related

*** Langauge mode

**** =Zig=

#+begin_src emacs-lisp
  (use-package zig-mode)
#+end_src
 
**** =Rust=

#+begin_src emacs-lisp
  (use-package rust-mode)
#+end_src


**** =Fish=

#+begin_src emacs-lisp
  (use-package fish-mode)
#+end_src


**** =Markdown=

#+begin_src emacs-lisp
  (use-package markdown-mode)
#+end_src


**** =TypeScript=

#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :config
    (setq typescript-indent-level 4)
  )
#+end_src


