emacs-250913/init.el

(setq treesit-language-source-alist
  '((c "https://github.com/tree-sitter/tree-sitter-c")
    (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
    (zig "https://github.com/maxxnino/tree-sitter-zig")
    (rust "https://github.com/tree-sitter/tree-sitter-rust")
    (bash "https://github.com/tree-sitter/tree-sitter-bash")
    (cmake "https://github.com/uyha/tree-sitter-cmake")
    (css "https://github.com/tree-sitter/tree-sitter-css")
    (elisp "https://github.com/Wilfred/tree-sitter-elisp")
    (go "https://github.com/tree-sitter/tree-sitter-go")
    (html "https://github.com/tree-sitter/tree-sitter-html")
    (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
    (json "https://github.com/tree-sitter/tree-sitter-json")
    (make "https://github.com/alemuller/tree-sitter-make")
    (markdown "https://github.com/ikatyang/tree-sitter-markdown")
    (python "https://github.com/tree-sitter/tree-sitter-python")
    (toml "https://github.com/tree-sitter/tree-sitter-toml")
    (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
    (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
    (yaml "https://github.com/ikatyang/tree-sitter-yaml")
    (fish "https://github.com/ram02z/tree-sitter-fish")
    (java "https://github.com/tree-sitter/tree-sitter-java")
    (hare "https://git.sr.ht/~ecs/tree-sitter-hare")
    (odin "https://github.com/amaanq/tree-sitter-odin")
    (lua "https://github.com/MunifTanjim/tree-sitter-lua")
    ;(hare "https://git.sr.ht/~rockorager/tree-sitter-hare")
    ;(hare "https://git.sr.ht/~ghishadow/tree-sitter-hare")
    ;(hare "https://github.com/amaanq/tree-sitter-hare")
   )
  )

;;
;; Change the default major mode
;;
(add-to-list 'auto-mode-alist '("\\.toml\\'" . toml-ts-mode))
(add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-ts-mode))
(add-to-list 'auto-mode-alist '("\\.c\\'" . c-ts-mode))
(add-to-list 'auto-mode-alist '("\\.h\\'" . c-or-c++-ts-mode))
(add-to-list 'auto-mode-alist '("CMakeLists.txt" . cmake-ts-mode))
(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.fish\\'" . fish-mode))
(add-to-list 'auto-mode-alist '("lfrc" . bash-mode))
(add-to-list 'auto-mode-alist '("bspwmrc" . bash-mode))
(add-to-list 'auto-mode-alist '("\\.clang-format\\'" . bash-mode))
(add-to-list 'auto-mode-alist '("\\.json\\'" . json-ts-mode))
(add-to-list 'auto-mode-alist '("\\.js\\'" . js-ts-mode))
(add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-ts-mode))
(add-to-list 'auto-mode-alist '("\\.java\\'" . java-ts-mode))
(add-to-list 'auto-mode-alist '("\\.ha\\'" . hare-ts-mode))
(add-to-list 'auto-mode-alist '("\\.odin\\'" . odin-ts-mode))
(add-to-list 'auto-mode-alist '("\\.lua\\'" . lua-ts-mode))

;;
;; remap the non-treesitter mode to treesitter mode
;;
(setq major-mode-remap-alist
 '((c-mode . c-ts-mode)
   (c++-mode . c++-ts-mode)
   (bash-mode . bash-ts-mode)
   (sh-mode . bash-ts-mode)
   (cmake-mode . cmake-ts-mode)
   (css-mode . css-ts-mode)
   (elisp-mode . elisp-ts-mode)
   (go-mode . go-ts-mode)
   (html-mode . html-ts-mode)
   (make-mode . make-ts-mode)
   (json-mode . json-ts-mode)
   (js-json-mode . json-ts-mode)
   (python-mode . python-ts-mode)
   (tsx-mode . tsx-ts-mode)
   (typescript-mode . typescript-ts-mode)
   (js-mode . js-ts-mode)
   (yaml-mode . yaml-ts-mode)
   (java-mode . java-ts-mode)
   (hare-mode . hare-ts-mode)
   (odin-mode . odin-ts-mode)
  )
)

(use-package denote
  :init
      ;;
      ;; Where your denotes save to
      ;;
      (setq denote-directory(expand-file-name "~/my-notes"))

      ;;
      ;; Your denote default file type, 'nil' means use 'org' file
      ;;
      ;; Value is one of these options: nil/markdown-yaml/markdown-toml/text
      ;;
      (setq denote-file-type nil)

      ;;
      ;; Default keyword list, this is the fixed value list.
      ;;
      ;; By default, the 'denote-infer-keywords' is set to 't', that said denote
      ;; tries to walk through the 'denote-directory' to extract all keywords from
      ;; the filename and add to the list. If you don't want this behavior then
      ;; set it to 'nil'.
      ;;
      (setq denote-known-keywords '("Zig" "C"  "Todo" "ProblemAndSolution" "Misc"))

      ;;
      ;; What steps do I want to in the prompt?
      ;;
      ;; 1. Ask me the 'title' of the note
      ;;
      ;; 2. Ask me the 'keywords' of the note, multiple keywords separated by ','
      ;;
      ;; 3. Ask me the 'sub directory' of the note (related to 'denote-directory')
      ;;
      ;;
      ;; 'denote-prompts's value is a list with the following options:
      ;;
      ;; title/keywords/file-type/subdirectory/date
      ;;
      (setq denote-prompts '(title keywords subdirectory))
)

(use-package zig-mode)

(use-package rust-mode)

(use-package fish-mode)

(use-package markdown-mode)

(use-package typescript-mode
  :mode "\\.ts\\'"
  :config
  (setq typescript-indent-level 4)
)
