emacs-250913/configuration.org
**** =Web=

#+begin_src emacs-lisp
  ;; (use-package web-mode
  ;;   :config
  ;;       (setq web-mode-markup-indent-offset 4
  ;;             web-mode-css-indent-offset 4
  ;;             web-mode-code-indent-offset 4
  ;;             web-mode-style-padding 4
  ;;             web-mode-script-padding 4
  ;;             web-mode-enable-auto-closing t
  ;;             web-mode-enable-auto-opening t
  ;;             web-mode-enable-auto-pairing t
  ;;             web-mode-enable-auto-indentation t)
  ;;   :mode
  ;;       (".html$" "*css$" "*.tsx")
  ;; )
#+end_src


**** =Python=

#+begin_src emacs-lisp :tangle no
  ;; (use-package lsp-pyright
  ;;     :hook (python-mode . (lambda ()
  ;;             (setq indent-tabs-mode t)
  ;;             (setq tab-width 4)
  ;;             (setq python-indent-offset 4)
  ;;             (company-mode 1)
  ;;             (require 'lsp-pyright)
  ;;             (pyvenv-autoload)
  ;;             (lsp))
  ;;     )
  ;; )
#+end_src
 



*** =Comment/Uncomment=

#+begin_src emacs-lisp
  (use-package evil-commentary
      :defer t
      :hook (prog-mode . evil-commentary-mode)
  )
#+end_src


*** =Yasnippet= 

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.config/emacs/snippets")

  ;;
  ;; Fix 'company' can't list 'yasnippet' candidates in dropdown list
  ;;
  (defun my-fix-company-yasnippet()
     ;; (add-to-list 'company-backends '(company-capf :with company-yasnippet))

     ;;
     ;; Make 'yassnippet' list first
     ;;
     (add-to-list 'company-backends '(:separate company-yasnippet company-capf))
  )

  (use-package yasnippet
    :config
      ;;
      ;; Enable 'yasnippet' in global minor mode
      ;;
      ;; (yas-global-mode 1)

      ;;
      ;; But I prefer only neable 'yasnippet' in coding mode
      ;;
      (yas-reload-all)

      (add-hook 'org-mode-hook #'yas-minor-mode)
      (add-hook 'prog-mode-hook #'yas-minor-mode)
      ;; (add-hook 'c-ts-mode-hook #'yas-minor-mode)
      ;; (add-hook 'c++-ts-mode-hook #'yas-minor-mode)
      ;; (add-hook 'rust-ts-mode-hook #'yas-minor-mode)
      ;; (add-hook 'zig-mode-hook #'yas-minor-mode)
      ;; (add-hook 'zig-ts-mode-hook #'yas-minor-mode)
      ;; (add-hook 'org-mode-hook #'yas-minor-mode)
      ;; (add-hook 'cmake-ts-mode-hook #'yas-minor-mode)
      ;; (add-hook 'js-ts-mode-hook #'yas-minor-mode)
      ;; (add-hook 'typescript-ts-mode-hook #'yas-minor-mode)
      ;; (add-hook 'hare-mode-hook #'yas-minor-mode)
      ;; (add-hook 'hare-ts-mode-hook #'yas-minor-mode)
  	;; (add-hook 'emacs-lisp-mode-hook #'yas-minor-mode)
  	;; (add-hook 'lisp-interaction-mode #'yas-minor-mode)

      ;;
      ;; Fix 'company' can't list 'yasnippet' candidates in dropdown list
      ;;
      (add-hook 'eglot-managed-mode-hook #'my-fix-company-yasnippet)

  	;;
  	;; Fix 'company' can't list 'yasnippet' in the following modes,
  	;; as those modes won't trigger 'eglot' (NO LSP support yet)!!!
  	;;
  	(add-hook 'prog-mode-hook #'my-fix-company-yasnippet)
  	;; (add-hook 'hare-mode-hook #'my-fix-company-yasnippet)
  	;; (add-hook 'hare-ts-mode-hook #'my-fix-company-yasnippet)
  	;; (add-hook 'emacs-lisp-mode-hook #'my-fix-company-yasnippet)
  	;; (add-hook 'lisp-interaction-mode #'my-fix-company-yasnippet)
  )
#+END_SRC

**** Where's your snippets

Snippets are located in the ~yas-snippet-dirs~ which I've already set in the ~'load-path~ above.

The folder structure looks like this (aka, ~snippet tables~):

#+BEGIN_SRC bash
#  ~/.config/emacs/snippets
#                    |-- c-ts-mode
#                    |   |-- printf
#                    |-- rust-ts-mode
#                    |   |-- println
#                    |-- zig-mode
#                        |-- print
#+END_SRC


**** Useful commands

| Command                | Description                                         |
|------------------------+-----------------------------------------------------|
| ~yas-describe-tables~    | Show the YASnippet tables for all modes             |
| ~yas-new-snippet~        | Create a new snippet                                |
| ~yas-visit-snippet-file~ | Open exists snippet                                 |
| ~yas-tryout-snippet~     | Open a buffer with given mode to try snippet        |
| ~yas-reload-all~         | Reload all snippets on the fly (good for debugging) |



*** =Company=

Completion to provide a dropdown selection.

#+begin_src emacs-lisp
  (use-package company
    :custom
       (company-minimum-prefix-length 2)
       (company-idel-delay 0.0)
    :config
        ;;
        ;; Enable completion for all buffers
        ;;
        (global-company-mode 1)
  )

  ;;
  ;; A company front-end with icons.
  ;;
  (use-package company-box
    :hook (company-mode . company-box-mode))
#+end_src


*** Custom compilation error

By default, the ~compile~ command runs a COMMAND, a shell command, in a separate process asynchronously
with output going to the buffer =compilation=.

Inside the =compilation= buffer, you will see some errors if the compilnation fails:

#+BEGIN_SRC fish
  src/main_test.c:31:5: error: call to undeclared library function 'rintf' with type 'float (float)'; ISO C99 and later do not support implicit function declarations [-Wimplicit-function-declaration]
#+END_SRC

If your press ~RET~ on the error line, Emacs will call ~compile-goto-error~ for you and take you to the source code and locate the error position.

That works because of the following 2 global variables:

~compilation-error-regexp-alist~: It symbol a list, the symbol usually is the command name. Emacs uses it to get back the exact error regex string from the ~compilation-error-regexp-alist-alist~.

~compilation-error-regexp-alist-alist~: It's a list to store the pair of =command-symobl <-=-> error regex=.


That means if can't jump to the source code when pressing ~RET~ on the error line, then you should add the new =command-symobl <-=-> error regex= to ~compilation-error-regexp-alist-alist~!!!


**** Odin

To help you to figure the exact regex string, you can switch to the =compilation= buffer and run ~regexp-builder~. It shows a small buffer at the bottom, then you can type and test your regex to see the matching result in real-time.


#+BEGIN_SRC emacs-lisp
  ;;
  ;; The command name as 'symbol'
  ;;
  (push 'odin compilation-error-regexp-alist)

  ;;
  ;; The real error regex
  ;;
  (add-to-list
  	'compilation-error-regexp-alist-alist
  	'(
  		;;
  		;; The 'symbol' that you use in 'compilation-error-regexp-alist'
  		;;
  		odin

  		;;
  		;; Regex pattern to match: '/path/file.odin(line:column) '
  		;;
  		;; Here are the rules:
  		;;
  		;; The regex has different match groups in order:
  		;; 'FILE [LINE COLUMN TYPE HYPERLINK HIGHLIGHT...]'
  		;;
  		;; The first 'FILE' group is a must, and the other groups are optional.
  		;;
  		"^\\([^(\n]+\\)(\\([0-9]+\\):\\([0-9]+\\))\\ .*$"

  		;;
  		;; The rest parts to indicated which group is for what
  		;;
  		1	; FILE group
  		2	; LINE group
  		3	; COLUMN group
  	)
  )
#+END_SRC

/Users/wison/odin/temp-odin/src/main_test.odin(31:6) Syntax Error: Expected ';', got identifier 



** =eglot= LSP support

=Emacs Polyglot= is the built-in Emacs LSP client.

- Github: https://github.com/joaotavora/eglot
- Manual: https://joaotavora.github.io/eglot

*** Upgrade to latest version

You can run ~eglot-upgrade-eglot~ to the latest version.


*** Install language server

Before you can active =eglot=, you have to install your language server separated.

**** =clangd=

#+BEGIN_SRC bash
  # For Arch Linux
  doas pacman --refresh --sync clang
#+END_SRC

  
**** =zls=

#+BEGIN_SRC bash
  # Build the `zls` from source:

  mkdir ~/temp/ && cd ~/temp
  git clone --recurse-submodules https://github.com/zigtools/zls
  cd zls
  zig build -Doptimize=ReleaseSafe

  # Then move `./zig-out/bin/zls` to your $PATH folder

  # Remove the repo folder
  cd .. && rm -rf zls
#+END_SRC


**** =rust-analyzer=

#+BEGIN_SRC bash
  # Better to upgrade =rust= to latest version (optional)
  # rustup upgrade

  # Remove the old version that comes from `rustup`
  rm -rf ~/.cargo/bin/rust-analyzer

  # Then install the latest version

  # For Arch Linux
  doas pacman --refresh --sync rust-analyzer
#+END_SRC



**** =cmake-language-server=

#+BEGIN_SRC bash
  pip3 install cmake-language-server 

  # Arch linux via paru
  paru --sync --refresh cmake-language-server
#+END_SRC


**** =typescript language server=

By default, it supports the filetypes below:

- javascript
- javascriptreact
- javascript.jsx
- typescript
- typescriptreact
- typescript.tsx

#+BEGIN_SRC bash
    npm install -g typescript typescript-language-server
#+END_SRC


**** Java language server

Download LSP from [[https://download.eclipse.org/jdtls/milestones/?d][here]]

For example, download the latest version: ~jdt-language-server-1.9.0-202203031534.tar.gz~

- Extract

    #+BEGIN_SRC bash
    mkdir java-lsp-server
    tar zxf jdt-language-server-1.9.0-202203031534.tar.gz --directory java-lsp-server 
    #+END_SRC


- Configure =Java= LSP

   Just add =java-lsp-server/bin= to your =$PATH= environment var.


**** =Python=

#+BEGIN_SRC bash
  pip install python-lsp-server
  pip install --upgrade autopep8 
#+END_SRC


*** Setup langauge server list (optional)

~eglot-server-programs~ is the variable that use to list all relationships between =mode= and =language server=.

Basically, the default value covers all you need already, you can check it in the github home page:

https://github.com/joaotavora/eglot

If you run ~describe-variable~ on ~eglot-server-programs~, you should be able to see something like the following:

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (((rust-ts-mode rust-mode)
  ;;   "rust-analyzer")
  ;;  (zig-mode "zls")
  ;;  ((cmake-mode cmake-ts-mode)
  ;;   "cmake-language-server")
  ;;  ((js-mode js-ts-mode tsx-ts-mode typescript-ts-mode typescript-mode)
  ;;   "typescript-language-server" "--stdio")
  ;;  ((dockerfile-mode dockerfile-ts-mode)
  ;;   "docker-langserver" "--stdio")
  ;;  ((bash-ts-mode sh-mode)
  ;;   "bash-language-server" "start")
  ;;  ((c-mode c-ts-mode c++-mode c++-ts-mode)
  ;;   .
  ;;       [("clangd" "ccls")
  ;;   ;; ...ignore the rest
  ;; )
#+END_SRC

That said, you don't need to do anything:)

But if you have to use another language servers, then you can have a look at here:

https://joaotavora.github.io/eglot/#Setting-Up-LSP-Servers


