emacs-250913/init.el

;; (use-package web-mode
;;   :config
;;       (setq web-mode-markup-indent-offset 4
;;             web-mode-css-indent-offset 4
;;             web-mode-code-indent-offset 4
;;             web-mode-style-padding 4
;;             web-mode-script-padding 4
;;             web-mode-enable-auto-closing t
;;             web-mode-enable-auto-opening t
;;             web-mode-enable-auto-pairing t
;;             web-mode-enable-auto-indentation t)
;;   :mode
;;       (".html$" "*css$" "*.tsx")
;; )

(use-package evil-commentary
    :defer t
    :hook (prog-mode . evil-commentary-mode)
)

(add-to-list 'load-path "~/.config/emacs/snippets")

;;
;; Fix 'company' can't list 'yasnippet' candidates in dropdown list
;;
(defun my-fix-company-yasnippet()
   ;; (add-to-list 'company-backends '(company-capf :with company-yasnippet))

   ;;
   ;; Make 'yassnippet' list first
   ;;
   (add-to-list 'company-backends '(:separate company-yasnippet company-capf))
)

(use-package yasnippet
  :config
    ;;
    ;; Enable 'yasnippet' in global minor mode
    ;;
    ;; (yas-global-mode 1)

    ;;
    ;; But I prefer only neable 'yasnippet' in coding mode
    ;;
    (yas-reload-all)

    (add-hook 'org-mode-hook #'yas-minor-mode)
    (add-hook 'prog-mode-hook #'yas-minor-mode)
    ;; (add-hook 'c-ts-mode-hook #'yas-minor-mode)
    ;; (add-hook 'c++-ts-mode-hook #'yas-minor-mode)
    ;; (add-hook 'rust-ts-mode-hook #'yas-minor-mode)
    ;; (add-hook 'zig-mode-hook #'yas-minor-mode)
    ;; (add-hook 'zig-ts-mode-hook #'yas-minor-mode)
    ;; (add-hook 'org-mode-hook #'yas-minor-mode)
    ;; (add-hook 'cmake-ts-mode-hook #'yas-minor-mode)
    ;; (add-hook 'js-ts-mode-hook #'yas-minor-mode)
    ;; (add-hook 'typescript-ts-mode-hook #'yas-minor-mode)
    ;; (add-hook 'hare-mode-hook #'yas-minor-mode)
    ;; (add-hook 'hare-ts-mode-hook #'yas-minor-mode)
	;; (add-hook 'emacs-lisp-mode-hook #'yas-minor-mode)
	;; (add-hook 'lisp-interaction-mode #'yas-minor-mode)

    ;;
    ;; Fix 'company' can't list 'yasnippet' candidates in dropdown list
    ;;
    (add-hook 'eglot-managed-mode-hook #'my-fix-company-yasnippet)

	;;
	;; Fix 'company' can't list 'yasnippet' in the following modes,
	;; as those modes won't trigger 'eglot' (NO LSP support yet)!!!
	;;
	(add-hook 'prog-mode-hook #'my-fix-company-yasnippet)
	;; (add-hook 'hare-mode-hook #'my-fix-company-yasnippet)
	;; (add-hook 'hare-ts-mode-hook #'my-fix-company-yasnippet)
	;; (add-hook 'emacs-lisp-mode-hook #'my-fix-company-yasnippet)
	;; (add-hook 'lisp-interaction-mode #'my-fix-company-yasnippet)
)

(use-package company
  :custom
     (company-minimum-prefix-length 2)
     (company-idel-delay 0.0)
  :config
      ;;
      ;; Enable completion for all buffers
      ;;
      (global-company-mode 1)
)

;;
;; A company front-end with icons.
;;
(use-package company-box
  :hook (company-mode . company-box-mode))

;;
;; The command name as 'symbol'
;;
(push 'odin compilation-error-regexp-alist)

;;
;; The real error regex
;;
(add-to-list
	'compilation-error-regexp-alist-alist
	'(
		;;
		;; The 'symbol' that you use in 'compilation-error-regexp-alist'
		;;
		odin

		;;
		;; Regex pattern to match: '/path/file.odin(line:column) '
		;;
		;; Here are the rules:
		;;
		;; The regex has different match groups in order:
		;; 'FILE [LINE COLUMN TYPE HYPERLINK HIGHLIGHT...]'
		;;
		;; The first 'FILE' group is a must, and the other groups are optional.
		;;
		"^\\([^(\n]+\\)(\\([0-9]+\\):\\([0-9]+\\))\\ .*$"

		;;
		;; The rest parts to indicated which group is for what
		;;
		1	; FILE group
		2	; LINE group
		3	; COLUMN group
	)
)
