emacs-250913/configuration.org
*** ~eglot-server-programs~ extra settings for ~ols~ (Odin LSP server))

If you want to pass extra arguments/options to the specific LSP server, you can do that in the following ways:

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Here is the code and comment from 'eglot-server-programsr'
  ;;
  (defvar eglot-server-programs `())

  ;;
  ;; How the command 'eglot' guesses the server to start.
  ;; An association list of '(MAJOR-MODE . CONTACT)' pairs.
  ;;
  ;; 'MAJOR-MODE' identifies the buffers that are to be managed by a specific language server.
  ;; 'CONTACT' specifies how to connect to a server for those buffers.
  ;;
  ;; The value of 'CONTACT' can be either:
  ;;
  ;; - '(program args…)'
  ;;   This says to invoke program with zero or more arguments args; the program is expected
  ;;   to communicate with Emacs via the standard input and standard output streams.
  ;; 
  ;; - '(program args… :initializationOptions options…)'
  ;;   program is invoked with args but options specifies how to construct the
  ;;   ‘:initializationOptions’ JSON object to pass the server on during the LSP handshake
  ;;
#+END_SRC

So, for letting the ~ols~ to know where your Odin collections located, you need the following settings:

#+BEGIN_SRC emacs-lisp
  ;; (setq init_options (concat (getenv "HOME") "/odin/odin-utils"))
  (with-eval-after-load 'eglot
  	(add-to-list 'eglot-server-programs
  		`(
  			(odin-mode odin-ts-mode)
  			.
  			(
  				"ols"
  				:initializationOptions
  				(:collections
  					(
  						:name "utils"
  						:path "/home/wison/odin/odin-utils" 
  					)
  				)
  			)
  		)
  	)
  )
#+END_SRC


This part:

#+BEGIN_SRC emacs-lisp :tangle no
  :initializationOptions
  (:collections
  	(
  		:name "utils"
  		:path init_options 
  	)
  )
#+END_SRC

is Emacs’s representation in =plist= format of a simple =JSON= object:

#+BEGIN_SRC json-ts
  {
    "initializationOptions": {
      "collections": {
        "name": "utils",
        "path": "/home/wison/odin/odin-utils" 
      }
    }
  }
#+END_SRC

After opening a =odin= file and the =eglot= runs, you can run ~eglot-events-buffer~ to see the realtime LSP server log to confirm that =initializationOptions= works as expected:

#+BEGIN_SRC fish
  jsonrpc: 2.0
  id:      1
  method:  initialize
  params:
    processId:             35937
    clientInfo:
      name:    Eglot
      version: 1.18
    rootPath:              /home/wison/odin/temp-odin/
    rootUri:               file:///home/wison/odin/temp-odin
    initializationOptions:
      collections:
        name: utils
        path: /home/wison/odin/odin-utils
#+END_SRC


*** Start =eglot=

**** Start =eglot= manually

The most common way to start Eglot is to simply visit a source file of a given language and use the command ~M-x eglot~. This starts the language server suitable for the visited file’s =major-mode,= and attempts to connect to it. If the connection to the language server is successful, you will see the =[eglot:project]= indicator on the mode line which reflects the server that was started. 

For example:

#+BEGIN_SRC bash

  #[eglot] Connected! Server `clangd' now managing `(c-ts-mode c-mode c++-mode c++-ts-mode)' buffers in project `ping-pong-tron-legacy'.

#+END_SRC


A single =Eglot= session for a certain =major-mode= usually serves all the buffers under that mode which visit files from the same project, so you don’t need to invoke =M-x eglot= again when you visit another file from the same project which is edited using the same =major-mode.= This is because =Eglot= uses the Emacs project infrastructure, as described in Buffers, Projects, and Eglot, and this knows about files that belong to the same project. Thus, after starting an Eglot session for some buffer, that session is automatically reused when visiting files in the same project with the same =major-mode=.


**** Start =eglot= automatically

***** Fix =tab= issue

Before you setup the start hook, you better to fix the =indentation= style.

****** What is a =style=

A =style= is a named collection of customizations that can be used in C mode and the related modes. There are many of them with very different settings.

For example, this is the default =gnu= style and =linux= style:

#+BEGIN_SRC emacs-lisp :tangle no
  ;; GNU
  ("gnu"
   (c-basic-offset . 2)
   (c-comment-only-line-offset 0 . 0)
   (c-hanging-braces-alist
    (substatement-open before after)
    (arglist-cont-nonempty))
   (c-offsets-alist
    (statement-block-intro . +)
    (knr-argdecl-intro . 5)
    (substatement-open . +)
    (substatement-label . 0)
    (label . 0)
    (statement-case-open . +)
    (statement-cont . +)
    (arglist-intro . c-lineup-arglist-intro-after-paren)
    (arglist-close . c-lineup-arglist)
    (inline-open . 0)
    (brace-list-open . +)
    (brace-list-intro first c-lineup-2nd-brace-entry-in-arglist c-lineup-class-decl-init-+ +)
    (topmost-intro-cont first c-lineup-topmost-intro-cont c-lineup-gnu-DEFUN-intro-cont))
   (c-special-indent-hook . c-gnu-impose-minimum)
   (c-block-comment-prefix . ""))

  ;;  Linux
  ("linux"
    (indent-tabs-mode . t)
      (c-basic-offset . 8)
      (c-comment-only-line-offset . 0)
      (c-hanging-braces-alist
       (brace-list-open)
       (brace-entry-open)
       (substatement-open after)
       (block-close . c-snug-do-while)
       (arglist-cont-nonempty))
      (c-cleanup-list brace-else-brace)
      (c-offsets-alist
       (statement-block-intro . +)
       (knr-argdecl-intro . 0)
       (substatement-open . 0)
       (substatement-label . 0)
       (label . 0)
       (statement-cont . +)))
#+END_SRC

As you can see, they're very different in the detail, it effects your indentation (every time you type =(, [, {= and press =<return>= to add a new line, it will cause reindentation. If you pick the wrong one, you got a mess code and it's very annoying!!!

And the variable =c-default-style= to specify the default style for various major modes( NOT just for the =c-mode=), its default value looks like this:

#+BEGIN_SRC emacs-lisp :tangle no
  ((java-mode . "java")
   (awk-mode . "awk")
   (other . "gnu"))
#+END_SRC

That said except the =java-mode= and =awk-mode=, all the other major modes apply the =gnu= style, that's why your C/C++ code gets messed up!!!

For detailed information, plz take a look at the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Custom-C-Indent.html][Customizing C Indentation]] chapter.


****** How to set default style

If you only want to change the current buffer style, you can press ~C-c .~ then pick a style and press ~<return>~. Or you can call ~c-set-style~ in CC mode, ~c-ts-mode-set-style~ in =c-ts-mode= based on tree-sitter. But keep that in mind, that setting only affects the current buffer!!!

Here is the way to set the default style via the hook:

#+BEGIN_SRC emacs-lisp
  (setq my-tab-width 4)

  ;;
  ;; 
  ;;
  (defun my-c-style-settings()
      ;;
      ;; Very important to reset!!!
      ;;
      (setq tab-width my-tab-width)                

      ;;
      ;;This setting ONLY for for 'c-mode'!!!
      ;;
      (setq c-default-style "linux")               ;; Default is 'gun'
      (setq c-basic-offset my-tab-width)           ;; Default is 2

      ;;
      ;; In 'c-ts-mode' you have to use another settings!!!
      ;;
      (setq c-ts-mode-indent-style "linux")        ;; Default is 'gun'
      (setq c-ts-mode-indent-offset my-tab-width)  ;; Default is 2

      ;;
      ;; Back to normal TAB behavior rather than 'indent-for-tab-command' 
      ;;
      (keymap-set evil-insert-state-local-map "TAB" 'tab-to-tab-stop)

      (message ">>> my-c-style-settings [done]")
  )

  ;; ;;
  ;; ;; In 'c-ts-mode' you have to use another settings!!!
  ;; ;;
  ;; (defun my-c-treesitter-style-settings()
  ;;     (setq c-ts-mode-indent-style "linux")        ;; Default is 'gun'
  ;;     (setq c-ts-mode-indent-offset my-tab-width)  ;; Default is 2
  ;;     (message ">>> my-c-treesitter-style-settings [done]")
  ;; )

  ;;
  ;;
  ;;
  (defun my-emacs-lisp-style-settings()
      (setq tab-width 4)

      (setq lisp-indent-offset my-tab-width)  ;; Default is 2

      ;;
      ;; Back to normal TAB behavior rather than 'indent-for-tab-command'
      ;;
      (keymap-set evil-insert-state-local-map "TAB" 'tab-to-tab-stop)

      (message ">>> my-emacs-lisp-style-settings [done]")
  )


  ;;
  ;; 
  ;;
  (defun my-js-ts-style-settings()
      ;;
      ;; Very important to reset!!!
      ;;
      (setq tab-width my-tab-width)                

      ;;
      ;; Back to normal TAB behavior rather than 'indent-for-tab-command' 
      ;;
      (keymap-set evil-insert-state-local-map "TAB" 'tab-to-tab-stop)

      (message ">>> my-js-ts-style-settings [done]")
  )


  (add-hook 'c-mode-hook #'my-c-style-settings)
  (add-hook 'c-ts-mode-hook #'my-c-style-settings)
  (add-hook 'c++-ts-mode-hook #'my-c-style-settings)
  (add-hook 'zig-mode-hook #'my-c-style-settings)
  (add-hook 'rust-ts-mode-hook #'my-c-style-settings)
  (add-hook 'emacs-lisp-mode-hook #'my-emacs-lisp-style-settings)
  (add-hook 'lisp-interaction-mode-hook #'my-emacs-lisp-style-settings)
  (add-hook 'snippet-mode-hook #'my-emacs-lisp-style-settings)
  (add-hook 'cmake-ts-mode-hook #'my-c-style-settings)
  (add-hook 'typescript-ts-mode-hook #'my-js-ts-style-settings)
  (add-hook 'js-ts-mode-hook #'my-js-ts-style-settings)
  (add-hook 'java-ts-mode-hook #'my-js-ts-style-settings)
  (add-hook 'python-ts-mode-hook #'my-c-style-settings)
#+END_SRC


***** Setup hook to start =eglot=

Here is the way to start =eglot= automatically:

#+BEGIN_SRC emacs-lisp
  (defun start-eglot()
     (eglot-ensure)
     (setq eldoc-echo-area-prefer-doc-buffer t)
     (message ">>> start-elogt")
  )

  (dolist (hook '(c-mode-hook
                  c-ts-mode-hook
                  c++-ts-mode-hook
                  rust-ts-mode-hook
                  zig-mode-hook
                  cmake-ts-mode-hook
                  js-ts-mode-hook
                  typescript-ts-mode-hook
                  java-ts-mode-hook
                  odin-ts-mode-hook
                  python-ts-mode-hook 
                  ))
     (add-hook hook #'start-eglot)
  )
#+END_SRC


The following settings try to disable 'inlay-hint', but it seems doesn't work, have no idea why....

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (defun my-eglot-disable-inlay-hint()
  ;;    (message ">>> [ my-eglot-disable-inlay-hint ]")
  ;;    (eglot-inlay-hints-mode -1)
  ;;    (message ">>> [ my-eglot-disable-inlay-hint ] done.")
  ;; )
  ;; 
  ;; (add-hook 'eglot-connect-hook #'my-eglot-disable-inlay-hint)
#+END_SRC


*** Stop =eglot=

If you don't want to run the =eglot= anymore for any reasons, just run =M-x eglot-shutdown=.


*** =eglot= commands

**** M-x eglot

This command adds the current buffer and the file it visits to the group of buffers and files managed by Eglot on behalf of a suitable language server. If a language server for the buffer’s major-mode (see Major Modes in GNU Emacs Manual) is not yet running, it will be started; otherwise the buffer and its file will be added to those managed by an existing server session.


**** M-x eglot-shutdown

This command shuts down a language server. It prompts for a language server to shut down (unless there’s only one server session, and it manages the current buffer). Then the command shuts down the server and stops managing the buffers the server was used for. Emacs features (see Eglot Features) that Eglot configured to work with the language server are restored back to their original configuration.

Normally, this command kills the buffers used for communicating with the language server, but if invoked with a prefix argument C-u, the command doesn’t kill those buffers, allowing them to be used for diagnostics and problem reporting (see Troubleshooting Eglot).


**** M-x eglot-shutdown-all

This command shuts down all the language servers active in the current Emacs session. As with eglot-shutdown, invoking this command with a prefix argument avoids killing the buffers used for communications with the language servers.


**** M-x eglot-rename

This command renames the program symbol (a.k.a. identifier) at point to another name. It prompts for the new name of the symbol, and then modifies all the files in the project which are managed by the language server of the current buffer to implement the renaming.


**** M-x eglot-format

This command reformats the active region according to the language-server rules. If no region is active, it reformats the entire current buffer.


**** M-x eglot-format-buffer

This command reformats the current buffer, in the same manner as eglot-format does.



