emacs-250913/init.el

;; (setq init_options (concat (getenv "HOME") "/odin/odin-utils"))
(with-eval-after-load 'eglot
	(add-to-list 'eglot-server-programs
		`(
			(odin-mode odin-ts-mode)
			.
			(
				"ols"
				:initializationOptions
				(:collections
					(
						:name "utils"
						:path "/home/wison/odin/odin-utils" 
					)
				)
			)
		)
	)
)

(setq my-tab-width 4)

;;
;; 
;;
(defun my-c-style-settings()
    ;;
    ;; Very important to reset!!!
    ;;
    (setq tab-width my-tab-width)                

    ;;
    ;;This setting ONLY for for 'c-mode'!!!
    ;;
    (setq c-default-style "linux")               ;; Default is 'gun'
    (setq c-basic-offset my-tab-width)           ;; Default is 2

    ;;
    ;; In 'c-ts-mode' you have to use another settings!!!
    ;;
    (setq c-ts-mode-indent-style "linux")        ;; Default is 'gun'
    (setq c-ts-mode-indent-offset my-tab-width)  ;; Default is 2

    ;;
    ;; Back to normal TAB behavior rather than 'indent-for-tab-command' 
    ;;
    (keymap-set evil-insert-state-local-map "TAB" 'tab-to-tab-stop)

    (message ">>> my-c-style-settings [done]")
)

;; ;;
;; ;; In 'c-ts-mode' you have to use another settings!!!
;; ;;
;; (defun my-c-treesitter-style-settings()
;;     (setq c-ts-mode-indent-style "linux")        ;; Default is 'gun'
;;     (setq c-ts-mode-indent-offset my-tab-width)  ;; Default is 2
;;     (message ">>> my-c-treesitter-style-settings [done]")
;; )

;;
;;
;;
(defun my-emacs-lisp-style-settings()
    (setq tab-width 4)

    (setq lisp-indent-offset my-tab-width)  ;; Default is 2

    ;;
    ;; Back to normal TAB behavior rather than 'indent-for-tab-command'
    ;;
    (keymap-set evil-insert-state-local-map "TAB" 'tab-to-tab-stop)

    (message ">>> my-emacs-lisp-style-settings [done]")
)


;;
;; 
;;
(defun my-js-ts-style-settings()
    ;;
    ;; Very important to reset!!!
    ;;
    (setq tab-width my-tab-width)                

    ;;
    ;; Back to normal TAB behavior rather than 'indent-for-tab-command' 
    ;;
    (keymap-set evil-insert-state-local-map "TAB" 'tab-to-tab-stop)

    (message ">>> my-js-ts-style-settings [done]")
)


(add-hook 'c-mode-hook #'my-c-style-settings)
(add-hook 'c-ts-mode-hook #'my-c-style-settings)
(add-hook 'c++-ts-mode-hook #'my-c-style-settings)
(add-hook 'zig-mode-hook #'my-c-style-settings)
(add-hook 'rust-ts-mode-hook #'my-c-style-settings)
(add-hook 'emacs-lisp-mode-hook #'my-emacs-lisp-style-settings)
(add-hook 'lisp-interaction-mode-hook #'my-emacs-lisp-style-settings)
(add-hook 'snippet-mode-hook #'my-emacs-lisp-style-settings)
(add-hook 'cmake-ts-mode-hook #'my-c-style-settings)
(add-hook 'typescript-ts-mode-hook #'my-js-ts-style-settings)
(add-hook 'js-ts-mode-hook #'my-js-ts-style-settings)
(add-hook 'java-ts-mode-hook #'my-js-ts-style-settings)

(defun start-eglot()
   (eglot-ensure)
   (setq eldoc-echo-area-prefer-doc-buffer t)
   (message ">>> start-elogt")
)

(dolist (hook '(c-mode-hook
                c-ts-mode-hook
                c++-ts-mode-hook
                rust-ts-mode-hook
                zig-mode-hook
                cmake-ts-mode-hook
                js-ts-mode-hook
                typescript-ts-mode-hook
                java-ts-mode-hook
                odin-ts-mode-hook
                ))
   (add-hook hook #'start-eglot)
)

;;
