emacs-250913/configuration.org
**** M-x eglot-code-actions

***** M-x eglot-code-action-organize-imports
***** M-x eglot-code-action-quickfix
***** M-x eglot-code-action-extract
***** M-x eglot-code-action-inline
***** M-x eglot-code-action-rewrite


**** M-x eglot-inlay-hints-mode

This command toggles LSP inlay hints on and off for the current buffer. Inlay hints are small text annotations to specific parts of the whole buffer, not unlike diagnostics, but designed to help readability instead of indicating problems. 


**** M-x eglot-stderr-buffer

This command pops up the buffer with the debug info printed by the language server to its standard error stream.


**** M-x eldoc

Ask the ElDoc system for help at point.

***** M-x eldoc-mode

Toggle echo area display of Lisp objects at point (ElDoc mode), it shows the documentation (at point) in the eacho area.

It's enabled by default after =eglot= has beeen executed and it should become the buffer-loca minor mode which you can see it inside the 'modeline'.

If you turn off this mode, the =eldoc-doc-buffer= won't update anymore!!!


***** M-x eldoc-doc-buffer

It opens a buffer and keep updating the documentation (at point) until the buffer has been killed or you turn off the =eldoc-mode=, it's super convenient.

It bounds to =K= by default.


**** M-x flymake-show-buffer-diagnostics

Ask Flymake system to display diagnostics for the current buffer.


**** M-x flymake-show-project-diagnostics

Ask Flymake to list diagnostics for all the files in the current project.


**** M-x xref-find-definitions

Ask Xref to go the definition of the identifier at point.


**** M-x imenu

Let the user navigate the program source code using buffer index, categorizing program elements by syntactic class (class, method, variable, etc.) and offering completion.

Better to use =consult-imenu= instead.


**** M-x completion-at-point

Request completion of the symbol at point.


** My custom abbrevations

*** Turn off the ~save-abbrevs~

#+BEGIN_SRC emacs-lisp
  ;;
  ;; I hate Emacs asks me every time I if I didn't save the abbrev talbe!!!
  ;;
  (setq save-abbrevs nil)

  ;;
  ;; As I re-create all my abbrevs on the fly after Emacs has been loaded,
  ;; that's why I don't need this!!!
  ;;
  ;; (setq abbrev-file-name "")
#+END_SRC


*** All my abbrevs here

**** Abbrev util functions

#+BEGIN_SRC emacs-lisp
  ;;
  ;; This is a special hook function that prevents inserting the 'space'
  ;; when expanding your abbrev!!!
  ;;
  ;; Here the doc info about that part
  ;; Signature
  ;; (define-abbrev TABLE ABBREV EXPANSION &optional HOOK &rest PROPS)
  ;;
  ;; If HOOK is 'non-nil', it should be a function of no arguments;
  ;;
  ;; If HOOK is a 'non-nil' 'symbol' with a 'non-nil' 'no-self-insert' property,
  ;; it can control whether the character that triggered abbrev expansion
  ;; is inserted ('space' in default case).
  ;; If such a HOOK returns 'non-nil', the character is not inserted.
  ;; If such a HOOK returns 'nil', then so does abbrev-insert (and expand-abbrev),
  ;; as if no abbrev expansion had taken place.
  ;;
  (defun not-insert-space () t)
  (put 'not-insert-space 'no-self-insert t)

  ;;
  ;; Insert now datetime with default format: Wed Aug 27 17:56:23 2025
  ;;
  (defun my-abbr-now ()
      "Abbr expension to now datetime"
  	(insert (current-time-string))
  	t
  )
  (put 'my-abbr-now 'no-self-insert t)

  ;;
  ;; Insert now datetime with this format: 2025-08-27 17:56:27
  ;;
  (defun my-abbr-now-only-date ()
      "Abbr expension to now datetime"
  	(insert (format-time-string "%Y-%m-%d %H:%M:%S"))
  	t
  )
  (put 'my-abbr-now-only-date 'no-self-insert t)

  ;;
  ;; Insert now datetime with this format: 17:56:27
  ;;
  (defun my-abbr-now-only-time ()
      "Abbr expension to now datetime"
  	(insert (format-time-string "%H:%M:%S"))
  	t
  )
  (put 'my-abbr-now-only-time 'no-self-insert t)
#+END_SRC


**** global-abbrev-table

#+BEGIN_SRC emacs-lisp :tangle (expand-file-name "~/.config/emacs/my-abbrevs.el")
    ;;
    ;; Clear it
    ;;
    (clear-abbrev-table global-abbrev-table)

    ;;
    ;; Signature
    ;; (define-abbrev-table TABLENAME DEFINITIONS &optional DOCSTRING &rest PROPS)
    ;;
    ;; Documentation
    ;; Define TABLENAME (a symbol) as an abbrev table name.
    ;;
    ;; Define abbrevs in it according to DEFINITIONS, which is a list of elements
    ;; of the form (ABBREVNAME EXPANSION ...) that are passed to define-abbrev.
    ;;
    (define-abbrev-table 'global-abbrev-table '(
        ("afaik" "as far as I know" not-insert-space)
        ("bg" "background" not-insert-space)
        ("fg" "foreground" not-insert-space)
        (":mygithub" "https://github.com/wisonye" not-insert-space)
        (":mylinkedin" "https://www.linkedin.com/in/wison-y-51888887/" not-insert-space)
        (":now" "" my-abbr-now)
        (":nowdateonly" "" my-abbr-now-only-date)
        (":nowtimeonly" "" my-abbr-now-only-time)
    ))


  ;;
  ;; The ":mg" aabrev above needs an extra settings to make it work, as ':' is NOT
  ;; considered at part of the word you expected!!!
  ;;
  ;; You need to modify the properties of the abbreviation table to accept characters
  ;; that are not word consituents.
  ;;
  ;; You need to call `abbrev-table-put' to set the 'props' to the abbrev table:
  ;;
  ;; Signature
  ;; (abbrev-table-put TABLE PROP VAL)
  ;;
  ;; To know more about the ':regexp' property, you can run 'info' and goto the section:
  ;; 'Elisp -> Abbrevs -> Abbrev Properties'
  ;;
  (abbrev-table-put global-abbrev-table :regexp "\\(?:^\\|[\t\s]+\\)\\(?1:[:_].*\\|.*\\)")
#+END_SRC


**** emacs-lisp-mode-abbrev-table

#+BEGIN_SRC emacs-lisp :tangle (expand-file-name "~/.config/emacs/my-abbrevs.el")
  ;;
  ;; Clear it if exists
  ;;
  (when (boundp 'emacs-lisp-mode-abbrev-table)
  	(clear-abbrev-table emacs-lisp-mode-abbrev-table)
  )

  (define-abbrev-table 'emacs-lisp-mode-abbrev-table '(
      ("km" "(keymap-set MODE-MAP \"KEY\" ')" not-insert-space)
      ;; ("mkm" my-keymap-set)
      ("setql" "(setq-local" not-insert-space)
      ("stringempty" "(string-empty-p VAR)" not-insert-space)
      ("stringmatch" "(string-match-p STRING-TO-CHECK VAR)" not-insert-space)
      ("stringnotempty" "(not (string-empty-p VAR))" not-insert-space)
      ("stringnotmatch" "(not (string-match-p STRING-TO-CHECK VAR))" not-insert-space)
  ))
#+END_SRC


*** Lazy load my abbrevs from file

#+BEGIN_SRC emacs-lisp
  (defun my-load-addbrevs-from-file ()
  	;;
  	;; Load my file
  	;;
  	(load  "~/.config/emacs/my-abbrevs.el")

  	;;
  	;; Enable 'abbrev-mode' by hooks
  	;;
  	;; 'text-mode' covers a lot another modes
  	;; 'prog-mode' covers all programming modes
  	;;
  	(add-hook 'text-mode-hook #'abbrev-mode)
  	(add-hook 'prog-mode-hook #'abbrev-mode)
  )

  (add-hook 'after-init-hook #'my-load-addbrevs-from-file)
#+END_SRC


** Color theme

*** =Nerd icons=

#+BEGIN_SRC emacs-lisp
  (use-package nerd-icons)
#+END_SRC

After =nerd-icons= has been installed, you need to run ~nerd-icons-install-fonts~ once to install particular icon font until you can see the nerd icons!!!


*** ++All-the-icons (=treemacs= depends on this fonts)+

Another option you can choose is =all-the-icons= (But I disabled at this momment, as I use =nerd-icons=).

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (use-package all-the-icons)
#+END_SRC

After =all-the-icons= has been installed, you need to run ~all-the-icons-install-fonts~ once to install particular icon font until you can see the icons!!!


*** Doom themes

This package includes a lot of color themes.

;; #+BEGIN_SRC emacs-lisp
#+BEGIN_SRC emacs-lisp
  (use-package doom-themes
      ;; :disabled
      :config
      ;; Global settings (defaults)
      (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
            doom-themes-enable-italic t) ; if nil, italics is universally disabled

      ;; Load theme, pick the one you like
      ;; (load-theme 'doom-gruvbox t)
      ;;(load-theme 'doom-nord-aurora t)
      ;;(load-theme 'doom-one t)
      ;;(load-theme 'doom-solarized-dark t)
      ;;(load-theme 'doom-pine t)
      ;;(load-theme 'doom-zenburn t)
      ;;(load-theme 'doom-laserwave t)
      ;;(load-theme 'doom-henna t)
      ;;(load-theme 'doom-xcode t)
      ;;(load-theme 'doom-lantern t)
      ;;(load-theme 'doom-miramare t)
      ;;(load-theme 'doom-old-hope t)

      ;; Enable flashing mode-line on errors
      ;;(doom-themes-visual-bell-config)

      ;; Enable custom neotree theme (all-the-icons must be installed!)
      (doom-themes-neotree-config)
      ;; or for treemacs users
      (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
      (doom-themes-treemacs-config)
      ;; Corrects (and improves) org-mode's native fontification.
      (doom-themes-org-config)
    )
#+END_SRC


**** How to customize any theme you're using???

Basically, you can use ~describe-variable~ and put your theme name there and ~tab~ to see what theme variable you can use, then pick any one of them to go to the help document.

After that, you can click the theme source code link and you're able to customize from the source code:)

For example, the current theme link in the theme variable help document, put your cursor to the =doom-solarized-light-theme.el= and press ~RET~. Modify all colors you want and save, then reload:)

=doom-solarized-light-padded-modeline= is a variable defined in =doom-solarized-light-theme.el=.


*** +Doom modeline (status bar concept in =Vim=)+

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package doom-modeline
    :disabled
    :after doom-themes
    :init
        (setq doom-modeline-buffer-file-name-style 'truncate-from-project)
        (setq nerd-icons-color-icons nil)
        (doom-modeline-mode 1)
  )
#+END_SRC


*** EF themes

#+BEGIN_SRC emacs-lisp
  (use-package ef-themes
      ;; :disabled
      :config
  )
#+END_SRC


*** =Tron-legacy-theme=

**** +This is the original version which I don't use anymore+

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (use-package tron-legacy-theme
  ;;    :init
  ;;    :config
  ;;        ;; Gloden cursor, only effects the 'GUI' mode
  ;;        (setq tron-legacy-theme-vivid-cursor t)

  ;;        ;; The foreground to be dimmed and comments to be brighter
  ;;        ;; (setq tron-legacy-theme-dark-fg-bright-comments t)

  ;;        ;; changes the background color to a dark gunmetal grey,
  ;;        ;; instead of the default pure black. It doesn't work, as I
  ;;        ;; set a solid background color in 'settings.org'!!!
  ;;        ;; (setq tron-legacy-theme-softer-bg t)

  ;;        (load-theme 'tron-legacy t)
  ;; )
#+END_SRC


**** This is my modified version

I modified the =tron-legacy-theme= and place it in =~/.config/emacs/themes=.

Here are the steps to modify the setting on the fly:

1. Open =~/.config/emacs/themes/my-tron-legacy-theme.el= and change colors

2. Run ~M-x byte-recompile-file~ to re-generate the =~/.config/emacs/themes/my-tron-legacy-theme.elc=

3. In any =emacs= instance, run ~(load-theme 'my-tron-legacy t)~ to take affect.


#+BEGIN_SRC emacs-lisp
  (add-to-list 'custom-theme-load-path "~/.config/emacs/themes/")

  ;; Gloden cursor, only effects the 'GUI' mode
  (setq tron-legacy-theme-vivid-cursor t)

  ;; The foreground to be dimmed and comments to be brighter
  ;; (setq tron-legacy-theme-dark-fg-bright-comments t)

  ;; changes the background color to a dark gunmetal grey,
  ;; instead of the default pure black. It doesn't work, as I
  ;; set a solid background color in 'settings.org'!!!
  ;; (setq tron-legacy-theme-softer-bg t)

  ;; (load-theme 'my-tron-legacy t)
#+END_SRC


*** My custom modeline

