emacs-250913/init.el
;; I hate Emacs asks me every time I if I didn't save the abbrev talbe!!!
;;
(setq save-abbrevs nil)

;;
;; As I re-create all my abbrevs on the fly after Emacs has been loaded,
;; that's why I don't need this!!!
;;
;; (setq abbrev-file-name "")

;;
;; This is a special hook function that prevents inserting the 'space'
;; when expanding your abbrev!!!
;;
;; Here the doc info about that part
;; Signature
;; (define-abbrev TABLE ABBREV EXPANSION &optional HOOK &rest PROPS)
;;
;; If HOOK is 'non-nil', it should be a function of no arguments;
;;
;; If HOOK is a 'non-nil' 'symbol' with a 'non-nil' 'no-self-insert' property,
;; it can control whether the character that triggered abbrev expansion
;; is inserted ('space' in default case).
;; If such a HOOK returns 'non-nil', the character is not inserted.
;; If such a HOOK returns 'nil', then so does abbrev-insert (and expand-abbrev),
;; as if no abbrev expansion had taken place.
;;
(defun not-insert-space () t)
(put 'not-insert-space 'no-self-insert t)

;;
;; Insert now datetime with default format: Wed Aug 27 17:56:23 2025
;;
(defun my-abbr-now ()
    "Abbr expension to now datetime"
	(insert (current-time-string))
	t
)
(put 'my-abbr-now 'no-self-insert t)

;;
;; Insert now datetime with this format: 2025-08-27 17:56:27
;;
(defun my-abbr-now-only-date ()
    "Abbr expension to now datetime"
	(insert (format-time-string "%Y-%m-%d %H:%M:%S"))
	t
)
(put 'my-abbr-now-only-date 'no-self-insert t)

;;
;; Insert now datetime with this format: 17:56:27
;;
(defun my-abbr-now-only-time ()
    "Abbr expension to now datetime"
	(insert (format-time-string "%H:%M:%S"))
	t
)
(put 'my-abbr-now-only-time 'no-self-insert t)

(defun my-load-addbrevs-from-file ()
	;;
	;; Load my file
	;;
	(load  "~/.config/emacs/my-abbrevs.el")

	;;
	;; Enable 'abbrev-mode' by hooks
	;;
	;; 'text-mode' covers a lot another modes
	;; 'prog-mode' covers all programming modes
	;;
	(add-hook 'text-mode-hook #'abbrev-mode)
	(add-hook 'prog-mode-hook #'abbrev-mode)
)

(add-hook 'after-init-hook #'my-load-addbrevs-from-file)

(use-package nerd-icons)

(use-package doom-themes
    ;; :disabled
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled

    ;; Load theme, pick the one you like
    ;; (load-theme 'doom-gruvbox t)
    ;;(load-theme 'doom-nord-aurora t)
    ;;(load-theme 'doom-one t)
    ;;(load-theme 'doom-solarized-dark t)
    ;;(load-theme 'doom-pine t)
    ;;(load-theme 'doom-zenburn t)
    ;;(load-theme 'doom-laserwave t)
    ;;(load-theme 'doom-henna t)
    ;;(load-theme 'doom-xcode t)
    ;;(load-theme 'doom-lantern t)
    ;;(load-theme 'doom-miramare t)
    ;;(load-theme 'doom-old-hope t)

    ;; Enable flashing mode-line on errors
    ;;(doom-themes-visual-bell-config)

    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config)
  )

(use-package ef-themes
    ;; :disabled
    :config
)

(add-to-list 'custom-theme-load-path "~/.config/emacs/themes/")

;; Gloden cursor, only effects the 'GUI' mode
(setq tron-legacy-theme-vivid-cursor t)

;; The foreground to be dimmed and comments to be brighter
;; (setq tron-legacy-theme-dark-fg-bright-comments t)

;; changes the background color to a dark gunmetal grey,
;; instead of the default pure black. It doesn't work, as I
;; set a solid background color in 'settings.org'!!!
;; (setq tron-legacy-theme-softer-bg t)

;; (load-theme 'my-tron-legacy t)

;; -------------------------------------------------------------------------------
