emacs-250913/init.el
;; All custom faces (font settings)
;; -------------------------------------------------------------------------------
;; (defface my-modeline-light-blue-font '((t :foreground "#ACE6FE" :inherit italic bold)) "Modeline light blue font")
;; (defface my-modeline-blue-green-font '((t :foreground "#4BB5BE")) "Modeline blue-green font")
;; (defface my-modeline-light-orange-font '((t :foreground "#DEB45B")) "Modeline light-orange font")
;; (defface my-modeline-orange-font '((t :foreground "#FF9F1C")) "Modeline orange font")
;; (defface my-modeline-yellow-font '((t :foreground "#FFE64D")) "Modeline yellow font")
;; (defface my-modeline-light-red-font '((t :foreground "#f44747")) "Modeline light-red font")
;; (defface my-modeline-light-green-font '((t :foreground "#BBF0EF")) "Modeline light-green font")
;; (defface my-modeline-dark-green-font '((t :foreground "#5A7387")) "Modeline dark-green font")


;; -------------------------------------------------------------------------------
;; Override the default face for change mode line background
;; -------------------------------------------------------------------------------
;; (set-face-attribute 'mode-line-active nil :background "#2F2F2F")
;; (set-face-attribute 'mode-line-inactive nil :background nil)


;; -------------------------------------------------------------------------------
;; All modeline variables
;; -------------------------------------------------------------------------------

;;
;; 'my-modeline-major-mode' variable related
;;

(defun my-get-major-mode ()
	"Return 'major-mode' as a string but discard the '-mode' part."
	(string-replace "-mode" "" (symbol-name major-mode)))

(defun my-get-major-mode-2 ()
	"Return 'major-mode' as a string."
	(symbol-name major-mode))

(defun my-get-major-mode-capitalize ()
	"Return capitalized 'major-mode' as a string."
	(capitalize (string-replace "-mode" "" (symbol-name major-mode))))

(defvar-local my-modeline-major-mode
	'(:eval
		(propertize (my-get-major-mode-2)
			'face '(
					   :weight bold
					   :slant italic
					   ;; :background (face-attribute 'eglot-mode-line :background nil 'default)
					   ;;:background "red"
					)
			;; 'face 'my-modeline-orange-font
		)
	)
	"Mode line constructor to display major mode"
)

;;
;; 'my-modeline-buffer-name' variable related
;;
(defun my-get-current-name () 
	(if (mode-line-window-selected-p)
		(buffer-name)
		(format " %s" (buffer-name))
	)
)

(defvar-local my-modeline-buffer-name
	'(:eval
		 (propertize (my-get-current-name))
	)
	"Mode line constructor to display buffer name"
)

(defvar-local my-modeline-buffer-file-name
	'(:eval
		(propertize (format " %s" (buffer-file-name))))
	"Mode line constructor to display buffer name"
)

;;
;; 'my-modeline-evil-state' variable related
;;
(defun my-get-evil-state()
	"Return 'evil-state' as a string."
	(format " %s  " (upcase (symbol-name evil-state))))

(defvar-local my-modeline-evil-state
	'(:eval
		(when (mode-line-window-selected-p)
			(propertize (my-get-evil-state)
				'face '(:weight bold)
			)
		)
	)
	"Mode line constructor to display current evil state"
)


;;
;; 'my-modeline-git-branch' variable related
;;
(defun my-get-git-branch-name()
	(format "%s %s" (nerd-icons-mdicon "nf-md-source_branch") (substring vc 5))
)

(defvar-local my-modeline-git-branch
	'(:eval
		(when (mode-line-window-selected-p)
			(when-let (vc vc-mode)
				(propertize (my-get-git-branch-name))
			))
	)
)

;;
;; 'my-modeline-flymake' variable related
;;
(declare-function flymake--severity "flymake" (type))
(declare-function flymake-diagnostic-type "flymake" (diag))

;; Based on `flymake--mode-line-counter'.
(defun prot-modeline-flymake-counter (type)
	"Compute number of diagnostics in buffer with TYPE's severity.
	TYPE is usually keyword `:error', `:warning' or `:note'."
	(let ((count 0))
		(dolist (d (flymake-diagnostics))
		(when (= (flymake--severity type)
				(flymake--severity (flymake-diagnostic-type d)))
			(cl-incf count)))
		(when (cl-plusp count)
		(number-to-string count))))

(defun my-get-lsp-error-indicator()
	;; (insert (nerd-icons-octicon "nf-oct-bug"))  2
	;; (insert (nerd-icons-codicon "nf-cod-bug"))  2
	;; (insert (nerd-icons-faicon "nf-fa-bug"))    2
	(nerd-icons-octicon "nf-oct-bug")
)

(defun my-modeline-flymake-error()
	(when-let (count (prot-modeline-flymake-counter (intern ":error")))
		(propertize
			(format " %s %s" (my-get-lsp-error-indicator) count)
		)
	)
)

(defun my-get-lsp-warning-indicator()
	;; (insert (nerd-icons-octicon "nf-oct-copilot_warning"))  2
	;; (insert (nerd-icons-codicon "nf-cod-warning"))          2
	;; (insert (nerd-icons-faicon "nf-fa-warning"))            2
	(nerd-icons-faicon "nf-fa-warning")
)

(defun my-modeline-flymake-warning()
	(when-let (count (prot-modeline-flymake-counter (intern ":warning")))
		(propertize
			(format " %s %s" (my-get-lsp-warning-indicator) count))
	)
)

(defun my-get-lsp-note-indicator()
	;; (insert (nerd-icons-faicon "nf-fa-exclamation"))          2
	;; (insert (nerd-icons-mdicon "nf-md-exclamation_thick"))   󱈸 2
	;; (insert (nerd-icons-faicon "nf-fa-exclamation_circle"))   2
	(nerd-icons-faicon "nf-fa-exclamation_circle")
)

(defun my-modeline-flymake-note()
	(when-let (count (prot-modeline-flymake-counter (intern ":note")))
		(propertize
			(format " %s %s" (my-get-lsp-note-indicator) count))
	)
)

(defvar-local my-modeline-flymake
	`(:eval
	(when (and (bound-and-true-p flymake-mode)
				(mode-line-window-selected-p))
		(list
		'(:eval (my-modeline-flymake-error))
		'(:eval (my-modeline-flymake-warning))
		'(:eval (my-modeline-flymake-note))
		)))
"Mode line construct displaying `flymake-mode-line-format'.
Specific to the current window's mode line.")


;;
;; 'my-modeline-misc-info' variable related
;;
(defvar-local my-modeline-misc-info
    '(:eval
      (when (mode-line-window-selected-p)
        mode-line-misc-info))
  "Mode line construct displaying `mode-line-misc-info'.
Specific to the current window's mode line.")


;; -------------------------------------------------------------------------------
;; Keep that in mind: Each mode line variable (insdie the 'mode-line-format') must have
;; the 'risky-local-variable' property and set to 't'!!!
;; -------------------------------------------------------------------------------
(dolist (my-var '(
					my-modeline-major-mode
					my-modeline-buffer-name
					my-modeline-evil-state
					my-modeline-git-branch
					my-modeline-flymake
					my-modeline-misc-info))
  (put my-var 'risky-local-variable t)
)



;; -------------------------------------------------------------------------------
;;
;; Set the 'mode-line-format' as default value.
;;
;; - If you use 'setq' here, then it only applies to the current local buffer, but you see
;; the instant effects.
;;
;; - If you use 'setq-default' here, then it applies to all buffersc, but you can't see
;; the instant effects until re-launch Emacs.
;; -------------------------------------------------------------------------------
(setq-default mode-line-format
	'("%e"
		my-modeline-evil-state
		my-modeline-buffer-name
		"  "
		;;(:eval (format "MODE: %s" (propertize (symbol-name major-mode) 'face 'warning)))
		my-modeline-major-mode
		"  "
		;; my-modeline-git-branch
		;; "  "
		my-modeline-flymake
		"  "
		my-modeline-misc-info
	)
)

(add-hook
	'emacs-startup-hook
	;; 'after-init-hook
	(lambda ()
		(let (
				;; (theme 'ef-cyprus)
