emacs-250913/configuration.org
**** 3. Change the =face= attribute settings for that particular =face=.

You can use ~(set-face-attribute FACE FRAME &rest ARGS)~ to change the given font attributes.

- If ~FRAME~ is a frame, set the FACE's attributes only for that frame.  If ~FRAME~ is =nil=, set attribute values for all existing frames, as well as the default for new frames.  If ~FRAME~ is =t=, change the default values of attributes for new frames.

- ~ARGS~ must come in pairs ATTRIBUTE VALUE.  ATTRIBUTE must be a valid face attribute name and VALUE must be a value that is valid for ATTRIBUTE, as described below for each attribute.

***** Eaxmple to set =org-level-1= heading color

    #+begin_src emacs-lisp :tangle no
      ;;
      ;; Transparent background color
      ;;
      (set-face-attribute 'org-level-1 nil :background nil)

      ;;
      ;; Background color
      ;;
      (set-face-attribute 'org-level-1 nil :background "olivedrab")

      ;;
      ;; Font color
      ;;
      (set-face-attribute 'org-level-1 nil :foreground "olivedrab")
    #+end_src


***** Example to set =show-paren-match= (matched parentheses) color

#+BEGIN_SRC emacs-lisp :tangle no
  (set-face-attribute 'show-paren-match nil
                      :background "#0a84ff"
                      :foreground "black"
                      :weight 'bold)

  ;;
  ;; After that, you can get back the attribute like below:
  ;;
  (internal-get-lisp-face-attribute 'show-paren-match :foreground)
  (internal-get-lisp-face-attribute 'show-paren-match :background)
#+END_SRC


***** Example to set default font color (but keep the background color doesn't change):

   #+begin_src emacs-lisp :tangle no
     (set-face-attribute 'default nil :foreground "#ACE6FE")
   #+end_src


**** 4. How to get the color string?

   Run ~list-color-display~, then pick name string:)


**** 5. Optional, show color as background on the color string

   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package rainbow-mode)
   #+END_SRC


*** Auto load theme

By default, Emacs only autoload the packages after processing the init file. So sometime when it was trying to load a theme, the theme package wasn't loaded!!!

That's why you better to load theme by using the ~after-init-hook~ to make sure your theme package has been loaded at that moment:)

#+BEGIN_SRC emacs-lisp
  (add-hook
  	'emacs-startup-hook
  	;; 'after-init-hook
  	(lambda ()
  		(let (
  				(theme 'ef-cyprus)
  				;; (theme 'ef-melissa-light)
  				;; (theme 'ef-melissa-dark)
  				;; (theme 'ef-elea-dark)
  				;; (theme 'ef-bio)
  				;; (theme 'ef-autumn)
  				;; (theme 'ef-rosa)
  				;; (theme 'doom-henna)
  				;; (theme 'doom-plain-dark)
  				;; (theme 'doom-plain)
  				;; (theme 'doom-nord)
  				;; (theme 'doom-nord-aurora)
  				;; (theme 'doom-lantern)
  				;; (theme 'doom-pine)
  				;; (theme 'doom-horizon)
  				;; (theme 'doom-zenburn)
  				;; (theme 'doom-old-hope)
  				;; (theme 'doom-laserwave)
  				;; (theme 'doom-monokai-pro)
  				;; (theme 'doom-gruvbox)
  				;; (theme 'my-tron-legacy)

  				;; (gui-theme 'nano)
  				(gui-theme 'nano-light)
  				;; (gui-theme 'nano-dark)
  			)

  			;; (consult-theme my-current-theme)
  			(if (display-graphic-p nil)
  				;;
  				;; GUI, load 'nano-light'
  				;;
  				(progn
  					(my-consult-theme gui-theme)
  					(message ">>> Loaded 'gui-theme': %s" gui-theme))

  				;;
  				;; TUI, load 'theme'
  				;;
  				(progn
  					(my-consult-theme theme)
  					(message ">>> Loaded 'tui-theme': %s" theme))
  			)

  		)
  	)
  )
#+END_SRC


** Minibuffer enable =rainbow-mode=

#+BEGIN_SRC emacs-lisp
  ;;
  ;; A company front-end with icons.
  ;;
  (use-package rainbow-mode
    :hook (minibuffer-setup . rainbow-mode))
#+END_SRC


** My personal modules/packages

