emacs-250913/init.el
				;; (theme 'ef-melissa-light)
				;; (theme 'ef-melissa-dark)
				;; (theme 'ef-elea-dark)
				;; (theme 'ef-bio)
				;; (theme 'ef-autumn)
				;; (theme 'ef-rosa)
				;; (theme 'doom-henna)
				;; (theme 'doom-plain-dark)
				;; (theme 'doom-plain)
				;; (theme 'doom-nord)
				(theme 'doom-nord-aurora)
				;; (theme 'doom-lantern)
				;; (theme 'doom-pine)
				;; (theme 'doom-horizon)
				;; (theme 'doom-zenburn)
				;; (theme 'doom-old-hope)
				;; (theme 'doom-laserwave)
				;; (theme 'doom-monokai-pro)
				;; (theme 'doom-gruvbox)
				;; (theme 'my-tron-legacy)

				;; (gui-theme 'nano)
				(gui-theme 'nano-light)
				;; (gui-theme 'nano-dark)
			)

			;; (consult-theme my-current-theme)
			(if (display-graphic-p nil)
				;;
				;; GUI, load 'nano-light'
				;;
				(progn
					(my-consult-theme gui-theme)
					(message ">>> Loaded 'gui-theme': %s" gui-theme))

				;;
				;; TUI, load 'theme'
				;;
				(progn
					(my-consult-theme theme)
					(message ">>> Loaded 'tui-theme': %s" theme))
			)

		)
	)
)

;;
;; A company front-end with icons.
;;
(use-package rainbow-mode
  :hook (minibuffer-setup . rainbow-mode))

;;
;; Debug flag
;;
