emacs-250913/configuration.org
*** Project command

#+BEGIN_SRC emacs-lisp
  ;;
  ;; Debug flag
  ;;
  (setq project-command-debug-enable nil)
  ;; (setq project-command-debug-enable t)

  ;;
  ;; Logger prefix
  ;;
  (setq project-command-logger-prefix ">>> [ Project command ] -")

  (defun project-command/create-script-files-cmd-list (dir)
  	"Return the script files command list from the given project directory"
  	(let (return_list '())
  		;; (message
  		;; 	"%s 'project_command/create_script_files_cmd_list' get called with %s"
  		;; 	PROJECT_COMMAND_LOGGER_PREFIX
  		;; 	dir)

  		;;
  		;; Filter the '.sh' file in 'dir'
  		;;
  		(setq filenames (directory-files dir))
  		(dolist (filename filenames)
  			(setq ext (url-file-extension filename))
  			;; (message "%s ext: %s" PROJECT_COMMAND_LOGGER_PREFIX ext)

  			(if (string-equal-ignore-case ext ".sh")
  				(progn
  					(add-to-list 'return_list (concat "./" filename) t)
  					;; (message
  					;; 	"%s filename: %s, ext: %s"
  					;; 	PROJECT_COMMAND_LOGGER_PREFIX
  					;; 	filename
  					;; 	ext)
  				))
  		)

  		;; Return the flatten list
  		(append return_list)
  	)
  )


  (defvar
  	project-command-hashmap
  	(make-hash-table :test 'equal)
  	" Project command hashmap:

  key: A string, the project root directory

  value: A 'plist' with the following properties:

  	'selected-cmd - Last cmd selected by the user
  	'cmd-list - Project cmd filename list
  ")


  (defun project-command/run (&optional enable-script-files)
  	"Run a prompt to choose a command inside the current project to run"
  	(let
  		(
  			(current-project-dir (project-root (project-current t)))
  			(current-project-value '()) ;; It's a 'plist'!!!
  			(current-project-cmd-list '()) ;; It's a normal string 'list'
  			(current-selected-cmd "")
  		)

  		;;
  		;; Get back the value by 'current-project-dir'
  		;;
  		(setq current-project-value
  			(gethash current-project-dir project-command-hashmap))

  		(if project-command-debug-enable
  			(message
  				"%s current-project-value: %s"
  				project-command-logger-prefix
  				current-project-value))

  		;;
  		;; Add init value if 'current-project-value' is 'nil'
  		;;
  		(if (not current-project-value)
  			(progn
  				;;
  				;; Prefill
  				;;
  				(if enable-script-files
  					(setq current-project-cmd-list
  						(project-command/create-script-files-cmd-list current-project-dir)))

  				;;
  				;; Add key-value pair to 'project-command-hashmap'
  				;;
  				(puthash
  					current-project-dir (list
  											'selected-cmd ""
  											'cmd-list current-project-cmd-list)
  					project-command-hashmap)

  				;;
  				;; Update 'current-project-value' after init
  				;;
  				(setq current-project-value
  					(gethash current-project-dir project-command-hashmap))


  				;;
  				;; Debug stuff
  				;;
  				(if project-command-debug-enable
  					(message
  						"%s current-project-value (after init): %s"
  						project-command-logger-prefix
  						current-project-value))))

  		;;
  		;; Take out the properties from 'current-project-value' (it's a 'plist')
  		;;
  		(setq current-selected-cmd (plist-get current-project-value 'selected-cmd))
  		(setq current-project-cmd-list (plist-get current-project-value 'cmd-list))

  		;;
  		;; Debug stuff
  		;;
  		(if project-command-debug-enable
  			(message
  				(concat
  					"%s {"
  					"\n\tproject-dir: %s"
  					"\n\tproject-selected-cmd: %s"
  					"\n\tproject-cmd-list: %s"
  					"\n}"
  					)
  				project-command-logger-prefix
  				current-project-dir
  				current-selected-cmd
  				current-project-cmd-list
  				))

  		;;
  		;; Show a prompt and set the user 'selected_cmd'
  		;;
  		(setq current-selected-cmd (completing-read
  			;;
  			;; The prompt
  			;;
  			"Project commands: "								

  			;;
  			;; List: can be either
  			;;
  			;; - A 'list' instance, e.g: (list "./configure.sh" "./run.sh" "./run-test.sh")
  			;; - A 'list' variable name, e.g: cmd-list
  			;; - A 'function': the function is solely responsible for performing completion; 'completion-read'
  			;;                 returns whatever this function returns. The function is called with three
  			;;                 arguments: 'string predicate nil'
  			;;
  			;;				   You can read more from 'Programmed completion':
  			;;				   https://www.gnu.org/software/emacs/manual/html_node/elisp/Programmed-Completion.html
  			;; 
  			current-project-cmd-list

  			;;
  			;; 'PREDICATE' function (not provided)
  			;;
  			nil

  			;;
  			;; 'REQUIRE-MATCH': input must match in the 'List'
  			;;
  			;; - t means that the user is not allowed to exit unless the input is (or
  			;;   completes to) an element of COLLECTION or is null.
  			;;
  			;; - nil means that the user can exit with any input.
  			;;
  			;; - confirm means that the user can exit with any input, but she needs
  			;;   to confirm her choice if the input is not an element of COLLECTION.
  			;;
  			'confirm

  			;;
  			;; 'INIT-INPUT': simulate you type in the input area
  			;;
  			nil

  			;;
  			;; 'HIST': History list (not provided)
  			;;
  			nil

  			;;
  			;; 'DEF': Default value, put it to the top position!!!
  			;;
  			current-selected-cmd
  		))
  		(if project-command-debug-enable
  			(message
  				"%s You selected the command: %s" 
  				project-command-logger-prefix
  				current-selected-cmd))

  		;;
  		;; If 'current-selected-cmd' is NOT empty, do the following steps
  		;;
  		(if (not (string-empty-p current-selected-cmd))
  			(progn
  				;;
  				;; add it to 'current-project-cmd-list' if it doesn't exists yet.
  				;;
  				(add-to-list 'current-project-cmd-list current-selected-cmd t)

  				;;
  				;; After that, update the 'current-project-value'
  				;;
  				(plist-put current-project-value 'selected-cmd current-selected-cmd)
  				(plist-put current-project-value 'cmd-list current-project-cmd-list)

  				;;
  				;; And put it back to the 'project-command-hashmap'!!!
  				;;
  				(puthash
  					current-project-dir
  					current-project-value
  					project-command-hashmap)

  				;;
  				;; Finally, call the 'compile' on the 'current-selected-cmd'!!!
  				;;
  				(let ((default-directory current-project-dir)
  						(compilation-buffer-name-function
  						(or project-compilation-buffer-name-function
  							compilation-buffer-name-function)))
  					(compile current-selected-cmd))

  				))

  	)
  )

  ;;
  ;;
  ;;
  (defun project-command/run-with-enable-script-files ()
  	"Run a prompt to choose a command to run. It calls 'project_command/run' internally and passes 't' to
  it by default, which means pre-filling all scripts '*.sh' into the command list. You can set it to 'nil'
  if you don't want to do this..

  Also, inside the pop-up command list UI, you can type a new command that doesn't exist in the pre-filled
  command list; it will be added to the command list after your confirmation.

  After pressing 'RET' to run the selected command, a reused buffer will be shown int the right side window
  (always) to present the command's output.

  If there is an error inside the output buffer, you can jump to the error line and press 'RET'; it will
  bring you to the source and automatically locate the error position.

  By defualt, the output buffer doesn't scroll to the bottom for you. If you want this, you can set the
  'compilation-scroll-output' global variable to 't'"
  	(interactive)
  	(project-command/run t)
  )
#+END_SRC



