emacs-250913/configuration.org
*** My modified =consult-ripgrep= related

I prefer to disable the grouping feature in ~consult-ripgrep~ buffer:

#+BEGIN_SRC emacs-lisp
 (consult-customize consult-ripgrep :group nil)
#+END_SRC

But this doesn't work if you call ~consult-ripgrep~ programmatically!!!

That's why I copied the ~consult-ripgrep~ and ~consult--grep~ source code to make my own version by adding the ~:group nil~ !!!


#+BEGIN_SRC emacs-lisp
  ;;
  ;; My version of 'consult--grep' to disable the grouping feature
  ;;
  (defun my-consult--grep (prompt make-builder dir initial)
  	"My version of 'consult--grep' to disable the group feature"
  	(pcase-let* ((`(,prompt ,paths ,dir) (consult--directory-prompt prompt dir))
  				(default-directory dir)
  				(builder (funcall make-builder paths)))
  		(consult--read
  			(consult--process-collection builder
  			:transform (consult--grep-format builder)
  			:file-handler t)
  			:prompt prompt
  			:lookup #'consult--lookup-member
  			:state (consult--grep-state)
  			:initial initial
  			:add-history (thing-at-point 'symbol)
  			:require-match t
  			:category 'consult-grep

  			;;
  			;; This is the key setting to disable the grouping feature in the ripgrep result minibuffer!!!
  			;;
  			:group nil

  			:history '(:input consult--grep-history)
  			:sort nil
  		)
  	)
  )

  ;;
  ;; My version of 'consult-ripgrep' to call 'my-consult--grep'
  ;;
  (defun my-consult-ripgrep (&optional dir initial)
  	"My version of 'consult-ripgrep' to call 'my-consult--grep'"
  	(interactive "P")
  	(my-consult--grep "Ripgrep" #'consult--ripgrep-make-builder dir initial)
  )
#+END_SRC


