emacs-250913/init.el
;; My version of 'consult--grep' to disable the grouping feature
;;
(defun my-consult--grep (prompt make-builder dir initial)
	"My version of 'consult--grep' to disable the group feature"
	(pcase-let* ((`(,prompt ,paths ,dir) (consult--directory-prompt prompt dir))
				(default-directory dir)
				(builder (funcall make-builder paths)))
		(consult--read
			(consult--process-collection builder
			:transform (consult--grep-format builder)
			:file-handler t)
			:prompt prompt
			:lookup #'consult--lookup-member
			:state (consult--grep-state)
			:initial initial
			:add-history (thing-at-point 'symbol)
			:require-match t
			:category 'consult-grep

			;;
			;; This is the key setting to disable the grouping feature in the ripgrep result minibuffer!!!
			;;
			:group nil

			:history '(:input consult--grep-history)
			:sort nil
		)
	)
)

;;
;; My version of 'consult-ripgrep' to call 'my-consult--grep'
;;
(defun my-consult-ripgrep (&optional dir initial)
	"My version of 'consult-ripgrep' to call 'my-consult--grep'"
	(interactive "P")
	(my-consult--grep "Ripgrep" #'consult--ripgrep-make-builder dir initial)
)

;;
