emacs-250913/configuration.org
*** Coding assistant

90% time of my time when I'm dealing with LSP is focused  on two functionalities:

- ~gd~: Go to definition.
- ~K~: Have a pick on the function signature.

So, I prefer to build my own =Coding Assistant= instead of dealing with the LSP (both server and client), as LSP is somewhat slow in =Emacs=.

Basically, how =Go to definition= works is very simple:

You can run ~Ripgrep~ with the function name under the cursor on the given directories, then you have two ways to handle the ~Rigprep~ result:

- You got a single line result:

  For this case, just open the source file into a new/existing buffer and go to the specific line.


- You got a multiple lines result:

  For this case, run ~completing-read~ or ~consult-read~ to show up list in minubuffer, then you can choose which file to open


Here is my implementation:

#+BEGIN_SRC emacs-lisp
  ;;
  ;; Enable debug log flag
  ;;
  ;; (setq my-enable-ca-debug-log t)
  (setq my-enable-ca-debug-log nil)

  (defun my-rg-search-sync (directory search-regex)
  	"Run 'rg' with 'search-regex' on 'directory' in a separate process synchronously. This function
  returns a list containing two elements in the following difference cases:

  - If 'rg' runs successfully, the first element is the 'success symbol and the second element is the
  process stdout string.

  - If 'rg' runs but fails with error, the first element is the 'fail symbol and the second element is
  the process stdout string (as error).

  - If 'rg' fails to run, the first element is the 'error symbol and the second element is the error
  message string.
  "
  	(let* (
  			(process-self)
  			(process-name (concat "rg-search-" (format-time-string "%s")))
  			(process-buffer-name (concat "*-" process-name "-*"))
  			(process-exit-code)
  			(stdout)
  		)

  		(if my-enable-ca-debug-log
  			(progn
  				(message (concat
  							">>> [ my-rg-search-sync ] - {"
  							"\n\tdirectory: %s"
  							"\n\tsearch-regex: %s"
  							"\n\tprocess-buffer-name: %s"
  							"\n}"
  					)
  					directory
  					search-regex
  					process-buffer-name))
  		)

  		(condition-case err
  			(progn
  				(setq
  					process-self
  					(make-process
  						;;
  						;; Unique process name 'rg-search-CURRENT_TIME_IN_SECONDS'
  						;;
  						:name process-name

  						;;
  						;; 'nil' means that this process is not associated with any buffer.
  						;; can be a 'Buffer' or a buffer name string
  						;;
  						:buffer process-buffer-name

  						;;
  						;; Command list: (program-file-name args)
  						;;
  						:command (list
  									"rg"
  									"--line-number"
  									"--line-buffered"
  									"--no-heading"
  									"--with-filename"
  									"--color=never"
  									"--path-separator=/"
  									"--smart-case"
  									search-regex
  									directory
  								)

  						;;
  						;; Use this 'sentinel' setting to avoid adding the 'Process xxx yyy' final
  						;; to the process's buffer!!!
  						;;
  						:sentinel #'ignore
  					))

  				;;
  				;; Wait for it to finish
  				;;
  				(while (process-live-p process-self)
  					(accept-process-output process-self 0.05))

  				;;
  				;; Check exit code
  				;;
  				(setq process-exit-code (process-exit-status process-self))
  				(if my-enable-ca-debug-log
  					(message ">>> [ my-rg-search-sync ] - process-exit-code: %s" process-exit-code))

  				;;
  				;; Return different results based on the 'exit' code
  				;;
  				(cond
  					((equal process-exit-code 0)
  						(with-current-buffer (process-buffer process-self)
  							(setq stdout (buffer-string)))
  						;;
  						;; It's very important to kill the process' buffer, otherwise, it has a chance
  						;; to overlap the previous buffer's content!!!
  						;;
  						(kill-buffer (process-buffer process-self))
  						;; Return the list
  						(list 'success stdout))
  					(t
  						(with-current-buffer (process-buffer process-self)
  							(setq stdout (buffer-string)))
  						;;
  						;; It's very important to kill the process' buffer, otherwise, it has a chance
  						;; to overlap the previous buffer's content!!!
  						;;
  						(kill-buffer (process-buffer process-self))
  						;; Return the list
  						(list 'fail stdout))
  				)
  			)

  			(file-missing
  				(if my-enable-ca-debug-log
  					(message ">>> [ my-rg-search-sync ] - error: %s" err))
  				(list 'error err)
  			)
  			(error
  				(if my-enable-ca-debug-log
  					(message ">>> [ my-rg-search-sync ] - catch everthing: %s" err))
  				(list 'error err)
  			)
  		)
  	)
  )

  (defun my-rg-search-on-multiple-directories (directory-list search-regex)
  	"Call 'my-rg-search-sync' with each directory inside the 'directory-list' and return a list
  lines, which containing the format: 'full-path-filename:line-no:source-code'"
  	(interactive)
  	(let (
  			 (search-result nil) ;; Holds each 'my-rg-search-sync' result
  			 (lines nil)
  			 (result-list nil)
  		)
  		(dolist (dir directory-list)
  			(setf search-result nil)
  			(setq search-result (my-rg-search-sync dir search-regex))
  			;; (message ">>> search-result: %s" search-result)

  			(if (and (string= (type-of search-result) "cons") (equal (length search-result) 2))
  				(let (
  						(result-type (car search-result))
  						(output (car (cdr search-result)))
  					)
  					;; (message ">>> result-type: %s" result-type)
  					;; (message ">>> output type: %s, value: %s" (type-of output) output)

  					(if (eq result-type 'success)
  						(progn
  							;; Separated by '\n' and remove the empty lines
  							(setq lines (string-split output "\n" t))
  							;; Flatten the 'result-list' and 'lines' into a single list
  							(setq result-list (append result-list lines))))
  				)
  			)
  		)

  		;; Return value
  		result-list
  	)
  )


  (defun my-ca-go-to-definition ()
  	"My code-assistant: Go to function definition that is under the cursor position"
  	(interactive)
  	(let* (
  			;;
  			;; Get function name from cursor position
  			;;
  			(function-name (thing-at-point 'symbol t))

  			;;
  			;; Get back the 'rg' search directories based on current major mode, the search order
  			;; is important!!!
  			;;
  			(directories
  				(cond
  					((eq major-mode 'odin-ts-mode)
  						(list
  							(expand-file-name (project-root (project-current t)))
  							(expand-file-name "./odin/odin-utils" (getenv "HOME"))
  							(getenv "ODIN_ROOT")))
  					((eq major-mode 'c-ts-mode)
  						(cond
  							((eq system-type 'darwin)
  								(list
  									(expand-file-name (project-root (project-current t)))
  									(expand-file-name "./c/c-utils" (getenv "HOME"))
  									"/usr/include"))
  							((eq system-type 'berkeley-unix)
  								(list
  									(expand-file-name (project-root (project-current t)))
  									(expand-file-name "./c/c-utils" (getenv "HOME"))
  									"/usr/include"))
  							((eq system-type 'gnu/linux)
  								(list
  									(expand-file-name (project-root (project-current t)))
  									(expand-file-name "./c/c-utils" (getenv "HOME"))
  									"/usr/include"))))
  				)
  			)

  			;;
  			;; Regex rules:
  			;; - Start from the beggin of line
  			;; - Before the function name, can be 0 or more 'space' or 'TAB' characters
  			;; - After the function name, can be 0 or more 'space' or 'TAB' characters before '::'
  			;;
  			(search-regex (concat "^[ \t]*" function-name "[ \t]*:: "))

  			;;
  			;; The final 'rg' lines
  			;;
  			(result-lines nil)
  		)

  		(if my-enable-ca-debug-log
  			(progn
  				(message
  					(concat
  						">>> [ my-ca-go-to-definition ] - {"
  						"\n\tfunction-name: %s"
  						"\n\tsearch-regex: %s"
  						"\n\tdirectories: %s"
  						"\n}")
  					function-name
  					search-regex
  					directories)))

  		;;
  		;; Get back all 'rg' result lines
  		;;
  		(setq result-lines
  			(my-rg-search-on-multiple-directories
  				directories
  				search-regex))

  		(if my-enable-ca-debug-log
  			(progn
  				(message ">>> resu lt-lines len: %s" (length result-lines))
  				(dolist (line result-lines)
  					(message ">>> line: %s" line))
  				))

  		(cond
  			;;
  			;; If got a single line, then open source code and go to that line no
  			;;
  			((= (length result-lines) 1)
  				(let ((temp-list (string-split (car result-lines) ":" t)))
  					(if (>= (length temp-list) 2)
  						(progn
  							;; Push the current position into xref history
  							(xref-push-marker-stack)

  							;; Jump to file and line
  							(with-current-buffer (find-file (car temp-list))
  								;; (message ">>> go to line: %s" (car (cdr temp-list)))
  								(goto-line (string-to-number (car (cdr temp-list))))
  								(evil-scroll-line-to-center nil)
  							)))
  				))
  			;;
  			;; If got more than one line, show in minibuffer and ask user to pick one
  			;;
  			((> (length result-lines) 1)
  				(setq selected-line (completing-read
  					;;
  					;; The prompt
  					;;
  					"Go to definition: "

  					;;
  					;; List: can be either
  					;;
  					result-lines

  					;;
  					;; 'PREDICATE' function (not provided)
  					;;
  					nil

  					;;
  					;; 'REQUIRE-MATCH': input must match in the 'List'
  					;;
  					t

  					;;
  					;; 'INIT-INPUT': simulate you type in the input area
  					;;
  					nil

  					;;
  					;; 'HIST': History list (not provided)
  					;;
  					nil

  					;;
  					;; 'DEF': Default value, put it to the top position!!!
  					;;
  					nil
  				))
  				;; (message ">>> selected-line: %s" selected-line)

  				(let ((temp-list (string-split selected-line ":" t)))
  					(if (>= (length temp-list) 2)
  						(progn
  							;; Push the current position into xref history
  							(xref-push-marker-stack)

  							;; Jump to file and line
  							(with-current-buffer (find-file (car temp-list))
  								;; (message ">>> go to line: %s" (car (cdr temp-list)))
  								(goto-line (string-to-number (car (cdr temp-list))))
  								(evil-scroll-line-to-center nil)
  							)))
  				)
  			)
  		)
  	)
  )
#+END_SRC


