emacs-250913/init.el
;; Gemini search debugging flag
;;
(setq my-enable-gemini-debug-log t)

;;
;; This is the ':sentinel' function that will be passed into 'make-process'.
;;
;; A “process sentinel” is a function that is called whenever the associated process changes status
;; for any reason, including signals (whether sent by Emacs or caused by the process's own actions)
;; that terminate, stop, or continue the process.
;;
;; The process sentinel is also called if the process exits. The sentinel receives two arguments:
;; - Process itself
;; - A string describing the type of event.
;;
;; The string describing the event looks like one of the following (but this is
;; not an exhaustive list of event strings):
;;
;; • ‘"finished\n"’.
;;
;; • ‘"deleted\n"’.
;;
;; • ‘"exited abnormally with code EXITCODE (core dumped)\n"’.  The
;;   "core dumped" part is optional, and only appears if the process
;;   dumped core.
;;
;; • ‘"failed with code FAIL-CODE\n"’.
;;
;; • ‘"SIGNAL-DESCRIPTION (core dumped)\n"’.  The SIGNAL-DESCRIPTION is
;;   a system-dependent textual description of a signal, e.g.,
;;   ‘"killed"’ for ‘SIGKILL’.  The "core dumped" part is optional, and
;;   only appears if the process dumped core.
;;
;; • ‘"open from HOST-NAME\n"’.
;;
;; • ‘"open\n"’.
;;
;; • ‘"run\n"’.
;;
;; • ‘"connection broken by remote peer\n"’.
;;
(defun my-gemini-search-sentinel (self event)
	(let (
			(output-file (process-get self 'output-file))
			(self-buffer (process-buffer self))
		)

		(if my-enable-gemini-debug-log
			(message
				">>> [ my-gemini-search-sentinel ] - process-event: %s, output-file: %s"
				event
				output-file))

		;;
		;; Succeed case: Open the output file buffer
		;;
		(when (string= event "finished\n")
			(find-file-noselect output-file)
			(pop-to-buffer
				(get-buffer (file-name-nondirectory output-file))
				'(
					(display-buffer-reuse-window display-buffer-in-side-window)
					(side . right)
					(inhibit-same-window . t)
				)
			)
		)

		;;
		;; Error case: open the output file buffer and write the stdout (error message) to that buffer
		;;
		(when (or (string-match-p "exited" event) (string-match-p "failed" event))
			(find-file-noselect output-file)

			(with-current-buffer (get-buffer (file-name-nondirectory output-file))
				(erase-buffer)
				(beginning-of-buffer)
				;; (insert "Erorr happend.")
				(insert-buffer-substring (get-buffer self-buffer))
			)

			(pop-to-buffer
				(get-buffer (file-name-nondirectory output-file))
				'(
					(display-buffer-reuse-window display-buffer-in-side-window)
					(side . right)
					(inhibit-same-window . t)
				)
			)
		)

		;;
		;; Make sure to clean up the temporary process buffer
		;;
		(when (or (string= event "finished\n") (string-match-p "exited" event))
			(if my-enable-gemini-debug-log
				(message ">>> [ my-gemini-search-sentinel ] - kill temp process buffer: %s" self-buffer))
			(kill-buffer self-buffer)
		)
	)
)

(defun my-gemini-search (prompt-text)
	"Run 'gemini' CLI with the given 'prompt-text' and save output into '~/.config/emacs/gemini-output.org'.

You need to save the following content into '~/.config/emacs/GEMINI.md' to guarantee that GEMINI always
responds in 'org' format:

```markdown
# Project: This is my emacs configuration

## Response format

- Make sure all responses text use emacs `org` format, then I can copy and paste the response text into emacs.
```
"
	(let* (
			(process-self)
			(process-name (concat "rg-search-" (format-time-string "%s")))
			(process-buffer-name (concat "*-" process-name "-*"))
			(output-file (expand-file-name ".config/emacs/gemini-output.org" (getenv "HOME")))

			;;
			;; 'cd' into the emacs configuration folder can make sure 'gemini' reads the 'GEMINI.md'!!!
			;;
			(command-list (list
							"sh"
							"-c"
							(concat
								"cd ~/.config/emacs && gemini "
								"--prompt \""
								prompt-text
								" \" > "
								output-file)))
		)

		(if my-enable-gemini-debug-log
			(message (concat
						">>> [ my-gemini-search ] - {"
						"\n\tprompt-text: %s"
						"\n\toutput-file: %s"
						"\n\tprocess-buffer-name: %s"
						"\n\tcommand-list: %s"
						"\n}"
				)
				prompt-text
				output-file
				process-buffer-name
				command-list))

		(condition-case err
			(progn
				(setq
					process-self
					(make-process
						;;
						;; Unique process name 'my-gemini-search-CURRENT_TIME_IN_SECONDS'
						;;
						:name process-name

						;;
						;; 'nil' means that this process is not associated with any buffer.
						;; can be a 'Buffer' or a buffer name string
						;;
						:buffer process-buffer-name

						;;
						;; Command list: (program-file-name args)
						;;
						:command command-list

						;;
						;;
						;;
						:sentinel #'my-gemini-search-sentinel))
				;;
				;; Put the 'output-file' into 'process-ref' properties, otherwise, you can't access
				;; 'output-file' in the ':sentinel' function, as they're runing different process
				;; instances!!!
				;;
				(process-put process-self 'output-file output-file)
			)

			(file-missing
				(if my-enable-gemini-debug-log
					(message ">>> [ my-gemini-search ] - error: %s" err))
			)
			(error
				(if my-enable-gemini-debug-log
					(message ">>> [ my-gemini-search ] - catch everthing: %s" err))
			)
		)
	)
)

(defun my-gemini-search-on-selected-text ()
	"Run 'gemini' CLI on the selected text as 'prompt-text' and save 'org' formatted output into
'~/.config/emacs/gemini-output.org'.

You need to save the following content into '~/.config/emacs/GEMINI.md' to guarantee that GEMINI always
responds in 'org' format:

```markdown
# Project: This is my emacs configuration

## Response format

- Make sure all responses text use emacs `org` format, then I can copy and paste the response text into emacs.
```
"
	(interactive)
	(let (
			 (selected-text "")
		)
		(when (use-region-p)
			(setq selected-text
				(buffer-substring-no-properties (region-beginning) (region-end))))

		(if my-enable-gemini-debug-log
				(message ">>> [ my-gemini-search-on-selected-text ] - selected-text: %s" selected-text))

		(if (not (string-empty-p selected-text))
			(progn
				(if my-enable-gemini-debug-log
					(message ">>> [ my-gemini-search-on-selected-text ] - running 'my-gemini-search' on selected-text......"))
				(my-gemini-search selected-text)
			))
	)
)

;;
;; Enable
;;
(setq my-enable-which-key-customized-description t)

;;
;; Disable
;;
;; (setq my-enable-which-key-customized-description nil)

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(dolist (map (list
              evil-insert-state-map
              evil-motion-state-map
              ))
    (keymap-set map "C-z" nil)
)

(dolist (map (list
              global-map
              evil-window-map
              evil-normal-state-map
              evil-motion-state-map
              ))
