emacs-250913/configuration.org
*** Disable ~C-j~ and ~C-k~ 

Disable ~C-j~ and ~C-k~ from the following modes

#+BEGIN_SRC emacs-lisp
  (dolist (map (list
                global-map
                evil-window-map
                evil-normal-state-map
                evil-motion-state-map
                ))
      (keymap-set map "C-j" nil)
      (keymap-set map "C-k" nil)
      ;;(message "State: %s" state);
  )
#+END_SRC


*** Fix =error: Key sequence SPC X starts with non-prefix key SPC=

#+BEGIN_SRC emacs-lisp
  (keymap-set evil-motion-state-map "<SPC>" nil)
#+END_SRC



*** Save buffer by ~W~

#+BEGIN_SRC emacs-lisp
  (dolist (map (list
                evil-motion-state-map
                ))
    (keymap-set map "W" 'save-buffer)
  )

  (if my-enable-which-key-customized-description
      (progn
          (which-key-add-key-based-replacements "W" "Save")
      ))
#+END_SRC


*** Go back to normal mode by ~jj~

#+BEGIN_SRC emacs-lisp
  (defun my-jj-to-escape ()
  	(interactive)
  	(if (memq evil-state '(insert replace))
  	    (let ((changed? (buffer-modified-p)))
  	        (insert "j")
  	        (let* ((tm (current-time))
  	            (ch (read-key)))
  	        (if (and (eq ch ?j)
  	                (< (time-to-seconds (time-since tm)) 0.3))
  	            (save-excursion
  	                (delete-char -1)
  	                (evil-force-normal-state)
  	                (set-buffer-modified-p changed?))
  	            (insert ch))))
  		(call-interactively 'evil-next-line)
  	)
  )

  (keymap-set evil-insert-state-map  "j" 'my-jj-to-escape)
  (keymap-set evil-replace-state-map "j" 'my-jj-to-escape)
#+END_SRC


*** Move to beginning and ending of the line by ~H~ and ~L~

#+BEGIN_SRC emacs-lisp
  (dolist (map (list
                evil-motion-state-map
                ))
    (keymap-set map "H" 'evil-first-non-blank)
    (keymap-set map "L" 'evil-end-of-line)
    ;;(message "State: %s" state);
  )
#+END_SRC


*** Improve ~n~ and ~N~ search

#+begin_src emacs-lisp
  ;;
  ;; Unbind 'n' and 'N'
  ;;
  (keymap-set evil-motion-state-map "n" nil)
  (keymap-set evil-motion-state-map "N" nil)

  (defun my-search-next()
  	(interactive)
  	(evil-search-next)
  	(evil-scroll-line-to-center nil)
  )

  (defun my-search-previous()
  	(interactive)
  	(evil-search-previous)
  	(evil-scroll-line-to-center nil)
  )

  (keymap-set evil-motion-state-map "n" 'my-search-next)
  (keymap-set evil-motion-state-map "N" 'my-search-previous)
#+end_src


*** Go back to last marked position by ~gb~

I can't call ~evil-set-mark~ in my custom function, as it calls ~read-char~ when the function runs, so I can't pass a char in that way.

As a workaround, I can use the default evil keybinding =m= to set a =M= to current position, MAKE SURE that's an uppercase =M=, otherwise, you can go back if you jump to another buffer!!!

#+BEGIN_SRC emacs-lisp
  (defun my-goto-last-marked-position()
  	(interactive)
  	(evil-goto-mark ?m)
  )

  (dolist (map (list
                evil-motion-state-map
                ))
      (keymap-set map "g b" 'my-goto-last-marked-position)
  )

  (if my-enable-which-key-customized-description
      (progn
          (which-key-add-key-based-replacements "gb" "Go back")
      ))
#+END_SRC


*** Search and replace cursor word by ~C-s~ 

#+BEGIN_SRC emacs-lisp
  ;;
  ;; Unbind the default <C-s> for 'isearch-forward'
  ;;
  (keymap-set global-map "C-s" nil)

  ;;
  ;; Replace current word or selection using vim style for evil mode
  ;;
  (defun my-replace-word-under-curor ()
  	(interactive)
  	(if (use-region-p)
  	    (let ((selection (buffer-substring-no-properties (region-beginning) (region-end))))
  	        (if (= (length selection) 0)
  	            (message "empty string")
  	            (evil-ex (concat "'<,'>s/" selection "/"))
  	        )
  	    )
  	    (evil-ex (concat "%s/" (thing-at-point 'word) "/"))
  	)
  )

  ;;
  ;; Rebind <C-s>
  ;;
  (keymap-set evil-motion-state-map "C-s" 'my-replace-word-under-curor)
#+END_SRC


*** Window movement by ~C-h, C-l~

This is only for jumping between left and right windows, for jumping between up and down windows, I prefer to use the default bindings: ~C-w j~ and ~C-w k~.

#+BEGIN_SRC emacs-lisp
  (dolist (map (list
                evil-motion-state-map
                ))
    (keymap-set map "C-l" 'evil-window-right)
    (keymap-set map "C-h" 'evil-window-left)
    ;;(message "State: %s" state);
  )
#+END_SRC


*** Vertico completion jump between candidates by ~C-j~ and ~C-k~

#+BEGIN_SRC emacs-lisp
  (dolist (map (list
                vertico-map
                ))
  	(keymap-set map "C-j" 'vertico-next)
  	(keymap-set map "C-k" 'vertico-previous)
  )
#+END_SRC


*** Evil command line state: command history by ~<C-j>~ and ~<C-k>~

#+BEGIN_SRC emacs-lisp
  ;;
  ;; In command state, <C-j> and <C-k> to cycle command history
  ;;
  (keymap-set evil-command-line-map "C-j" 'next-history-element)
  (keymap-set evil-command-line-map "C-k" 'previous-history-element)
#+END_SRC

**** Here is something that I still don't figure out how to make it happen!!!

I hope that in the =command-line= state (~:~)

- When I type part of the command, then press ~<TAB>~, it shows a completion list pop up buffer
- Then, I can ~<C-j>~ and ~<C-k>~ to cycle through the candidates in the complection list
- when I press ~<RET>~, it accept the current candidate command and run it. 

And I tried the following settings:

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; 'completion-list-mode': <C-j> and <C-k> to cycle the candidates via
  ;; 'completion-list-mode-hook'
  ;;
  (defun my-accept-completion-and-exit()
  	(interactive)
  	(minibuffer-choose-completion)
  	(exit-minibuffer)
  )

  (defun completion-list-mode-cycle-candidates-via-hook()
  	(keymap-set evil-command-line-map "C-j" 'minibuffer-next-completion)
  	(keymap-set evil-command-line-map "C-k" 'minibuffer-previous-completion)
  	(keymap-set evil-command-line-map "RET" 'my-accept-completion-and-exit)
  	(message ">>> bind <C-j>, <C-k> to 'completion-list-mode' to cycle the candidates")
  )

  ;;
  ;; Add the bind function to 
  ;;
  (add-hook 'completion-list-mode-hook #'completion-list-mode-cycle-candidates-via-hook)
#+END_SRC


It works as expected BUT overrides =Evil command line state: command history by ~<C-j>~ and ~<C-k>~ !!!=




*** Rebind all my common bindings to the local buffer-scope for different modes.

**** Why you need do in this way?

Usually, if your bindings are set to =evil-motion-state-map= (which covers =Normal/Motion/Visual= evil states), they should work for most situtations.

But for some particular modes or installed packages, their original bindings are on top of the ~evil-motion-state-minor-mode~ keymap!!!

For example, if you run ~describe-bindings~ in the =org-mode= buffer, you will see the following keymap orders:

#+BEGIN_SRC emacs-lisp :tangle no
  ▶  Key translations:...
  ▶  `evil-normal-state-local-minor-mode' Minor Mode Bindings:... // 'evil-normal-state-local-map' is alway on the most top!!!
  ▶  `evil-commentary-mode' Minor Mode Bindings:...               // Your installed packages mode map
  ▶  `evil-collection-unimpaired-mode' Minor Mode Bindings:...    //
  ▶  `t' Minor Mode Bindings:...                                  // Don't know what mode map
  ▶  `evil-normal-state-minor-mode' Minor Mode Bindings:...       // 'evil-normal-state-map' Your bindings!!!
  ▶  `evil-collection-unimpaired-mode' Minor Mode Bindings:...    //
  ▶  `evil-motion-state-minor-mode' Minor Mode Bindings:...       // 'evil-motion-state-map' Your bindings!!!
  ▶  `evil-commentary-mode' Minor Mode Bindings:...               // Your installed packages mode map
  ▶  `evil-surround-mode' Minor Mode Bindings:...                 // Your installed packages mode map
  ▶  `evil-collection-unimpaired-mode' Minor Mode Bindings:...    //
  ▶  `org-mode' Major Mode Bindings:...                           // The particular mode map: 'org-mode-map'
  ▶  Global Bindings:...                                          // 'global-map'
#+END_SRC


That's why sometimes your bindings will be overwritten by the default bindings from another installed package or emacs modes.
you still need to rebind all of them to the given modes' local buffer-scope to make sure to override the packages' level bindings IF you want your ~<leader>X~ bindings work on that mode!!!

To solve this issue, the more practical way to set your own bindings is to follow these rules:

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Group all the common bindings that are supposed to be shared between different modes.
  ;;
  (defun my-common-bindings (mode-map)
  	(keymap-set mode-map "KEY" 'xxx)
  	(keymap-set mode-map "KEY" 'yyy)

  	;; (evil-local-set-key 'motion (kbd "w") 'xxx)
  	;; (evil-local-set-key 'motion (kbd "w") 'yyy)

  	;; Ignore the rest
  )

  ;;
  ;; Then, have another separate binding only for the particular mode.
  ;;
  (defun my-xxx-mode-bindings (mode-map)
  	(keymap-set mode-map "KEY" 'aaa)
  	(keymap-set mode-map "KEY" 'bbb)

  	;; (evil-local-set-key 'motion (kbd "w") 'aaa)
  	;; (evil-local-set-key 'motion (kbd "w") 'bbb)

  	;; Ignore the rest
  )

  ;;
  ;; Now, this is the function will be called when the 'xxx-mode' is available.
  ;;
  ;; Inside this function, you should call the above 2 functions with the
  ;; 'evil-normal-state-local-map' to make sure your bindings are on the most top priority
  ;; in the bindings order that you've saw in the above example!!!
  ;;
  (defun my-xxx-mode-local-bindings ()
  	;;
  	;; Common bindings first
  	;;
  	(my-common-bindings evil-normal-state-local-map)

  	;;
  	;; And follow the particular mode, just in case your mode-related binding needs to
  	;; overwrite the common one!!!
  	;;
  	(my-xxx-mode-bindings evil-normal-state-local-map)
  )

  ;;
  ;; Now, bind 'my-xxx-mode-local-bindings' to 'xxx-mode-hook'
  ;;
  (add-hook 'xxx-mode-hook #'my-xxx-mode-local-bindings)
#+END_SRC




