emacs-250913/init.el
    (keymap-set map "C-j" nil)
    (keymap-set map "C-k" nil)
    ;;(message "State: %s" state);
)

(keymap-set evil-motion-state-map "<SPC>" nil)

(dolist (map (list
              evil-motion-state-map
              ))
  (keymap-set map "W" 'save-buffer)
)

(if my-enable-which-key-customized-description
    (progn
        (which-key-add-key-based-replacements "W" "Save")
    ))

(defun my-jj-to-escape ()
	(interactive)
	(if (memq evil-state '(insert replace))
	    (let ((changed? (buffer-modified-p)))
	        (insert "j")
	        (let* ((tm (current-time))
	            (ch (read-key)))
	        (if (and (eq ch ?j)
	                (< (time-to-seconds (time-since tm)) 0.3))
	            (save-excursion
	                (delete-char -1)
	                (evil-force-normal-state)
	                (set-buffer-modified-p changed?))
	            (insert ch))))
		(call-interactively 'evil-next-line)
	)
)

(keymap-set evil-insert-state-map  "j" 'my-jj-to-escape)
(keymap-set evil-replace-state-map "j" 'my-jj-to-escape)

(dolist (map (list
              evil-motion-state-map
              ))
  (keymap-set map "H" 'evil-first-non-blank)
  (keymap-set map "L" 'evil-end-of-line)
  ;;(message "State: %s" state);
)

;;
;; Unbind 'n' and 'N'
;;
(keymap-set evil-motion-state-map "n" nil)
(keymap-set evil-motion-state-map "N" nil)

(defun my-search-next()
	(interactive)
	(evil-search-next)
	(evil-scroll-line-to-center nil)
)

(defun my-search-previous()
	(interactive)
	(evil-search-previous)
	(evil-scroll-line-to-center nil)
)

(keymap-set evil-motion-state-map "n" 'my-search-next)
(keymap-set evil-motion-state-map "N" 'my-search-previous)

(defun my-goto-last-marked-position()
	(interactive)
	(evil-goto-mark ?m)
)

(dolist (map (list
              evil-motion-state-map
              ))
    (keymap-set map "g b" 'my-goto-last-marked-position)
)

(if my-enable-which-key-customized-description
    (progn
        (which-key-add-key-based-replacements "gb" "Go back")
    ))

;;
;; Unbind the default <C-s> for 'isearch-forward'
;;
(keymap-set global-map "C-s" nil)

;;
;; Replace current word or selection using vim style for evil mode
;;
(defun my-replace-word-under-curor ()
	(interactive)
	(if (use-region-p)
	    (let ((selection (buffer-substring-no-properties (region-beginning) (region-end))))
	        (if (= (length selection) 0)
	            (message "empty string")
	            (evil-ex (concat "'<,'>s/" selection "/"))
	        )
	    )
	    (evil-ex (concat "%s/" (thing-at-point 'word) "/"))
	)
)

;;
;; Rebind <C-s>
;;
(keymap-set evil-motion-state-map "C-s" 'my-replace-word-under-curor)

(dolist (map (list
              evil-motion-state-map
              ))
  (keymap-set map "C-l" 'evil-window-right)
  (keymap-set map "C-h" 'evil-window-left)
  ;;(message "State: %s" state);
)

(dolist (map (list
              vertico-map
              ))
	(keymap-set map "C-j" 'vertico-next)
	(keymap-set map "C-k" 'vertico-previous)
)

;;
;; In command state, <C-j> and <C-k> to cycle command history
;;
(keymap-set evil-command-line-map "C-j" 'next-history-element)
(keymap-set evil-command-line-map "C-k" 'previous-history-element)

;; ----------------------------------------------------------------------------
;; Buffer related
;; ----------------------------------------------------------------------------
