emacs-250913/init.el
(defun my-switch-to-last-buffer ()
	(interactive)
	(switch-to-buffer nil)
)

;; ----------------------------------------------------------------------------
;; Window resizing related
;; ----------------------------------------------------------------------------
(defun my-increase-window-width ()
	(interactive)
	(evil-window-increase-width 5)
)

(defun my-decrease-window-width ()
	(interactive)
	(evil-window-increase-width -5)
)

(defun my-increase-window-height ()
	(interactive)
	(evil-window-increase-height 5)
)

(defun my-decrease-window-height ()
	(interactive)
	(evil-window-increase-height -5)
)

;; ----------------------------------------------------------------------------
;; Quick open related
;; ----------------------------------------------------------------------------
(defun my-open-emacs-configuration ()
	(interactive)
	(find-file "~/.config/emacs/configuration.org")
)

;; (defun my-open-lisp-quick-tutorial ()
;;    (interactivep)
;;    (find-file "~/.config/emacs/lisp-quick-tutorial.org")
;; )

(defun my-open-todo-list ()
	(interactive)
	(find-file "~/.config/emacs/todo.org")
)

(defun my-open-lisp-quick-manual ()
	(interactive)
	(find-file "~/.config/emacs/lisp-quick-tutorial.org")
)

(defun my-open-snippet-folder ()
	(interactive)
	(find-file "~/.config/emacs/snippets")
)

;; ----------------------------------------------------------------------------
;; Fast kill related
;; ----------------------------------------------------------------------------
(defun my-kill-all-special-window-and-buffers-by-type (kill-type)
"Kill the special window and buffers, here are the avaiable options of 'kill-type' :

- 'Info
- 'Help
- 'ElDoc - Elgot documentation
- 'Shell - Shell or Aasync command output
- 'Embark
- 'ManPage
- 'Keybindings
"
	(interactive)
	(let (
		(kill-type-string "")
		(window-to-be-killed nil)
		(logger-prefix ">>> [ kill-all-special-window-and-buffers-by-type ] -")
		)
		(setq kill-type-string
			(cond
					((eq kill-type 'Info) "^*info")
					((eq kill-type 'Help) "^*helpful")
					((eq kill-type 'ElDoc) "^*eldoc")
					((eq kill-type 'Shell) "^\\*\\(Shell\\|Async Shell\\)")
					((eq kill-type 'Embark) "^*Embark")
					((eq kill-type 'ManPage) "^*Man")
					((eq kill-type 'Keybindings) "^*Keybindings")
					(t ""))
		)
		(message "%s kill-type-string: %s" logger-prefix kill-type-string)

		(if (not (string-empty-p kill-type-string))
			(dolist (buf (buffer-list))
				(when (string-match-p kill-type-string (buffer-name buf))
					;;
					;; Try to close its window first if exists.
					;;
					(setq window-to-be-killed (get-buffer-window (buffer-name buf) nil))
					(when window-to-be-killed
						(delete-window window-to-be-killed)
						(message
							"%s Closed window associated with buffer: %s"
							logger-prefix
							(buffer-name
							buf))
					)

					;;
					;; Kill the buffer
					;;
					(message "%s Killed buffer: %s" logger-prefix (buffer-name buf))
					(kill-buffer buf)
				)
			)
		)
	)
)

(defun my-kill-info-window-and-buffers ()
	(interactive)
	(my-kill-all-special-window-and-buffers-by-type 'Info)
)

(defun my-kill-helpful-window-and-buffers ()
	(interactive)
	(my-kill-all-special-window-and-buffers-by-type 'Help)
)

(defun my-kill-eldoc-window-and-buffers ()
	(interactive)
	(my-kill-all-special-window-and-buffers-by-type 'ElDoc)
)

(defun my-kill-embark-window-and-buffers ()
	(interactive)
	(my-kill-all-special-window-and-buffers-by-type 'Embark)
)

(defun my-kill-manpage-window-and-buffers ()
	(interactive)
	(my-kill-all-special-window-and-buffers-by-type 'ManPage)
)

(defun my-kill-shell-window-and-buffers ()
	(interactive)
	(my-kill-all-special-window-and-buffers-by-type 'Shell)
)

(defun my-kill-keybindings-window-and-buffers ()
	(interactive)
	(my-kill-all-special-window-and-buffers-by-type 'Keybindings)
)

;; ----------------------------------------------------------------------------
;; Newline replacement related
;; ----------------------------------------------------------------------------
(defun my-replace-spaces-outside-strings-regex (text)
	"Replace contiguous spaces with \\n, ignoring spaces inside quoted strings."
	(let ((result "") (start 0))
			(while (string-match "\"[^\"]*\"\\|\\( +\\)" text start)
					;; Add text before the match
					(setq result (concat result (substring text start (match-beginning 0))))

					(if (match-beginning 1)
							;; Matched spaces outside quotes - replace with \n
							(setq result (concat result "\n"))
							;; Matched quoted string - add as-is
							(setq result (concat result (match-string 0 text)))
					)

					(setq start (match-end 0))
			)

			;; Add remaining text
			(concat result (substring text start))
	)
)

(defun my-function-newline-replacement ()
	"Fix function newline on selected text, handle in different ways:
- Emacs lisp: replace all ' ' (spaces) with the '\\n' in the selected text exclude the
 spaces inside a string.

- Non Emacs lisp: replace ', ' with the '\\n' in the selected text
"
	(interactive)
	(let (selected_begin selected_end selected_text replaced_text)
		(when (use-region-p)
			(setq selected_begin (region-beginning))
			(setq selected_end (region-end))
			(setq selected_text (buffer-substring selected_begin selected_end))
			;; (message ">>> selected_text: %s" selected_text)

			(if selected_text
				(progn
					;; Run the replacement on the 'selected_text'
					(if (or (eql 'emacs-lisp-mode major-mode)
							(eql 'lisp-interaction-mode major-mode))
						(setq replaced_text
							(my-replace-spaces-outside-strings-regex selected_text))
						(setq replaced_text
							(string-replace ", " ",\n" selected_text))
					)

					;; (message ">>> replaced_text: %s" replaced_text)

					;; Delete the selected region
					(delete-region selected_begin selected_end)

					;; Insert the replacement
					(insert replaced_text)
				)
			)
		)
	)
)

;; ----------------------------------------------------------------------------
;; Show keybindings related
;; ----------------------------------------------------------------------------
(setq  MY-KEYBINDINGS-LIST '(
	(all-mode . (
		("C-x 1"	. "Delete other windows")
		("C-x C-c"	. "Close/Exit emacs")
		("C-x C-f"	. "Find files")
		("C-x b"	. "Switch buffer")
		("SPC b"	. "Buffers (bookmarks)")
		("SPC g"	. "GEMINI CLI")
		("SPC g s"	. "GEMINI CLI - Run on selected text")
		("SPC k d"	. "Kill EL-Doc windows and buffers")
		("SPC k e"	. "Kill Embark windows and buffers")
		("SPC k h"	. "Kill Help windows and buffers")
		("SPC k i"	. "Kill Info windows and buffers")
		("SPC k m"	. "Kill Manpage windows and buffers")
		("SPC o a"	. "Open agenda")
		("SPC o c"	. "Open emacs config")
		("SPC o t"	. "Open todo")
		("SPC p b"	. "Project switch buffer")
		("SPC p c"	. "Project command")
		("SPC p f"	. "Project find files")
		("SPC p r"	. "Project RG")
		("SPC v s"	. "Vertical split")
		("SPC x"	. "M-x")
	))
	(dired-mode . (
		("C-c j"	. "Jump to dired")
		("% m"		. "Mark by regex")
		("C"		. "Copy")
		("D"		. "Delete")
		("R"		. "Rename/move")
		("o"		. "Open file in other window")
		("Z"		. "Compress/uncompress")
		("m"		. "Mark")
		("u"		. "Unmark")
		("U"		. "Unmark all")
		("t"		. "Toggle mark/umask all")
		("g b"		. "Go Backup")
		("g c"		. "Go C")
		("g d"		. "Go Downloads")
		("g e"		. "Go emacs config")
		("g h"		. "Go Home")
		("g o"		. "Go Odin")
		("g p"		. "Go Photos")
		("g r"		. "Go Rust")
		("g t"		. "Go Temp")
		("g z"		. "Go Zig")
		("s h"		. "(Toggle) show hidden")
		("s n"		. "Sort by name")
		("s s"		. "Sort by size")
		("s t"		. "Sort by time")
		("y p"		. "Yank path")
	))
	(org-mode . (
		("SPC i m"	. "Embark collect")
		("SPC i l"	. "Insert link")
		("SPC o l"	. "Open link")
		("SPC n i"	. "Narrow in")
		("SPC n o"	. "Narrow out")
		("C-<left>"	. "Jump up to parent heading")
		("C-<right>"	. "Cycle through TODO state")
	))
	(eww-mode . (
		("o"		. "Open URL")
		("O"		. "Open URL in new buffer")
		("r"		. "Reload")
		("R"		. "Readable mode")
		("u"		. "Scroll up")
		("d"		. "Scroll down")
		("m"		. "Bookmark")
		("SPC i m"	. "Embark collect")
	))
))

(defun my-show-keybindings ()
    "Show my custom key bindings buffer to the right side window; the buffer content
is generated dynamically based on the current mode."
	(interactive)
	(let (
			(current-mode (symbol-name major-mode))
			(buffer-name "*Keybindings*")
			(buffer-text "")
		)
		(message ">>> [ my-show-keybindings ] - current-mode: %s" current-mode )

		;;
		;; Get all 'Key . Desc' pair by current major mode and concat all
		;; together as the 'buffer-text'
		;;
		(dolist (key-entry-alist (alist-get (intern current-mode) MY-KEYBINDINGS-LIST))
			;; (message ">>> key-entry-alist: %s" key-entry-alist)
			(let (
					(key (car key-entry-alist))
					(value (cdr key-entry-alist))
				)
				(setq buffer-text (concat buffer-text key "\t - " value "\n"))
			)
		)

		(setq buffer-text (concat buffer-text "\n---------------------------------------------\n\n"))

		;;
		;; Get all 'Key . Desc' pair by 'all-mode' and concat all together as the 'buffer-text'
		;;
		(dolist (key-entry-alist (alist-get 'all-mode MY-KEYBINDINGS-LIST))
			;; (message ">>> key-entry-alist: %s" key-entry-alist)

			(let (
					(key (car key-entry-alist))
					(value (cdr key-entry-alist))
				)
				(setq buffer-text (concat buffer-text key "\t - " value "\n"))
			)
		)

		;;
		;; Get exists '*Kyes*' buffer or create new and insert the 'buffer-text'
		;;
		(with-current-buffer (get-buffer-create buffer-name)
			(erase-buffer)
			(insert buffer-text)

			;;
			;; Switch to this mode
			;;
			;; (text-mode)
		)

		;;
		;; Show the buffer on the right side
		;;
		(display-buffer
			buffer-name
			;;
			;; The 'Action alist' will be passed to 'display-buffer'
			;;
			'(
				(display-buffer-reuse-window display-buffer-in-side-window)
				(side . right)
				(inhibit-same-window . nil)
				(window-width . 0.2)
			)
		)
	)
)


;; ----------------------------------------------------------------------------
;; Custom load theme related
;; ----------------------------------------------------------------------------
(defun my-consult-theme (theme)
	"My custom 'consult-theme' without prompt, 'theme' type is 'symbol' (not string)!!!"
	(interactive)

	(let (
		(enabled-transparent-background nil)
		)

		(consult-theme theme)
		(message ">>> [ my-consult-theme ] - theme: %s" theme)

		;;
		;; Enable the transparent background for specific themes
		;;
		(setq enabled-transparent-background
			(cond ((equal 'doom-gruvbox theme) t)  ;; if
					((equal 'ef-elea-dark theme) t)  ;; else if
					((equal 'my-tron-legacy theme) t)  ;; else if
					((equal 'doom-monokai-pro theme) t)  ;; else if
					((equal 'doom-pine theme) t)  ;; else if
					((equal 'ef-autumn theme) t)  ;; else if
					((equal 'nano-light theme) t)  ;; else if
					((equal 'nano-dark theme) t)  ;; else if
					(t nil)      ;; else
		))

		(if enabled-transparent-background
			(progn
				(my-set-transparent-background)
				(message
					">>> [ my-consult-theme ] - enabled transparent background with theme: %s"
					theme
				)
			)
		)

		;;
		;; Fix 'show-paren-match' color for 'nano-xxxx' theme
		;;
		(cond
			((eql 'nano-light theme)
				(set-face-attribute
					'show-paren-match
					nil
					:background "#FF6F00"
					:foreground "black"
					:weight 'bold)
				(message
					">>> [ my-consult-theme ] - Fixed 'show-paren-match' color for theme: %s"
					theme))
			((eql 'nano-dark theme)
				(set-face-attribute
					'show-paren-match
					nil
					:background "#0a84ff"
					:foreground "black"
					:weight 'bold)
				(message
					">>> [ my-consult-theme ] - Fixed 'show-paren-match' color for theme: %s"
					theme))
		)
	)
)

(defun my-consult-theme-prompt (theme-name-list)
	"My custom verion of 'consult-theme'.

Usually, I prefer to list only a few themes that interest me, rather than listing
all available themes. That's what this function does: Accept a list of theme names
and prompt me to choose one."

	(interactive)

	(let (
		(avail-themes (cons 'default theme-name-list))
		(saved-theme (car custom-enabled-themes))
		(my-selected-theme-symbol)
		(theme-string "")
		(enabled-transparent-background nil)
		)

		(setq my-selected-theme-symbol (consult--read
			(mapcar #'symbol-name avail-themes)
			:prompt "Theme: "
			:require-match t
			:category 'theme
			:history 'consult--theme-history
			:lookup (lambda (selected &rest _)
						(setq selected (and selected (intern-soft selected)))
						(or (and selected (car (memq selected avail-themes)))
							saved-theme))
			:state (lambda (action theme)
						(pcase action
						('return (consult-theme (or theme saved-theme)))
						((and 'preview (guard theme)) (consult-theme theme))))
			:default (symbol-name (or saved-theme 'default)))
		)

		(setq theme-string (symbol-name my-selected-theme-symbol))
		(message
			">>> [ my-consult-theme-prompt ] - theme-symbol: %s, theme-string: %s"
			my-selected-theme-symbol
			theme-string)

		;;
		;; Enable the transparent background for specific themes
		;;
		(setq enabled-transparent-background
			(cond ((string= "doom-gruvbox" theme-string) t)  ;; if
					((string= "ef-elea-dark" theme-string) t)  ;; else if
					((string= "my-tron-legacy" theme-string) t)  ;; else if
					((string= "doom-monokai-pro" theme-string) t)  ;; else if
					((string= "doom-pine" theme-string) t)  ;; else if
					((string= "ef-autumn" theme-string) t)  ;; else if
					((string= "nano-light" theme-string) t)  ;; else if
					((string= "nano-dark" theme-string) t)  ;; else if
					(t nil)      ;; else
		))

		(if enabled-transparent-background
			(progn
				(my-set-transparent-background)
				(message
					">>> [ my-consult-theme-prompt ] - enabled transparent background, theme: %s"
					theme-string)))

		;;
		;; Fix 'show-paren-match' color for 'nano-xxxx' theme
		;;
		(cond
			((string= "nano-light" theme-string)
				(set-face-attribute
					'show-paren-match
					nil
					:background "#0a84ff"
					:foreground "black"
					:weight 'bold)
				(message
					">>> [ my-consult-theme-prompt ] - Fixed 'show-paren-match' color for theme: %s"
					theme-string))
			((string= "nano-dark" theme-string)
				(set-face-attribute
					'show-paren-match
					nil
					:background "#0a84ff"
					:foreground "black"
					:weight 'bold)
				(message
					">>> [ my-consult-theme-prompt ] - Fixed 'show-paren-match' color for theme: %s"
					theme-string))
		)
				  

		;;
		;; Fixed the org heading font size if you're the 'org-mode'
		;;
		(if (equal major-mode 'org-mode)
			(my/org-mode-setup))
	)
)

(defun my-load-consult-theme-wrapper ()
	(interactive)
	(my-consult-theme-prompt '(
		ef-cyprus
		ef-melissa-light
		ef-melissa-dark
		ef-elea-dark
		ef-bio
		ef-autumn
		ef-rosa
		doom-henna
		doom-plain-dark
		doom-plain
		doom-nord
		doom-nord-aurora
		doom-gruvbox
		doom-lantern
		doom-pine
		doom-horizon
		doom-zenburn
		doom-old-hope
		doom-laserwave
		doom-monokai-pro
		my-tron-legacy
		nano-light
		nano-dark
	))
)


;; ----------------------------------------------------------------------------
;; Implement  the 'g C-a' feature in Vim related
;; ----------------------------------------------------------------------------
(defun my-increase-selected-number-in-visual-block-state ()
	"Increase the selected text (number) from top to bottom:
Go into 'evil-visual-state' by pressing 'C-v', then select a number columns and
press 'C-a' to increase all number from top to bottom (starts from the first number)"
	(interactive)
	(let (
			selected-range
			selected-begin
			selected-end
			current-line
			end-line
			left-column
			right-column
			selected-text '()
			(current-number 0)
			(already-done-with-end-line nil)
		)
		(unless (evil-visual-state-p) (error "No selected number columns."))

		;;
		;; Signature
		;; (evil-visual-range)
		;; 
		;; Documentation
		;; Return the Visual selection as a range.
		;; 
		;; This is a list (BEG END TYPE PROPERTIES...), where BEG is the
		;; beginning of the selection, END is the end of the selection,
		;; TYPE is the selection's type, and PROPERTIES is a property list
		;; of miscellaneous selection attributes.
		;;
		;; Example return value: (1232 1307 block :expanded t :corner upper-left)
		;;
		(setq selected-range (evil-visual-range))

		(setq selected-begin (nth 0 selected-range))
        (setq selected-end (nth 1 selected-range))

		;; Get back the begin line and end line based on the selected range
		(setq current-line (line-number-at-pos selected-begin))
		(setq end-line (line-number-at-pos selected-end))

		;;
		;; Signature
		;; (save-excursion &rest BODY)
		;;
		;; Documentation
		;; Save point, and current buffer; execute BODY; restore those things.
		;;
		;;
		;; The following code means:
		;;
		;; First, save the point (cursor position), and then goto the 'selected-begin'
		;; position (it will change the point, that's why you need to save first) and
		;; get back the column value then save to 'left-column'.
		;; After that, restore the saved point, which means restore the cursor position.
		;;
		(setq left-column (save-excursion
							  (goto-char selected-begin)
							  (current-column)))
		(setq right-column (save-excursion
							   (goto-char selected-end)
							   (current-column)))

		;; (message
		;; 	(concat
		;; 		"\nselected-range: %s"
		;; 		"\nselected-begin: %s"
		;; 		"\nselected-end: %s"
		;; 		"\ncurrent-line: %s"
		;; 		"\nend-line: %s"
		;; 		"\nleft-column: %s"
		;; 		"\nright-column: %s"
		;; 	)
		;; 	selected-range
		;; 	selected-begin
		;; 	selected-end
		;; 	current-line
		;; 	end-line
		;; 	left-column
		;; 	right-column
		;; )

		;;
        ;; Now, let's do this:
		;;
		;; - Save the cursor point
		;; - Loop through all selected lines and extract number text from selected columns
		;; - Convert into number and increase it, then replace it
		;; - Restor the cursor point
		;;
        (save-excursion
			(goto-char selected-begin)
			(setq current-line (line-number-at-pos))

			(while (and (not already-done-with-end-line) (<= current-line end-line))
				(let* (
						(line-beg-pos (line-beginning-position))
						(line-end-pos (line-end-position))
						(line-start (min line-end-pos
										(+ line-beg-pos left-column)))
						(line-end (min line-end-pos
									(+ line-beg-pos right-column)))
						(number-text (buffer-substring line-start line-end))
						(number-value (string-to-number number-text))
					)

					;; (message
					;; 	(concat
					;; 		"\ncurrent-line: %s"
					;; 		"\nline-begin-pos: %s"
					;; 		"\nline-end-pos: %s"
					;; 		"\nline-start: %s"
					;; 		"\nline-end: %s"
					;; 		"\nnumber-text: %s"
					;; 		"\nnumber-value: %s"
					;; 		"\ncurrent-value: %s"
					;; 	)
					;; 	current-line
					;; 	line-beg-pos
					;; 	line-end-pos
					;; 	line-start
					;; 	line-end
					;; 	number-text
					;; 	number-value
					;; 	current-number
					;; )

					(if (= current-number 0)
						;; Init case: Save the first number value
						(progn
							;; If that's NOT a valid number, exit visual state and throw error!
							(if (= number-value 0)
								(progn
									(evil-exit-visual-state)
									(error "First select column doesn't contain valid nubmer!")
								)
							)

							(setq current-number number-value)
						)
						;; Non-init case: increase the saved number
						(progn
							(setq current-number (+ current-number 1))
						)
					)

					;; Delete the selected 'number-text'
					(delete-region line-start line-end)

					;; Insert the replacement
					(goto-char line-start)
					(insert (number-to-string current-number))

					;; (message ">>> Ok, done with current-line: %s" current-line)
				)

				;;
				;; Here is a trick to stop the 'while' loop after finishing the 'end-line'
				;;
				;; If the 'end-line' (last line of the block selection) is the last line of
				;; the current buffer, then the following '(forward-line 1)' does nothing, and
				;; 'current-line' will be still the same value with 'end-line'!!!!
				;;
				;; That's why you need a flag to indicate that: You've done with the 'end-line'
				;; once.
				;;
				(if (= current-line end-line)
					(progn
						(setq already-done-with-end-line t)
						;; (message ">>> already-done-with-end-line: %s" already-done-with-end-line)
					)
				)

				;; Move to the next line and maybe hit the last line of the current buffer
				(forward-line 1)

				;; Update the 'current-line' after trying to move to next line.
				(setq current-line (line-number-at-pos))
				;; (message ">>> update, updated current-line: %s" current-line)

				;; (message ">>> The while loop condition: %s" (and (not already-done-with-end-line) (<= current-line end-line)))

			)
		)

		;; Make sure to exit visual state
		(evil-exit-visual-state)
	)
)
