emacs-250913/configuration.org
**** My ~my-common-bindings~

#+BEGIN_SRC emacs-lisp
  (defun my-dired-jump ()
  	(interactive)
  	(dired default-directory "-lh")
  )

  ;;
  ;; Group all the common bindings that are supposed to be shared between different modes.
  ;;
  (defun my-common-bindings (map)
  	;;
  	;; Toggle spell check
  	;;
  	(keymap-set map "SPC s c" 'flyspell-mode)

  	;;
  	;; Kill current window by 'Q' h
  	;;
  	(keymap-set map "Q" 'delete-window)

  	;; ;;
  	;; ;; Exit Emacs by '<leader>q'
  	;; ;;
  	;; (keymap-set mode-map "SPC q" 'save-buffers-kill-terminal)

  	;;
  	;; Delete other windows by by '<leader>1'
  	;;
  	(keymap-set map "SPC 1" 'delete-other-windows)

  	;;
  	;; Call 'describe-xxxx' functions by '<leader>df/v/k/b'
  	;;
  	(keymap-set map "SPC d f" 'helpful-callable)
  	(keymap-set map "SPC d v" 'helpful-variable)
  	(keymap-set map "SPC d k" 'describe-key)
  	(keymap-set map "SPC d b" 'describe-bindings)
  	(keymap-set map "SPC d m" 'describe-mode)

  	;;
  	;; Toggle command log mode by '<leader>cl'
  	;;
  	(keymap-set map "SPC c l" 'clm/toggle-command-log-buffer)

  	;;
  	;; Load theme by '<leader>lt'
  	;;
  	;; (keymap-set map "SPC l t" 'consult-theme)
  	(keymap-set map "SPC l t" 'my-load-consult-theme-wrapper)

  	;;
  	;; Evaluate lisp expression by '<leader>eb>', '<leader>es', '<leader>ee', '<leader>ep'
  	;;
  	(keymap-set map "SPC e b" 'eval-buffer)           ;; Evaluate buffer
  	(keymap-set map "SPC e s" 'eval-region)           ;; Evaulate selected region
  	(keymap-set map "SPC e e" 'eval-last-sexp)        ;; Evaulate expression
  	(keymap-set map "SPC e p" 'eval-print-last-sexp)  ;; Evaulate expression and print result

  	;;
  	;; Search for man page  by '<leader>m'
  	;;
  	(keymap-set map "SPC m" 'consult-man)

  	;;
  	;; Run 'execute-extended-command' by '<leader>x'
  	;;
  	(keymap-set map "SPC x" 'execute-extended-command)

  	;;
  	;; Open files or buffers by '<leader>f/b'
  	;;
  	;; (keymap-set map "SPC f" 'find-file)
  	(keymap-set map "SPC b" 'consult-buffer)

  	;;
  	;; Project scope fuzzy searching files and related actions by '<leader>p X'
  	;;
  	(keymap-set map "SPC p f" 'project-find-file)
  	(keymap-set map "SPC p d" 'project-dired)
  	(keymap-set map "SPC p s" 'project-switch-project)
  	(keymap-set map "SPC p b" 'project-switch-to-buffer)
  	(keymap-set map "SPC p c" 'project-command/run-with-enable-script-files)
  	(keymap-set map "SPC p r" 'consult-ripgrep)

  	;;
  	;; Switch between last buffers '<leader>SPC'
  	;;
  	(keymap-set map "SPC SPC" 'my-switch-to-last-buffer)

  	;;
  	;; Toggle 'Olivetti' mode (works like 'GoYo' in 'Neovim') by '<leader>RET'
  	;;
  	(keymap-set map "SPC RET" 'olivetti-mode)

  	;;
  	;; 'imenu' (function and variable list) by '<leader>im'
  	;;
  	(keymap-set map "SPC i m" 'consult-imenu)

  	;;
  	;; Window split by '<leader>vs'
  	;;
  	(keymap-set map "SPC v s" 'evil-window-vsplit)

  	;;
  	;; Window movement by 'C-h, C-l' (Only for jumping between left and right windows)
  	;;
  	(keymap-set map "C-l" 'evil-window-right)
  	(keymap-set map "C-h" 'evil-window-left)

  	;;
  	;; Change window size by '-/+/='
  	;;
  	(keymap-set map "|" 'balance-windows)
  	(keymap-set map "=" 'my-increase-window-width)
  	(keymap-set map "-" 'my-decrease-window-width)
  	(keymap-set map "+" 'my-increase-window-height)
  	(keymap-set map "_" 'my-decrease-window-height)

  	;;
  	;; Open something quickly
  	;;
  	(keymap-set map "SPC o a"   'org-agenda)
  	(keymap-set map "SPC o c"   'my-open-emacs-configuration)
  	(keymap-set map "SPC o q"   'my-open-lisp-quick-manual)
  	(keymap-set map "SPC o s f" 'my-open-snippet-folder)
  	(keymap-set map "SPC o t"   'my-open-todo-list)
  	;; (keymap-set map "SPC o l t" 'my-open-lisp-quick-tutorial)

  	;;
  	;; Emoji insert by '<leader>ei'
  	;;
  	(keymap-set map "SPC e i" 'emoji-insert)

  	;;
  	;; Fast kill buffers and windows by '<leadedr>kX'
  	;;
  	(keymap-set map "SPC k d" 'my-kill-eldoc-window-and-buffers)
  	(keymap-set map "SPC k e" 'my-kill-embark-window-and-buffers)
  	(keymap-set map "SPC k h" 'my-kill-helpful-window-and-buffers)
  	(keymap-set map "SPC k i" 'my-kill-info-window-and-buffers)
  	(keymap-set map "SPC k k" 'my-kill-keybindings-window-and-buffers)
  	(keymap-set map "SPC k m" 'my-kill-manpage-window-and-buffers)
  	(keymap-set map "SPC k s" 'my-kill-shell-window-and-buffers)

  	;;
  	;; My function newline code util by '<leader>fn'
  	;;
  	(keymap-set map "SPC f n" 'my-function-newline-replacement)

  	;;
  	;; Jump back to 'dired buffer' corresponding to current buffer by 'C-c j'
  	;;
  	(keymap-set map "C-c j" 'my-dired-jump)

  	;;
  	;; Show keybinding of the current buffer by '<leader>sk'
  	;;
  	(keymap-set map "SPC s k" 'my-show-keybindings)

  	;;
  	;; Run 'gemini-cli' with selected text by '<leader>gs'
  	;;
  	(keymap-set map "SPC g s" 'my-gemini-search-on-selected-text)

  	;;
  	;; Update 'which-key'
  	;;
  	(if my-enable-which-key-customized-description
  	    (progn
  	        ;; (which-key-add-key-based-replacements "SPC q" "Save and exit")
  			(which-key-add-key-based-replacements "SPC 1"   "Delete other windows")
  			(which-key-add-key-based-replacements "SPC c l" "Command Log")
  			(which-key-add-key-based-replacements "SPC l t" "Load theme")
  			(which-key-add-key-based-replacements "SPC m"   "Man page search")
  			(which-key-add-key-based-replacements "SPC x"   "M-x command")
  			;; (which-key-add-key-based-replacements "SPC f"   "Find files")
  			(which-key-add-key-based-replacements "SPC b"   "Switch buffers")
  			(which-key-add-key-based-replacements "SPC SPC" "Last Buffer")
  			(which-key-add-key-based-replacements "SPC RET" "Toggle Focus mode")
  			(which-key-add-key-based-replacements "SPC i"   "iMenu/Insert")

  			(which-key-add-key-based-replacements "SPC d"   "Describe ...")
  			(which-key-add-key-based-replacements "SPC d f" "Function")
  			(which-key-add-key-based-replacements "SPC d v" "Variable")
  			(which-key-add-key-based-replacements "SPC d k" "Keys")
  			(which-key-add-key-based-replacements "SPC d m" "Mode")
  			(which-key-add-key-based-replacements "SPC d b" "Bindings")

  			(which-key-add-key-based-replacements "SPC e"   "Evalute/Emoji")
  			(which-key-add-key-based-replacements "SPC e i" "Insert emoji")
  			(which-key-add-key-based-replacements "SPC e b" "Buffer")
  			(which-key-add-key-based-replacements "SPC e s" "Selection")
  			(which-key-add-key-based-replacements "SPC e e" "Expression")
  			(which-key-add-key-based-replacements "SPC e p" "Expression and print")

  			(which-key-add-key-based-replacements "SPC p"   "Projects")
  			(which-key-add-key-based-replacements "SPC p f" "Fuzzy searching in project")
  			(which-key-add-key-based-replacements "SPC p d" "Open dired in project")
  			(which-key-add-key-based-replacements "SPC p b" "Switch buffer in project")
  			(which-key-add-key-based-replacements "SPC p s" "Switch to another project")
  			(which-key-add-key-based-replacements "SPC p c" "Project command")
  			(which-key-add-key-based-replacements "SPC p r" "Project rg search")

  			(which-key-add-key-based-replacements "SPC v"   "Vertical split")
  			(which-key-add-key-based-replacements "SPC v s" "Vertical split")

  			(which-key-add-key-based-replacements "SPC o"   "(Quick) open ....")
  			(which-key-add-key-based-replacements "SPC o a" "Agenda")
  			(which-key-add-key-based-replacements "SPC o c" "Configuration file")
  			(which-key-add-key-based-replacements "SPC o q" "Lisp quick manual")
  			(which-key-add-key-based-replacements "SPC o s f" "Snippet folder")
  			(which-key-add-key-based-replacements "SPC o t" "Todo list")

  			(which-key-add-key-based-replacements "SPC k" "Kill")
  			(which-key-add-key-based-replacements "SPC k i" "Info window and buffer")
  			(which-key-add-key-based-replacements "SPC k h" "Help window and buffer")
  			(which-key-add-key-based-replacements "SPC k d" "ElDoc window and buffer")
  			(which-key-add-key-based-replacements "SPC k e" "Embark window and buffer")
  			(which-key-add-key-based-replacements "SPC k k" "Keybindings window and buffer")
  			(which-key-add-key-based-replacements "SPC k m" "ManPage window and buffer")
  			(which-key-add-key-based-replacements "SPC k s" "Shell window and buffer")

  			(which-key-add-key-based-replacements "SPC s k" "Show keybindings")

  			(which-key-add-key-based-replacements "SPC g" "GEMINI CLI")
  			(which-key-add-key-based-replacements "SPC g s" "Run on selected text")
  		)
  	)

  )
#+END_SRC


