emacs-250913/configuration.org
**** Apply ~my-common-bindings~ to the followings modes

#+BEGIN_SRC emacs-lisp
  ;;
  ;; Now, this is the function will be called when the 'xxx-mode' is available.
  ;;
  ;; Inside this function, you should call the 'lmy-common-bindings' with the
  ;; 'evil-normal-state-local-map' to make sure your bindings are on the most top priority
  ;; in the bindings order that you've saw in the above example!!!
  ;;
  (defun my-xxx-mode-local-bindings ()
  	;;
  	;; Common bindings first
  	;;
  	(my-common-bindings evil-normal-state-local-map)
  	;; (message ">>> 'my-xxx-mode-local-bindings' runs")
  )

  ;;
  ;; Now, bind 'my-xxx-mode-local-bindings' to 'xxx-mode-hook'
  ;;
  (defun my-bind-common-bindings-to-these-mode-hooks ()
  	(dolist (hook '(
  		help-mode-hook
  		helpful-mode-hook
  		embark-collect-mode-hook
  		dired-mode-hook
  		shell-command-mode-hook
  		debugger-mode-hook
  		compilation-mode-hook
  		special-mode-hook
  		fundamental-mode-hook
  		edit-abbrevs-mode-hook
  		org-mode-hook
  		org-agenda-mode-hook
  		markdown-mode-hook
  		markdown-view-mode-hook
  		eww-mode-hook
  		eww-history-mode-hook
  		eww-bookmark-mode-hook
  		lisp-interaction-mode-hook
  		lisp-mode-hook
  		emacs-lisp-mode-hook
  		emacs-lisp-compilation-mode-hook
  		snippet-mode-hook
  		prog-mode-hook
  		text-mode-hook
  		;; c-mode-hook
  		;; c-ts-mode-hook
  		;; c++-mode-hook
  		;; c++-ts-mode-hook
  		;; zig-mode-hook
  		;; zig-ts-mode-hook
  		;; rust-mode-hook
  		;; rust-ts-mode-hook
  		;; typescript-ts-mode-hook
  		;; js-ts-mode-hook
  		;; java-ts-mode-hook
  		;; hare-mode-hook
  		;; hare-ts-mode-hook
  		))

  		(add-hook hook #'my-xxx-mode-local-bindings)
  		(message ">>> Add 'my-xxx-mode-local-bindings' to '%s'" hook)
  	)
  )

  ;;
  ;; Bind the special bindings to 'evil-visual-state-map'
  ;;
  (defun my-special-visual-state-bindings ()
  	(keymap-set evil-visual-state-map "C-a" 'my-increase-selected-number-in-visual-block-state)
  )

  (defun my-visual-mode-special-bindings ()
  	(dolist (hook '(
  			org-mode-hook
  			markdown-mode-hook
  			lisp-interaction-mode-hook
  			lisp-mode-hook
  			emacs-lisp-mode-hook
  			emacs-lisp-compilation-mode-hook
  			snippet-mode-hook
  			prog-mode-hook
  		))
  		(add-hook hook #'my-special-visual-state-bindings)
  		(message ">>> Add 'my-special-visual-state-bindings' to '%s'" hook)
  	)

  	;; (evil-define-key 'visual lisp-interaction-mode "C-a" 'my-increase-selected-number-in-visual-block-state)

  )

  ;;
  ;; The 'messages-buffer-mode' is super special:
  ;;
  ;; New 'messages-buffer-mode' in Emacs 24.4. [ 08 Jul 2014, by Artur Malabarba. ]:
  ;;
  ;; I've been using 24.4 for months now, yet only today I came to realise the *Messages* buffer
  ;; has been granted its own major-mode. The practical difference is that the buffer is now
  ;; 'read-only' and has a 'non-writing-oriented' key-map.
  ;;
  (defun my-bind-common-bindings-to-message-buffer ()
  	;; ;;
  	;; ;; This doesn't work, the 'messages-buffer-mode-hook' function won't be called!!!
  	;; ;;
  	;; (add-hook
  	;; 	'messages-buffer-mode-hook
  	;; 	#'my-bind-common-bindings-to-messages-buffer
  	;; )

  	;;
  	;; You have to get back the message buffer instance and run ;; 'my-common-bindings' 
  	;; on it!!!
  	;;
  	(when-let ((messages-buffer (get-buffer "*Messages*")))
  		(with-current-buffer messages-buffer
  			;; (evil-normalize-keymaps)
  			;; (message ">>> called 'evil-normalize-keymaps' on 'MessageBuffer'")
  			(my-common-bindings evil-normal-state-local-map)
  			(message ">>> called 'my-common-bindings' on 'MessageBuffer'")
  		)
  	)
  )



  ;;
  ;; 'my-bind-common-bindings-to-these-mode-hooks' has to be called when all 'xxx-mode-hook'
  ;; are avaiable. Otherwise, 'my-xxx-mode-local-bindings' won't be called for some modes!!!
  ;;
  ;; That's why you should call this function for the 'after-init-hook', as all 'xxx-mode-hook'
  ;; should be ready after the frame has been inited.
  ;;
  (add-hook
  	'after-init-hook
  	(lambda ()
  		(my-bind-common-bindings-to-message-buffer)
  		(message ">>> 'my-bind-common-bindings-to-message-buffer' has been called by 'after-init-hook'")

  		(my-bind-common-bindings-to-these-mode-hooks)
  		(message ">>> 'my-bind-common-bindings-to-these-mode-hooks' has been called by 'after-init-hook'")

  		(my-visual-mode-special-bindings)
  		(message ">>> 'my-visual-mode-special-bindings' has been called by 'after-init-hook'")
  	)
  )





#+END_SRC


*** LSP

**** Go to next or previous error by ~C-n~ or ~C-p~

#+BEGIN_SRC emacs-lisp
  (defun my-lsp-error-jumping-in-local-buffer()
  	(keymap-set evil-normal-state-local-map "C-n" 'flymake-goto-next-error)
  	(keymap-set evil-normal-state-local-map "C-p" 'flymake-goto-prev-error)
  	
  	(message ">>> [ my-lsp-error-jumping-in-local-buffer ] Set 'C-n' and 'C-p' to local buffer")
  )
#+END_SRC


**** Format buffer by ~<leader>ff~

#+BEGIN_SRC emacs-lisp
  (defun my-lsp-format-buffer()
  	;;(keymap-set evil-normal-state-local-map "<leader>ff" 'lsp-format-buffer)
  	
  	(keymap-set evil-normal-state-local-map "SPC f f" 'eglot-format-buffer)
  	
  	(message ">>> [ my-lsp-format-buffer ] Set '<leader>ff' to local buffer")
  )
#+END_SRC


**** Rename by ~<leader>rn~

#+BEGIN_SRC emacs-lisp
  (defun my-lsp-rename-buffer()
  	;; (keymap-set evil-normal-state-local-map "<leader>rn" 'lsp-rename)
  	
  	(keymap-set evil-normal-state-local-map "SPC r n" 'eglot-rename)
  	
  	(message ">>> [ my-lsp-rename-buffer ] Set '<leader>rn' to local buffer")
  )
#+END_SRC


**** Show error (diagnostics buffer) ~<leader>se~

#+BEGIN_SRC emacs-lisp
  (defun my-lsp-show-error()
  	(keymap-set evil-normal-state-local-map "SPC s e" 'flymake-show-buffer-diagnostics)
  	
  	(message ">>> [ my-lsp-show-error ] Set '<leader>se' to local buffer")
  )
#+END_SRC


**** Run code action ~<leader>ca~

#+BEGIN_SRC emacs-lisp
  (defun my-lsp-code-action()
  	;; (keymap-set evil-normal-state-local-map "<leader>ca" 'lsp-execute-code-action)
  	;; (keymap-set evil-normal-state-local-map "C-c c a" 'lsp-execute-code-action)
  	
  	(keymap-set evil-normal-state-local-map "SPC c a" 'eglot-code-action-quickfix)
  	
  	(message ">>> [ my-lsp-code-action ] Set '<leader>ca' to local buffer")
  )
#+END_SRC


**** Toggle inlay hints by ~<leader>th~

#+BEGIN_SRC emacs-lisp
  (defun my-lsp-toggle-inlay-hint()
  	(interactive)
  	(message ">>>>> called.")
  	(if eglot-inlay-hints-mode
  	    (progn
  	        (message ">>> [ my-lsp-toggle-inlay-hint ] Inlay hint is 'on', turn it 'off' now.")
  	        (eglot-inlay-hints-mode -1)
  	    )
  	    (progn
  	        (message ">>> [ my-lsp-toggle-inlay-hint ] Inlay hint is 'off', turn it 'on' now.")
  	        (eglot-inlay-hints-mode 1)
  	    )
  	)
  )

  (defun my-setup-toggle-inlay-hint()
      (keymap-set evil-normal-state-local-map "SPC t h" 'my-lsp-toggle-inlay-hint)

      (message ">>> [ my-setup-toggle-inlay-hint ] Set '<leader>th' to local buffer")
  )
#+END_SRC


**** Go to next or previous error by =C-n= or =C-p= in =compliaciton-mode=

#+BEGIN_SRC emacs-lisp
  (defun my-compilation-error-jumping-in-local-buffer()
  	(keymap-set evil-normal-state-local-map "C-n" 'compilation-next-error)
  	(keymap-set evil-normal-state-local-map "C-p" 'compilation-previous-error)
  	
  	(message ">>> [ my-compilation-error-jumping-in-local-buffer ] Set 'C-n' and 'C-p' to local buffer")
  )
#+END_SRC


**** +Open embark collect buffer by ~<leader>im~+

I regret the following way, as I think the default ~consult-imenu~ is still better than the ~embark-collect~!!!

#+BEGIN_SRC emacs-lisp :tangle no
  (defun my-lsp-mode-heading-catalog-local()
  	(keymap-set evil-normal-state-local-map "SPC i m" 'embark-collect)

  	(if my-enable-which-key-customized-description
  		(progn
  			(which-key-add-key-based-replacements "SPC i m" "LSP Catalog")
  		)
  	)
  )
#+END_SRC


