emacs-250913/configuration.org
**** Bind all bindings above in one shot

#+BEGIN_SRC emacs-lisp
  (defun my-lsp-bindings()
  	(my-lsp-error-jumping-in-local-buffer)
  	(my-lsp-format-buffer)
  	(my-lsp-rename-buffer)
  	(my-lsp-show-error)
  	(my-lsp-code-action)
  	(my-setup-toggle-inlay-hint)

  	(if my-enable-which-key-customized-description
  		(progn
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC f" "Format")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC f f" "Format")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC r" "Rename")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC r n" "Rename")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC s" "Show errors")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC s e" "Show errors")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC c" "Code actions")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC c a" "Code actions")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC /" "Comment")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC t" "Toggle")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC t h" "Toggle hints")
  		))
  )

  (dolist (hook '(c-mode-hook
                  c-ts-mode-hook
                  c++-mode-hook
                  c++-ts-mode-hook
                  zig-mode-hook
                  zig-ts-mode-hook
                  rust-mode-hook
                  rust-ts-mode-hook
                  typescript-ts-mode-hook
                  js-ts-mode-hook
                  java-ts-mode-hook
                  python-ts-mode-hook
                  ))
  	(add-hook hook #'my-lsp-bindings)
  )

  (add-hook 'compilation-mode-hook #'my-compilation-error-jumping-in-local-buffer)
#+END_SRC


*** Org mode

#+BEGIN_SRC emacs-lisp
  (defun my-org-jump-to-next-heading ()
  	(interactive)
  	(org-forward-heading-same-level nil)
  	(evil-scroll-line-to-center nil)
  )

  (defun my-org-jump-to-previous-heading ()
  	(interactive)
  	(org-backward-heading-same-level nil)
  	(evil-scroll-line-to-center nil)
  )

  (defun my-org-jump-up-to-parent-heading ()
  	(interactive)
  	(outline-up-heading 1)
  	(evil-scroll-line-to-center nil)
  )

  ;;
  ;; My 'org-mode' bindings
  ;;
  (defun my-org-mode-bindings (map)
  	;;
  	;; Fold or unfold when cursor is on heading by '<RET>'
  	;;
  	(keymap-set map "RET" 'org-cycle)

  	;;
  	;; Open code edit by '<leader>ce'
  	;;
  	(keymap-set map "SPC c e" 'org-edit-special)

  	;;
  	;; Open embark collect buffer by '<leader>im' 
  	;; Use 'imenu' keybindings just easy for me to remember, nothing special:)
  	;;
  	(keymap-set map "SPC i m" 'embark-collect)

  	;;
  	;; Insert/edit a link by '<leader>il' and open a link by '<leader>ol' 
  	;;
  	(keymap-set map "SPC i l" 'org-insert-link)
  	(keymap-set map "SPC o l" 'org-open-at-point)

  	;;
  	;; Narrowing start and end by '<leader>ns' and '<leader>ne'
  	;;
  	(keymap-set map "SPC n i" 'org-narrow-to-subtree)
  	(keymap-set map "SPC n o" 'widen)

  	;;
  	;; Jump between same level headings by '<C-j>' and '<C-k>'
  	;;
  	(keymap-set map "C-j" 'my-org-jump-to-next-heading)
  	(keymap-set map "C-k" 'my-org-jump-to-previous-heading)

  	;;
  	;; Jump back to up 1 level heading by '<C-left>'
  	;;
  	(keymap-set map "C-<left>" 'my-org-jump-up-to-parent-heading)

  	;;
  	;; Cycle through the TODO state by '<C-Right>'
  	;;
  	(keymap-set map "C-<right>" 'org-todo)

  	(if my-enable-which-key-customized-description
  		(progn

  			(which-key-add-major-mode-key-based-replacements major-mode "SPC c e" "Code Edit")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC i m" "Org Heading Catalog")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC o l" "Link")
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC i l" "Insert link")

              (which-key-add-major-mode-key-based-replacements major-mode "SPC n" "(Org) Narrowing")
              (which-key-add-major-mode-key-based-replacements major-mode "SPC n i" "Org Narrowing In")
              (which-key-add-major-mode-key-based-replacements major-mode "SPC n o" "Org Narrowing Out")
  		)
  	)
  )

  ;;
  ;; Call 'my-org-mode-binding' with 'evil-normal-state-local-map'
  ;;
  (defun my-org-mode-local-bindings ()
  	(my-org-mode-bindings evil-normal-state-local-map)
  )


  ;;
  ;; Then, add it to the 'org-mode-hook'
  ;;
  (add-hook 'org-mode-hook #'my-org-mode-local-bindings)
#+END_SRC



*** Markdown

#+BEGIN_SRC emacs-lisp
  (defun my-markdown-next-heading()
  	(interactive)
  	(outline-next-visible-heading 1)
  	(evil-scroll-line-to-center nil)
  )

  (defun my-markdown-previous-heading()
  	(interactive)
  	(outline-next-visible-heading -1)
  	(evil-scroll-line-to-center nil)
  )

  ;;
  ;; My 'markdown-mode' and 'markdown-view-mode' bindings
  ;;
  (defun my-markdown-mode-bindings (map)
  	;;
  	;; Fold or unfold when cursor is on heading by '<RET>'
  	;;
  	(keymap-set map "RET" 'markdown-cycle)

  	;;
  	;; Jump between same level headings by '<C-j>' and '<C-k>'
  	;;
  	(keymap-set map "C-j" 'my-markdown-next-heading)
  	(keymap-set map "C-k" 'my-markdown-previous-heading)
  )

  ;;
  ;; Call 'my-markdown-mode-binding' with 'evil-normal-state-local-map'
  ;;
  (defun my-markdown-mode-local-bindings ()
  	(my-markdown-mode-bindings evil-normal-state-local-map)
  )


  ;;
  ;; Then, add it to the related mode hooks
  ;;
  (dolist (hook '(
                 markdown-mode-hook
                 markdown-view-mode-hook
                 ))
  	(add-hook hook #'my-markdown-mode-local-bindings)
  )
#+END_SRC


