emacs-250913/configuration.org
*** Dired

#+BEGIN_SRC emacs-lisp
  (defun my-dired-yank-full-path ()
  	(interactive)
  	(dired-copy-filename-as-kill 0)
  )

  (defun my-dired-sort-by-time ()			(interactive) (dired-sort-other "-lht"))
  (defun my-dired-sort-by-size ()			(interactive) (dired-sort-other "-lhS"))
  (defun my-dired-sort-by-name ()			(interactive) (dired-sort-other "-lh"))
  ;; (defun my-dired-sort-by-directory ()	(interactive) (dired-sort-other "-l --group-directories-first"))

  (defun my-goto-home-directory()			(interactive) (dired "~/"))
  (defun my-goto-desktop-directory()		(interactive) (dired "~/Desktop"))
  (defun my-goto-sbzi-directory()			(interactive) (dired "~/sbzi"))
  (defun my-goto-emacs-directory()		(interactive) (dired "~/.config/emacs"))
  (defun my-goto-downloads-directory()	(interactive) (dired "~/Downloads"))

  (defun my-dired-add-file-or-directory ()

  "In 'dired-mode', press 'A' to show a prompt.
  If the filename end with '/' that means create diretory, otherwise, create an empty file.
  "

  	(interactive)
  	(let ((filename ""))
  		;;
  		;; Ask for the new file or directory name
  		;;
  		(setq filename  (completing-read
  			;;
  			;; The prompt
  			;;
  			"Create new file or directory: "

  			;;
  			;; List: can be either
  			;;
  			;; - A 'list' instance, e.g: (list "./configure.sh" "./run.sh" "./run-test.sh")
  			;; - A 'list' variable name, e.g: cmd-list
  			;; - A 'function': the function is solely responsible for performing completion; 'completion-read'
  			;;                 returns whatever this function returns. The function is called with three
  			;;                 arguments: 'string predicate nil'
  			;;
  			;;				   You can read more from 'Programmed completion':
  			;;				   https://www.gnu.org/software/emacs/manual/html_node/elisp/Programmed-Completion.html
  			;;
  			nil

  			;;
  			;; 'PREDICATE' function (not provided)
  			;;
  			nil

  			;;
  			;; 'REQUIRE-MATCH': input must match in the 'List'
  			;;
  			;; - t means that the user is not allowed to exit unless the input is (or
  			;;   completes to) an element of COLLECTION or is null.
  			;;
  			;; - nil means that the user can exit with any input.
  			;;
  			;; - confirm means that the user can exit with any input, but she needs
  			;;   to confirm her choice if the input is not an element of COLLECTION.
  			;;
  			'confirm

  			;;
  			;; 'INIT-INPUT': simulate you type in the input area
  			;;
  			nil

  			;;
  			;; 'HIST': History list (not provided)
  			;;
  			nil

  			;;
  			;; 'DEF': Default value, put it to the top position!!!
  			;;
  			""
  			))
  		(message ">>> Your file or directory name: %s" filename)

  		(if (not (string-empty-p filename))
  			(progn
  				(if (string-suffix-p "/" filename)
  					(dired-create-directory filename)
  					(dired-create-empty-file filename)
  				)
  			)
  		)
  	)
  )

  ;;
  ;; My 'dired-mode' bindings
  ;;
  (defun my-dired-mode-bindings (map)
  	;;
  	;; Jump back to 'dired buffer' corresponding to current buffer by 'C-c j'
  	;;
  	(keymap-set map "C-c j" 'my-dired-jump)

  	;;
  	;; Go up dir by 'h' and into dir or open file by 'l'
  	;;
  	(keymap-set map "h" 'dired-up-directory)
  	(keymap-set map "l" 'dired-find-file)

  	;;
  	;; Open file to other window by 'o'
  	;;
  	(keymap-set map "z" 'dired-do-compress-to)

  	;;
  	;; Compress file/files (marked or not) by 'z'
  	;;
  	(keymap-set map "o" 'dired-find-file-other-window)

  	;;
  	;; Toggle hidden files by 'sh'
  	;;
  	;; Before this can work, you have to make sure that you have the following settings
  	;; to show hidden files by default:
  	;;
  	;; '(setq dired-listing-switches "-lhta")'
  	;;
  	(setq dired-omit-files "^\\...+$")
  	(keymap-set map "s h" 'dired-omit-mode)

  	;;
  	;; Yank ful path by 'yp' 
  	;;
  	(keymap-set map "y p" 'my-dired-yank-full-path)

  	;;
  	;; Sort with different conditions by 'sX'
  	;;
  	(keymap-set map "s t" 'my-dired-sort-by-time)
  	(keymap-set map "s s" 'my-dired-sort-by-size)
  	(keymap-set map "s n" 'my-dired-sort-by-name)
  	;; (keymap-set map "s d" 'my-dired-sort-by-directory)

  	;;
  	;; Quickly go to particular directories by 'gX'
  	;;
  	;; - 'gh': Go home       '~/'
  	;; - 'gd': Go Desktop    '~/Desktop'
  	;; - 'gs': Go sbzi       '~/sbzi'
  	;; - 'ge': Go Emacs      '~/.config/emacs'
  	;;
  	(keymap-set map "g h" 'my-goto-home-directory)
  	(keymap-set map "g d" 'my-goto-desktop-directory)
  	(keymap-set map "g s" 'my-goto-sbzi-directory)
  	(keymap-set map "g e" 'my-goto-emacs-directory)

  	;;
  	;; Modify the READ-ONLY buffer by '<leader>m'
  	;;
  	;; After going into the 'wdired-change-to-wdired-mode', here are the default keybindgins
  	;; to accept or discard changes:
  	;; 
  	;; 'C-c C-c': Accept changes
  	;; 'C-c C-k': Discard changes
  	;;
  	(keymap-set map "SPC m" 'dired-toggle-read-only)

  	;;
  	;; Add file or directory by 'A'
  	;;
  	(keymap-set map "A" 'my-dired-add-file-or-directory)

  	(if my-enable-which-key-customized-description
  		(progn
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC m"	"Modify mode")
  			(which-key-add-major-mode-key-based-replacements major-mode "s"	"Sort")
  			(which-key-add-major-mode-key-based-replacements major-mode "s t"	"Sort by time")
  			(which-key-add-major-mode-key-based-replacements major-mode "s s"	"Sort by size")
  			(which-key-add-major-mode-key-based-replacements major-mode "s n"	"Sort by name")
  			;; (which-key-add-key-based-replacements "s d"		"Sort by directory")
  			(which-key-add-major-mode-key-based-replacements major-mode "s h"	"(Toggle) show hidden")
  			(which-key-add-major-mode-key-based-replacements major-mode "y p"	"Yank path")
  		)
  	)
  )

  ;;
  ;; Call 'my-dired-mode-binding' with 'map'
  ;;
  (defun my-dired-mode-local-bindings ()
  	(my-dired-mode-bindings evil-normal-state-local-map)
  )

  ;;
  ;; Then, add it to the 'dired-mode-hook'
  ;;
  (add-hook 'dired-mode-hook #'my-dired-mode-local-bindings)
#+END_SRC


*** emacs-lisp-mode

#+BEGIN_SRC emacs-lisp
  ;;
  ;; My 'emacs-lisp-mode' bindings
  ;;
  (defun my-emacs-lisp-mode-bindings (map)
  	;;
  	;; Open embark collect buffer by '<leader>im' 
  	;; Use 'imenu' keybindings just easy for me to remember, nothing special:)
  	;;
  	(keymap-set map "SPC i m" 'embark-collect)

  	(if my-enable-which-key-customized-description
  		(progn
  			(which-key-add-major-mode-key-based-replacements major-mode "SPC i m" "Lisp embark list")
  		)
  	)
  )

  ;;
  ;; Call 'my-emacs-lisp-mode-binding' with 'evil-normal-state-local-map'
  ;;
  (defun my-emacs-lisp-mode-local-bindings ()
  	(my-emacs-lisp-mode-bindings evil-normal-state-local-map)
  )


  ;;
  ;; Then, add it to the 'emacs-lisp-mode-hook'
  ;;
  (add-hook 'emacs-lisp-mode-hook #'my-emacs-lisp-mode-local-bindings)
#+END_SRC


*** Image Dired

#+BEGIN_SRC emacs-lisp
  ;;
  ;; Fit the rendered image to window by '='
  ;;
  (evil-define-key '(normal) image-mode-map (kbd "=") 'image-transform-fit-to-window)
#+END_SRC


*** Embark

**** Run ~embark-act~ by ~C-e~

#+BEGIN_SRC emacs-lisp
  (keymap-set global-map "C-e" 'embark-act)
#+END_SRC


For the =GUI= version:

Because of I use =vertico-posframe= in =GUI= mode, but =Embark= doesn't work well with popup. That's why if you press =C-e=, then =Embark menu= shows under the popup which means you can't see part of it. In that situation, you can press =C-h=, then the =Embark help menu= will re-rendered inside the popup!!!


