emacs-250913/configuration.org
**** ~embark-collect-mode~ bindings

#+BEGIN_SRC emacs-lisp
  (defun my-embark-move-down-hit-enter()
  	(interactive)
  	(evil-next-line)
  	(push-button)
  )

  (defun my-embark-move-up-hit-enter()
  	(interactive)
  	(evil-previous-line)
  	(push-button)
  )

  ;;
  ;; My 'embark-collect-mode' bindings
  ;;
  (defun my-embark-collect-mode-bindings (map)
  	;;
  	;; '<C-j>' and '<C-k>' move up and down
  	;;
    	(keymap-set evil-normal-state-local-map "C-j" 'my-embark-move-down-hit-enter)
    	(keymap-set evil-normal-state-local-map "C-k" 'my-embark-move-up-hit-enter)
  )

  ;;
  ;; Call 'my-embark-collect-mode-binding' with 'evil-normal-state-local-map'
  ;;
  (defun my-embark-collect-mode-local-bindings ()
  	(my-embark-collect-mode-bindings evil-normal-state-local-map)
  )


  ;;
  ;; Then, add it to the 'embark-collect-mode-hook'
  ;;
  (add-hook 'embark-collect-mode-hook #'my-embark-collect-mode-local-bindings)
#+END_SRC


*** Increase or decrease font size by ~M--~ and ~M-=~ (only works for GUI mode)

#+BEGIN_SRC emacs-lisp
  (dolist (map (list
                evil-motion-state-map
                evil-normal-state-map
                ))
      (keymap-set map "M--" 'text-scale-decrease)
      (keymap-set map "M-=" 'text-scale-increase)
  )
#+END_SRC



*** +denote+

All the following bindings are disabled at this moment!!!

I'll upgarde them to the latest bindings pattern when I need =denote= again!!!

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Unbind my prefix-key
  ;;
  (keymap-set evil-normal-state-map "SPC n" nil)
  (dolist (map (list
                evil-motion-state-map
                evil-normal-state-map
                ))
    (keymap-set map "SPC n" nil)
    (keymap-set map "SPC n l" nil)
  )

  (dolist (map (list
                evil-motion-state-map
                ))
    (keymap-set map "SPC i m" 'consult-imenu)
    (keymap-set map "C-c i m" 'consult-imenu)

    (keymap-set map "SPC n c" 'denote)
    (keymap-set map "SPC n o" 'denote-open-or-create)
    (keymap-set map "SPC n f" 'denote-type)
    (keymap-set map "SPC n t" 'denote-template)
    (keymap-set map "SPC n r" 'denote-rename-file)

    (keymap-set map "SPC n l a" 'denote-link)
    (keymap-set map "SPC n l c" 'denote-link-or-create)
    (keymap-set map "SPC n l r" 'denote-add-links)
    (keymap-set map "SPC n l f" 'denote-find-link)
    (keymap-set map "SPC n l b" 'denote-backlinks)
  )

  ;;
  ;; 'which-key' description
  ;;
  (if my-enable-which-key-customized-description
      (progn
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n" "Denote")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n c" "Create note")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n o" "Open (or create) note")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n f" "Create note by file-type")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n t" "Create note by template")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n r" "Rename")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n l" "Denote Links")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n l a" "Add link")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n l c" "Add (or create) link")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n l r" "Regexp links")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n l f" "Find links")
          (which-key-add-major-mode-key-based-replacements major-mode "SPC n l b" "Back-links")
      ))
#+END_SRC



*** eww

#+BEGIN_SRC emacs-lisp
  ;;
  ;; My 'eww-mode' bindings
  ;;
  (defun my-eww-mode-bindings (map)
  	;;
  	;; Disable the default keybindings
  	;;
    	;; (keymap-set map "SPC" nil)
    	(keymap-set map "w" nil)

  	;;
  	;; Rebind to 'Qutebrowser-liked' keybindings
  	;;
  	;; Here are the default bindings, for reference:
  	;;
  	;; (keymap-set evil-normal-state-local-map "y u" 'shr-maybe-probe-and-copy-url)
  	;; &		eww-browse-with-external-browser
  	;; H		eww-back-url
  	;; L		eww-forward-url
  	;; R
  	;; U		eww-top-url
  	;; ^		eww-up-url
  	;; d		eww-download
  	;; m		eww-add-bookmark
  	;; o		eww
  	;; q		quit-window
  	;; r		eww-readable
  	;; u		eww-up-url
  	;; DEL		eww-back-url
  	;; S-SPC		scroll-down-command
  	;; S-<return>	eww-browse-with-external-browser
  	;; <backtab>	shr-previous-link
  	;; <tab>		shr-next-link
  	;;
  	;; Z Q		quit-window
  	;; Z Z		quit-window
  	;;
  	;; [ [		eww-previous-url
  	;;
  	;; ] ]		eww-next-url
  	;;
  	;; z d		eww-toggle-paragraph-direction
  	;; z e		eww-set-character-encoding
  	;; z f		eww-toggle-fonts
  	;;
  	;; g b		eww-list-bookmarks
  	;; g c		url-cookie-list
  	;; g f		eww-view-source
  	;; g h		eww-list-histories
  	;; g j		eww-next-url
  	;; g k		eww-previous-url
  	;; g o		eww-browse-with-external-browser
  	;; g r		eww-reload
  	;; g t		eww-list-buffers
  	;;

  	; Open URL
  	(keymap-set map "o" 'eww)
  	(keymap-set map "O" 'eww-open-in-new-buffer)

  	; Reload
  	(keymap-set map "r" 'eww-reload)

  	; Toggle read list (remove all navigation menus parts)
  	(keymap-set map "R" 'eww-readable)

  	; Page up and down
  	(keymap-set map "u" 'evil-scroll-up)
  	(keymap-set map "d" 'evil-scroll-down)

  	; Add or update bookmark
  	(keymap-set map "m" 'consult-bookmark)

  	;;
  	;; Open embark collect buffer (kind of navigation URL list with title) by '<SPC i m>'
  	;;
  	(keymap-set map "SPC i m" 'embark-collect)
  )

  ;;
  ;; Call 'my-eww-mode-binding' with 'evil-normal-state-local-map'
  ;;
  (defun my-eww-mode-local-bindings ()
  	(my-eww-mode-bindings evil-normal-state-local-map)
  )

  ;;
  ;; Then, add it to the 'eww-mode-hook'
  ;;
  (add-hook 'eww-mode-hook #'my-eww-mode-local-bindings)



  ;;
  ;; My 'eww-history-mode' and 'eww-bookmark-mode' bindings
  ;;
  (defun my-eww-history-and-bookmark-modeb-indings (map)
  	;;
  	;; use '<C-j>' and '<C-k>' to move up and down
  	;;
  	(keymap-set map "C-j" 'evil-next-line)
  	(keymap-set map "C-k" 'evil-previous-line)
  )

  ;;
  ;; Call 'my-eww-mode-binding' with 'evil-normal-state-local-map'
  ;;
  (defun my-eww-history-and-bookmark-modeb-local-indings ()
  	(my-eww-history-and-bookmark-modeb-indings evil-normal-state-local-map)
  )


  ;;
  ;; Then, add it to the 'eww-mode-hook'
  ;;
  (add-hook 'eww-history-mode-hook #'my-eww-history-and-bookmark-modeb-local-indings)
  (add-hook 'eww-bookmark-mode-hook #'my-eww-history-and-bookmark-modeb-local-indings)

#+END_SRC


