emacs-250913/init.el
;; Here are the default bindings for 'org-agenda-mode', for reference:
;;
;; o		org-agenda-goto
;; C-k		org-agenda-kill
;; RET		org-agenda-switch-to
;; C-_		org-agenda-undo
;; SPC		org-agenda-show-and-scroll-up
;; !		org-agenda-toggle-deadlines
;; #		org-agenda-dim-blocked-tasks
;; $		org-agenda-archive
;; %		org-agenda-bulk-mark-regexp
;; *		org-agenda-bulk-mark-all
;; +		org-agenda-priority-up
;; ,		org-agenda-priority
;; -		org-agenda-priority-down
;; .		org-agenda-goto-today
;; /		org-agenda-filter
;; 0 .. 9		digit-argument
;; :		org-agenda-set-tags
;; ;		org-timer-set-timer
;; <		org-agenda-filter-by-category
;; =		org-agenda-filter-by-regexp
;; >		org-agenda-date-prompt
;; ?		org-agenda-show-the-flagging-note
;; A		org-agenda-append-agenda
;; B		org-agenda-bulk-action
;; C		org-agenda-convert-date
;; D		org-agenda-toggle-diary
;; E		org-agenda-entry-text-mode
;; F		org-agenda-follow-mode
;; G		org-agenda-toggle-time-grid
;; H		org-agenda-holidays
;; I		org-agenda-clock-in
;; J		org-agenda-clock-goto
;; L		org-agenda-recenter
;; M		org-agenda-phases-of-moon
;; N		org-agenda-next-item
;; O		org-agenda-clock-out
;; P		org-agenda-previous-item
;; Q		org-agenda-Quit
;; R		org-agenda-clockreport-mode
;; S		org-agenda-sunrise-sunset
;; T		org-agenda-show-tags
;; U		org-agenda-bulk-unmark-all
;; X		org-agenda-clock-cancel
;; [		org-agenda-manipulate-query-add
;; \		org-agenda-filter-by-tag
;; ]		org-agenda-manipulate-query-subtract
;; ^		org-agenda-filter-by-top-headline
;; _		org-agenda-filter-by-effort
;; a		org-agenda-archive-default-with-confirmation
;; b		org-agenda-earlier
;; c		org-agenda-goto-calendar
;; d		org-agenda-day-view
;; e		org-agenda-set-effort
;; f		org-agenda-later
;; g		org-agenda-redo-all
;; h		org-agenda-holidays
;; i		org-agenda-diary-entry
;; j		org-agenda-goto-date
;; k		org-agenda-capture
;; l		org-agenda-log-mode
;; m		org-agenda-bulk-mark
;; n		org-agenda-next-line
;; o		delete-other-windows
;; p		org-agenda-previous-line
;; q		org-agenda-quit
;; r		org-agenda-redo
;; s		org-save-all-org-buffers
;; t		org-agenda-todo
;; u		org-agenda-bulk-unmark
;; v		org-agenda-view-mode-dispatch
;; w		org-agenda-week-view
;; x		org-agenda-exit
;; y		org-agenda-year-view
;; z		org-agenda-add-note
;; {		org-agenda-manipulate-query-add-re
;; |		org-agenda-filter-remove-all
;; }		org-agenda-manipulate-query-subtract-re
;; ~		org-agenda-limit-interactively
;; DEL		org-agenda-show-scroll-down
;; C-/		org-agenda-undo
;; C-S-<left>	org-agenda-todo-previousset
;; C-S-<right>	org-agenda-todo-nextset
;; M-<down>	org-agenda-drag-line-forward
;; M-<up>		org-agenda-drag-line-backward
;; S-<down>	org-agenda-priority-down
;; S-<left>	org-agenda-do-date-earlier
;; S-<right>	org-agenda-do-date-later
;; S-<up>		org-agenda-priority-up
;; <backspace>	org-agenda-show-scroll-down
;; <down>		org-agenda-next-line
;; <mouse-2>	org-agenda-goto-mouse
;; <mouse-3>	org-agenda-show-mouse
;; <tab>		org-agenda-goto
;; <undo>		org-agenda-undo
;; <up>		org-agenda-previous-line
;; M-*		org-agenda-bulk-toggle-all
;; M-m		org-agenda-bulk-toggle
;; C-c C-a		org-attach
;; C-c C-c		org-agenda-ctrl-c-ctrl-c
;; C-c C-d		org-agenda-deadline
;; C-c C-n		org-agenda-next-date-line
;; C-c C-o		org-agenda-open-link
;; C-c C-p		org-agenda-previous-date-line
;; C-c C-q		org-agenda-set-tags
;; C-c C-s		org-agenda-schedule
;; C-c C-t		org-agenda-todo
;; C-c C-w		org-agenda-refile
;; C-c C-z		org-agenda-add-note
;; C-c $		org-agenda-archive
;; C-c ,		org-agenda-priority
;; C-x C-s		org-save-all-org-buffers
;; C-x C-w		org-agenda-write
;; C-x u		org-agenda-undo
;; <remap> <backward-paragraph>	org-agenda-backward-block
;; <remap> <forward-paragraph>	org-agenda-forward-block
;; <remap> <move-end-of-line>	org-agenda-end-of-line
;; C-c C-x C-a	org-agenda-archive-default
;; C-c C-x C-c	org-agenda-columns
;; C-c C-x C-e	org-clock-modify-effort-estimate
;; C-c C-x TAB	org-agenda-clock-in
;; C-c C-x C-j	org-clock-goto
;; C-c C-x C-o	org-agenda-clock-out
;; C-c C-x C-s	org-agenda-archive
;; C-c C-x C-x	org-agenda-clock-cancel
;; C-c C-x !	org-reload
;; C-c C-x <	org-agenda-set-restriction-lock-from-agenda
;; C-c C-x >	org-agenda-remove-restriction-lock
;; C-c C-x A	org-agenda-archive-to-archive-sibling
;; C-c C-x I	org-info-find-node
;; C-c C-x _	org-timer-stop
;; C-c C-x a	org-agenda-toggle-archive-tag
;; C-c C-x b	org-agenda-tree-to-indirect-buffer
;; C-c C-x e	org-agenda-set-effort
;; C-c C-x p	org-agenda-set-property
;; C-c C-x <down>	org-agenda-priority-down
;; C-c C-x <left>	org-agenda-do-date-earlier
;; C-c C-x <right>	org-agenda-do-date-later
;; C-c C-x <up>	org-agenda-priority-up
;; C-c C-x RET g	org-mobile-pull
;; C-c C-x RET p	org-mobile-push

;;
;; My 'org-agenda-mode' bindings
;;
(defun my-org-agenda-mode-bindings (map)
  	;;
  	;; '<C-j>' and '<C-k>' jump between items
  	;;
  	(keymap-set map "C-j" 'org-agenda-next-line)
  	(keymap-set map "C-k" 'org-agenda-previous-line)

  	;;
  	;; 'u' to Undo
  	;;
  	(keymap-set map "u" 'org-agenda-undo)

  	;;
  	;; '/' to filter
  	;;
  	(keymap-set map "/" 'org-agenda-filter)

  	;;
  	;; 'RET' to open selected item
  	;;
  	(keymap-set map "RET" 'org-agenda-switch-to)

)

;;
;; Call 'my-org-agenda-mode-binding' with 'evil-normal-state-local-map'
;;
(defun my-org-agenda-mode-local-bindings ()
	(my-org-agenda-mode-bindings evil-normal-state-local-map)
)


;;
;; Then, add it to the 'org-agenda-mode-hook'
;;
(add-hook 'org-agenda-mode-hook #'my-org-agenda-mode-local-bindings)

(defun my-minibuffer-mode-local-bindings ()
	(keymap-set minibuffer-mode-map "C-h" 'previous-history-element)
	(keymap-set minibuffer-mode-map "C-l" 'next-history-element)
)

(add-hook 'minibuffer-setup-hook #'my-minibuffer-mode-local-bindings)
